{
  "juz": 25,
  "items": [
    {
      "qNum": 1,
      "question_ar": "المبتلى يخفف عنه عادة وجود أناس حوله مصابين بالمصائب . لكن هذا التعزي لا يكون واقعا مع أهل النار . اذكر آية تدل على ذلك.",
      "question_en": "A person afflicted with hardship is usually comforted by the presence of others who share similar trials. However, this consolation does not apply to the people of Hell. Mention a verse that indicates this.",
      "answer": {
        "surah": 43,
        "ayahs": [
          39
        ],
        "ayah_ar": "وَلَن يَنفَعَكُمُ اليَومَ إِذْ ظَلَمْتُم أَنَّكُم فِي العَذابِ مُشْتَرِكُونَ",
        "ayah_en": "And never will it benefit you that Day, when you have wronged, that you are sharing in the punishment.",
        "commentary_ar": "قال البغوي : ((وَلَن يَنفَعَكُمُ اليَومَ في الآخرة إذ ظَلَمتُم أشركتم في الدنيا أَنَّكُم فِي العَذابِ مُشتَرِكونَ) يعني لا ينفعكم الاشتراك في العذاب ولا يخفف الاشتراك عنكم شيئا من العذاب ؛ لأن لكل واحد من الكفار والشياطين الحظ الأوفر من العذاب ..",
        "commentary_en": "Al-Baghawi said: “And it will not benefit you on that Day in the Hereafter, when you wronged yourselves by associating partners (with Allah) in the worldly life, that you are sharing in the punishment.” Meaning: sharing in the punishment will not benefit you nor lessen anything of it, for each of the disbelievers and devils will have the fullest share of punishment."
      }
    },
    {
      "qNum": 2,
      "question_ar": "يظن بعض الناس أن فيه مقومات شخصية ومجدا ذاتيا لا يؤهله إلا لكل كرامة واحترام، وأنه لا يليق به شيء من المشقة والضرر، حتى يستبعد أن يتعرض لبلايا تكسر النفس وتذلها . اذكر آية تتحدث عن مثل هذه النفسيات.",
      "question_en": "Some people believe they possess personal merits and inherent greatness that entitle them only to honor and respect, thinking that hardship and humiliation are beneath them. Mention a verse that speaks about such personalities.",
      "answer": {
        "surah": 41,
        "ayahs": [
          50
        ],
        "ayah_ar": "وَلَئِن أَذَقْناهُ رَحْمَةً مِنَّا مِن بَعدِ ضَرَاءَ مَسَّتَهُ لَيَقُولَنَّ هذا لى وَمَا أَظُنُّ السَّاعَةَ قَائِمَةً وَلَبِن رُجِعتُ إِلى رَبِّي إِنَّ لى عِندَهُ لَلحُسنى فَلَنُنَبِنَّ الَّذِينَ كَفَرُوا بِمَا عَمِلُوا وَلَنُذِيقَنَّهُم مِن عَذابٍ غليظ",
        "ayah_en": "And if We let him taste mercy from Us after hardship has touched him, he will surely say, “This is mine, and I do not think the Hour will occur; and even if I am returned to my Lord, indeed, for me with Him will be the best.” But We will surely inform those who disbelieved of what they did, and We will surely make them taste a severe punishment.",
        "commentary_ar": "قال الطبري : ((لَيَقُولَنَّ هذا لى عند الله ، لأن الله راض عني برضاه عملي، وما أنا عليه مقيم).",
        "commentary_en": "At-Tabari said: “He will surely say: This is mine with Allah, because Allah is pleased with me due to my deeds and what I persist upon.”"
      }
    },
    {
      "qNum": 3,
      "question_ar": "يظن البعض أن مسألة وجود الله تعالى أغلبية قابلة للنقاش . ومما يؤدي به إلى هذا الوهم قوله : لو كان وجود الله أمرا قطعياً يقينيا فكيف يخفى على عدد من علماء الطبيعة الغربيين الأذكياء المتميزين في مجالهم. اذكر آية تقلب هذه الشبهة دليلا على قدرة الله .",
      "question_en": "Some think that the existence of Allah is merely a majority opinion open to debate. They argue: if Allah’s existence were certain, how could it be hidden from many intelligent Western scientists distinguished in their fields? Mention a verse that turns this doubt into proof of Allah’s power.",
      "answer": {
        "surah": 45,
        "ayahs": [
          23
        ],
        "ayah_ar": "أَفَرَأَيْتَ مَنِ اتَّخَذَ إِلَهَهُ هَواهُ وَأَضَلَّهُ اللَّهُ عَلى عِلمٍ وَخَتَمَ عَلَى سَمْعِهِ وَقَلْبِهِ وَجَعَلَ عَلَى بَصَرِهِ غِشَاوَةً فَمَن يَهْدِيهِ مِن بَعدِ اللَّهِ أَفَلا تَذَكَّرُونَ",
        "ayah_en": "Have you seen the one who takes his own desire as his god, and Allah has led him astray upon knowledge, and has set a seal upon his hearing and his heart and placed over his vision a covering? So who can guide him after Allah? Then will you not be reminded?",
        "commentary_ar": "من أوجه تفاسير (وَأَضَلَّهُ اللهُ عَلَى عِلم أن أضله الله بعد بلوغ العلم إليه، وقيام الحجة عليه. (ابن كثير)",
        "commentary_en": "Among the interpretations of “and Allah led him astray upon knowledge” is that Allah led him astray after knowledge had reached him and the proof had been established against him. (Ibn Kathir)"
      }
    },
    {
      "qNum": 4,
      "question_ar": "الإعلام يقرن التدين بالمنفّرات والعصيان بالمرغوبات ... اذكر ثلاث آيات متتاليات تذكرك بهذا المعنى.",
      "question_en": "Media often associates religiosity with undesirable traits and disobedience with appealing ones... Mention three consecutive verses that remind you of this meaning.",
      "answer": {
        "surah": 43,
        "ayahs": [
          33,
          34,
          35
        ],
        "ayah_ar": "وَلَولا أَن يَكونَ النَّاسُ أُمَّةً واحِدَةً لَجَعَلنا لِمَن يَكْفُرُ بِالرَّحْمَنِ لِبُيوتِهِم سُقُفًا مِن فِضَّةٍ وَمَعارِجَ عَلَيْها يَظْهَرُونَ\nوَلِبُيوتِهِم أَبوابًا وَسُرُرًا عَلَيْهَا يَتَّكِئونَ\nوَزُخْرُفًا وَإِن كُلُّ ذلِكَ لَمّا مَتَاعُ الحَياةِ الدُّنيا وَالآخِرَةُ عِندَ رَبِّكَ لِلْمُتَّقِينَ",
        "ayah_en": "And if it were not that mankind would become one community, We would have made for those who disbelieve in the Most Merciful—for their houses—ceilings of silver and stairways upon which to ascend,\nand for their houses doors and couches upon which to recline,\nand ornaments of gold. Yet all that is only the enjoyment of worldly life. And the Hereafter with your Lord is for the righteous.",
        "commentary_ar": "قال العديد من المفسرين : معنى الآية أن الله رحم عباده بأن لم يجعل الكفر مقترنا دوما بالغنى . وإلا فلو جعل الله للكافرين بيوتا سقفها ودرجها وسلالمها وأبوابها وسررها من فضة وذهب لأصبح عامة الناس أُمَّةً واحدةً على الكفر ! لأن الناس بجهلهم سيجعلون الكفر حينها سببا في رغد العيش. فهذا الاقتران - لو قدَّره الله - مؤثر جدا في النفوس، لكنه تعالى برحمته جعل في الأتقياء أغنياء وفي الأشقياء فقراء.\nفي أهل الدين أغنياء متعلمون أذكياء راقون خلوقون . وفي المحجبات متعلمات غنيات جميلات راقيات الذوق. لكن الإعلام الذي لا يريد إعلام الناس بالحقيقة - لا يسلط الضوء عليهم وعلى إنجازاتهم فله أهداف أخرى !",
        "commentary_en": "Many commentators said: The meaning of the verse is that Allah showed mercy to His servants by not constantly pairing disbelief with wealth. Otherwise, had Allah made for the disbelievers houses whose ceilings, stairs, doors, and couches were of silver and gold, most people would have become one community upon disbelief, since in their ignorance they would assume disbelief to be the cause of prosperity. Such a pairing—had Allah decreed it—would greatly influence souls. But out of His mercy, He placed wealth among the righteous and poverty among the wretched.\nAmong the people of religion are wealthy, educated, intelligent, refined, and noble individuals. Among veiled women are educated, wealthy, beautiful, and refined women of taste. Yet media that does not wish to convey the truth does not highlight them or their achievements, for it has other objectives."
      }
    },
    {
      "qNum": 5,
      "question_ar": "كل ما خالف أحكام الله تعالى فلا يمكن وصفه بأنه سياسة حسنة ولا إصلاح ولا عدل ولا مراعاة للتعددية ... اذكر آيتين في سورتين مختلفتين تدلان على ذلك.",
      "question_en": "Anything that contradicts Allah’s rulings cannot be described as sound policy, reform, justice, or respect for diversity... Mention two verses from two different surahs that indicate this.",
      "answer": {
        "surah": [
          42
        ],
        "ayahs": [
          15
        ],
        "ayah_ar": "ثُمَّ جَعَلْنَاكَ عَلى شَريعَةٍ مِنَ الأَمرِ فَاتَّبِعها وَلا تَتَّبِع أَهْوَاءَ الَّذِينَ لَا يَعْلَمُون (*)\nفَلِذلِكَ فَادْعُ وَاسْتَقِم كَما أُمِرْتَ وَلا تَتَّبِع أَهْوَاءَهُم وَقُلْ آمَنتُ بِمَا أَنزَلَ اللَّهُ مِن كتابٍ وَأُمِرْتُ لِأَعدِلَ بَيْنَكُمُ اللَّهُ رَبُّنا وَرَبُّكُم لَنَا أَعْمَالُنَا وَلَكُم أَعْمَالُكُم لا حُجَّةَ بَينَنا وَبَيْنَكُمُ اللَّهُ يَجْمَعُ بَينَنا وَإِلَيْهِ المَصِيرُ",
        "ayah_en": "Then We put you upon a clear law of the matter; so follow it and do not follow the desires of those who do not know.\nSo to that [religion] invite, and remain steadfast as you are commanded, and do not follow their desires, and say, “I believe in whatever Book Allah has sent down, and I am commanded to be just among you. Allah is our Lord and your Lord. For us are our deeds, and for you your deeds. There is no argument between us and you. Allah will bring us together, and to Him is the destination.”",
        "commentary_ar": "",
        "commentary_en": "The first verse is al Jathiyah verse 18"
      }
    },
    {
      "qNum": 6,
      "question_ar": "يتعمد أهل الباطل نشر الرذائل والشهوات المحرمة في أقوامهم ليسهل عليهم سوقهم في طريق الضلال وحملهم على تنفيذ ما يأمرونهم به من باطل . اذكر آية تشير إلى هذا المعنى.",
      "question_en": "The people of falsehood deliberately spread immorality and forbidden desires among their people to more easily lead them astray and make them carry out their commands of falsehood. Mention a verse that points to this meaning.",
      "answer": {
        "surah": 43,
        "ayahs": [
          54
        ],
        "ayah_ar": "فَاسْتَخَفَّ قَومَهُ فَأَطاعوهُ إِنَّهُم كانوا قوما فاسقينَ",
        "ayah_en": "So he made his people light-minded, and they obeyed him. Indeed, they were a defiantly disobedient people.",
        "commentary_ar": "",
        "commentary_en": ""
      }
    },
    {
      "qNum": 7,
      "question_ar": "كلمة أطلقها الله تعالى على وحيه ؛ نستدل من خلالها على أن الإنسان الذي يعيش بعيدًا عن الوحي وإقامة أمر الله يشبه جثة هامدة لا حياة فيها . اذكر الكلمة والآية التي وردت فيها.",
      "question_en": "A word that Allah used to describe His revelation, from which we understand that a person living away from revelation and establishing Allah’s command resembles a lifeless body. Mention the word and the verse in which it appears.",
      "answer": {
        "surah": 42,
        "ayahs": [
          52
        ],
        "ayah_ar": "﴿وَكَذلِكَ أَوحَيْنَا إِلَيكَ روحًا مِن أَمرنا ما كُنتَ تَدرى مَا الكِتابُ وَلَا الإيمان ولكن جَعَلناه نورًا نَهدى بِهِ مَن نَشَاءُ مِن عِبادِنَا وَإِنَّكَ لَتَهدى إلى صراط مستقيم﴾",
        "ayah_en": "And thus We have revealed to you a spirit from Our command. You did not know what the Book was nor faith, but We made it a light by which We guide whom We will of Our servants. And indeed, you guide to a straight path.",
        "commentary_ar": "قال السعدي: وهو هذا القرآن الكريم، سمّاه روحا، لأن الروح يحيا به الجسد، والقرآن تحيا به القلوب والأرواح، وتحيا به مصالح الدنيا والدين، لما فيه من الخير الكثير والعلم الغزير. وهو محض منة الله على رسوله وعباده المؤمنين، من غير سبب منهم.",
        "commentary_en": "As-Sa‘di said: It is this Noble Qur’an; He called it a spirit because the body lives by the spirit, and hearts and souls live by the Qur’an. Through it, the interests of worldly life and religion are revived due to the abundant good and vast knowledge within it. It is purely a favor from Allah upon His Messenger and the believing servants, without any cause from them."
      }
    },
    {
      "qNum": 8,
      "question_ar": "آية فيها وصفان جميلان دقيقان للقرآن. فحياة قلب كل واحد منا تكون بالقرآن، وكذا نجاته من الظلمات ، السؤال هو : اذكر هاتين الكلمتين .",
      "question_en": "A verse contains two precise and beautiful descriptions of the Qur’an: by it the heart lives, and by it one is saved from darkness. Mention these two words.",
      "answer": {
        "surah": 42,
        "ayahs": [
          52
        ],
        "ayah_ar": "﴿وَكَذَلِكَ أَوْحَيْنَا إِلَيْكَ رُوحًا مِنْ أَمْرِنَا مَا كُنتَ تَدْرِي مَا الْكِتَابُ وَلَا الْإِيمَانُ وَلَكِن جَعَلْنَاهُ نُورًا نَّهْدِى بِهِ مَن نَّشَاءُ مِنْ عِبَادِنَا وَإِنَّكَ لَتَهْدِي إِلَى صِرَاطٍ مُسْتَقِيمٍ﴾",
        "ayah_en": "And thus We have revealed to you a spirit from Our command. You did not know what the Book was nor faith, but We made it a light by which We guide whom We will of Our servants. And indeed, you guide to a straight path.",
        "commentary_ar": "قال السعدي (بتصرف ) : سماه روحا، لأن الروح يحيا به الجسد، والقرآن تحيا به القلوب والأرواح، وتحيا به مصالح الدنيا والدين ، لما فيه من الخير الكثير والعلم الغزير. وقوله سبحانه : ﴿جَعَلْنَاهُ نُورًا نَّهْدِى بِهِ مَنْ نَشَاءُ مِنْ عِبَادِنَا ... معنى نوراً : يستضيئون به في ظلمات الكفر والبدع، والأهواء المردية، ويعرفون به الحقائق، ويهتدون به إلى الصراط المستقيم.",
        "commentary_en": "As-Sa‘di (paraphrased) said: He called it a spirit because the body lives by the spirit, and the Qur’an brings life to hearts and souls and revives worldly and religious interests due to its abundant goodness and vast knowledge. As for His statement: “We made it a light by which We guide whom We will of Our servants,” meaning: they seek illumination through it in the darkness of disbelief, innovations, and destructive desires; through it they recognize realities and are guided to the straight path."
      }
    },
    {
      "qNum": 9,
      "question_ar": "قال إبراهيم عليه السلام لقومه : ( وَقَالَ إِنَّمَا اتَّخَذْتُم مِّن دُونِ اللَّهِ أَوْثَانًا مَّوَدَّةَ بَيْنِكُمْ فِي الْحَيَاةِ الدُّنْيَا ثُمَّ يَوْمَ الْقِيَامَةِ يَكْفُرُ بَعْضُكُم بِبَعْضٍ وَيَلْعَنُ بَعْضُكُم بَعْضًا وَمَأْوَاكُمُ النَّارُ وَمَا لَكُم مِّن نَّاصِرِينَ) [العنكبوت: 25].\nاذكر آية كريمة تحمل نفس المعنى.",
      "question_en": "Ibrahim (peace be upon him) said to his people: “And he said, ‘You have only taken idols besides Allah as affection among yourselves in worldly life. Then on the Day of Resurrection you will deny one another and curse one another, and your refuge will be the Fire, and you will not have any helpers.’” [Al-‘Ankabut: 25].\nMention a noble verse that carries the same meaning.",
      "answer": {
        "surah": 43,
        "ayahs": [
          67
        ],
        "ayah_ar": "الْأَخِلَّاءُ يَوْمَئِذٍ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ إِلَّا الْمُتَّقِينَ",
        "ayah_en": "Close friends, that Day, will be enemies to one another, except for the righteous.",
        "commentary_ar": "قال ابن كثير: (أي: كل صداقة وصحبة لغير الله فإنها تنقلب يوم القيامة عداوة إلا ما كان لله عز وجل، فإنه دائم بدوامه ) .",
        "commentary_en": "Ibn Kathir said: That is, every friendship and companionship not for the sake of Allah will turn into enmity on the Day of Resurrection, except what was for Allah, the Mighty and Majestic, for it endures with His permanence."
      }
    },
    {
      "qNum": 10,
      "question_ar": "كلمة وَرَدَتْ في حق المؤمنين والكافرين في السورة نفسها مرفوعة ومنصوبة بما يذكر بحديث : ( وعزتي لا أجمع على عبدي خوفيْنِ وأَمنِيْنِ، إِذا خافَني في الدُّنيا أَمَّنْتُه يوم القيامة ، وإذا أمِنَني في الدُّنيا أَخَفْتُه في الآخرة).",
      "question_en": "A word mentioned regarding both believers and disbelievers in the same surah—once in the nominative and once in the accusative—reminding of the hadith: “By My might, I do not combine two fears or two securities for My servant…” What is that word?",
      "answer": {
        "surah": 42,
        "ayahs": [
          18,
          22
        ],
        "ayah_ar": "يَسْتَعْجِلُ بِهَا الَّذِينَ لَا يُؤْمِنُونَ بِهَا وَالَّذِينَ آمَنُوا مُشْفِقُونَ مِنْهَا وَيَعْلَمُونَ أَنَّهَا الْحَقُّ أَلَا إِنَّ الَّذِينَ يُمَارُونَ فِي السَّاعَةِ لَفِي ضَلَالٍ بَعِيدٍ\nتَرَى الظَّالِمِينَ مُشْفِقِينَ مِمَّا كَسَبُوا وَهُوَ وَاقِعٌ بِهِمْ وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فِي رَوْضَاتِ الْجَنَّاتِ لَهُم مَّا يَشَاءُونَ عِندَ رَبِّهِمْ ذَلِكَ هُوَ الْفَضْلُ الْكَبِيرُ",
        "ayah_en": "Those who do not believe in it urge it on, while those who believe are fearful of it and know that it is the truth. Unquestionably, those who dispute concerning the Hour are in extreme error.\nYou will see the wrongdoers fearful of what they have earned, and it will fall upon them. But those who have believed and done righteous deeds will be in lush gardens of Paradise; for them is whatever they wish with their Lord. That is the great bounty.",
        "commentary_ar": "فالمؤمنون أشفقوا من عذاب الله تعالى في الدنيا فأمنهم الله يوم القيامة كما قال سبحانه : (قَالُوا إِنَّا كُنَّا قَبْلُ فِي أَهْلِنَا مُشْفِقِينَ فَمَنَّ اللَّهُ عَلَيْنَا وَوَقَانَا عَذَابَ السَّمُوم بينما الكافرون أمنوا من عذاب الله في الدنيا فأشفقوا مما كسبوا يوم القيامة .",
        "commentary_en": "Thus the believers were fearful of Allah’s punishment in the worldly life, so Allah granted them security on the Day of Resurrection, as He said: “They will say, ‘Indeed, we were previously among our people fearful, so Allah conferred favor upon us and protected us from the punishment of the scorching wind.’” Meanwhile, the disbelievers felt secure from Allah’s punishment in this world, so they became fearful of what they earned on the Day of Resurrection."
      }
    }
  ]
}