{
  "juz": 30,
  "items": [
    {
      "qNum": 1,
      "question_ar": "اذكر كلمة من آية يستدل بها على أن منزلة المؤمنين عند الله يوم القيامة أعظم من منزلة الملائكة .",
      "question_en": "Mention a word from a verse used as evidence that the rank of believers with Allah on the Day of Resurrection is greater than that of the angels.",
      "answer": {
        "surah": 98,
        "ayahs": [
          7
        ],
        "ayah_ar": "إِنَّ الَّذِينَ آمَنوا وَعَمِلُوا الصَّالِحاتِ أُولئِكَ هُم خَيْرُ البَرِيَّةِ [البينة : 7]",
        "ayah_en": "Indeed, those who believe and do righteous deeds—those are the best of creation.",
        "commentary_ar": "أخرج ابن أبي حاتم عن أبي هريرة قال : أتعجبون من منزلة الملائكة من الله، والذي نفسي بيده لمنزلة العبد المؤمن عند الله يوم القيامة أعظم من منزلة ملك، واقرءوا إن شئتم إِنَّ الَّذِينَ آمَنوا وَعَمِلُوا الصَّالِحَاتِ أُولئِكَ هُم خَيْرُ البَرِيَّة)).\nوأورد الدكتور محمد الشظيفي في رسالته (مباحث في المفاضلة في العقيدة ) : وهو مذهب جمهور أهل السنة والجماعة وكذا جمهور أصحاب الأشعري واستدلوا بأدلة ظاهرة الدلالة على قولهم، كقوله سبحانه : (وَإِذْ قُلْنَا لِلْمَلَائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ أَبَى وَاسْتَكْبَرَ وَكَانَ مِنَ الْكَافِرِينَ) [البقرة: 34]، والفاضل لا يسجد للمفضول ، وقوله سبحانه : (وَلَقَدِ اخْتَرْنَاهُمْ عَلَى عِلْمٍ عَلَى الْعَالَمِينَ) [الدخان : 32]. وقوله : (إِنَّ اللهَ اصْطَفَى آدَمَ وَنُوحًا وَآلَ إِبْرَاهِيمَ وَآلَ عِمْرَانَ عَلَى الْعَالَمِينَ) [آل عمران : 33] . هذه في الأنبياء، أما في صالح البشر فكقوله سبحانه : (إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أُوْلَبِكَ هُمْ خَيْرُ الْبَرِيَّةِ) [البينة :7].\nوقد فصل ابن تيمية في الفتاوى في هذه المسألة تفصيلاً طويلاً، ونقل عنه ابن القيم في بدائع الفوائد : ( أنه سئل عن صالحي بني آدم والملائكة أيهما أفضل ؟ فأجاب بأن صالحي البشر أفضل باعتبار كمال النهاية، والملائكة أفضل باعتبار البداية، فإن الملائكة الآن في الرفيق الأعلى منزهين عما يلابسه بنو آدم، مستغرقون في عبادة الرب، ولا ريب أن هذه الأحوال الآن أكمل من أحوال البشر، وأما يوم القيامة بعد دخول الجنة فيصير حال صالحي البشر أكمل من حال الملائكة ).",
        "commentary_en": "Ibn Abi Hatim reported from Abu Hurayrah that he said: Do you marvel at the rank of the angels with Allah? By the One in Whose hand is my soul, the rank of the believing servant with Allah on the Day of Resurrection is greater than that of an angel. Recite if you wish: “Indeed, those who believe and do righteous deeds—those are the best of creation.”\nDr. Muhammad Ash-Shadhifi mentioned in his treatise (Research on Preference in Creed) that this is the position of the majority of Ahl al-Sunnah and the majority of the Ash‘ari scholars. They cited clear evidences such as: “And when We said to the angels, ‘Prostrate to Adam,’ so they prostrated except Iblis…” [Al-Baqarah: 34], for the superior does not prostrate to the inferior. Also: “And We had certainly chosen them knowingly over the worlds” [Ad-Dukhan: 32], and: “Indeed, Allah chose Adam and Nuh and the family of Ibrahim and the family of ‘Imran over the worlds” [Aal ‘Imran: 33]. These refer to prophets; as for righteous humans, the verse: “Indeed, those who believe and do righteous deeds—those are the best of creation.” [Al-Bayyinah: 7].\nIbn Taymiyyah elaborated extensively on this matter, and Ibn al-Qayyim نقل in Bada’i‘ al-Fawa’id that he was asked which is superior: righteous humans or angels? He replied that righteous humans are superior considering the perfection of their end state, while angels are superior at the beginning; for angels are now in the highest company, free from what humans experience, absorbed in worship. Undoubtedly their present state is more complete than that of humans; but on the Day of Resurrection after entering Paradise, the state of righteous humans will be more complete than that of angels."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 2,
      "question_ar": "اذكر آية فيها (ثُمَّ) للترتيب الذكري.",
      "question_en": "Mention a verse in which “ثُمَّ” is used for rhetorical or mention-order sequencing rather than chronological delay.",
      "answer": {
        "surah": 90,
        "ayahs": [
          17
        ],
        "ayah_ar": "ثُمَّ كَانَ مِنَ الَّذِينَ آمَنُوا وَتَواصَوا بِالصَّبْرِ وَتَوَاصَوا بِالمَرحَمَةِ [البلد: 17]",
        "ayah_en": "Then he was among those who believed and advised one another to patience and advised one another to mercy.",
        "commentary_ar": "قال القرطبي رحمه الله : ((ثُمَّ ليست في هذه الآية للترتيب، وإنما هي لعطف جملة كلام هي منها منقطعة)).",
        "commentary_en": "Al-Qurtubi said: “Thumma” in this verse is not for chronological sequence, but rather for connecting one statement to another that is distinct from it."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 3,
      "question_ar": "اذكر آية تبين مشهدًا شبيها بذلك فيه شفاء الصدور المؤمنين.",
      "question_en": "Mention a verse depicting a similar scene in which the believers’ hearts are healed by witnessing the fate of their former oppressors.",
      "answer": {
        "surah": 83,
        "ayahs": [
          34,
          35,
          36
        ],
        "ayah_ar": "فَالْيَوْمَ الَّذِينَ آمَنُوا مِنَ الْكُفَّارِ يَضْحَكُونَ عَلَى الأَرَائِكِ يَنظُرُونَ هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوا يَفْعَلُونَ [المطففين : 34-36]",
        "ayah_en": "So today those who believed are laughing at the disbelievers, on adorned couches, observing. Have the disbelievers been rewarded for what they used to do?",
        "commentary_ar": "قال البغوي: وقال كعب بين الجنة والنار كوى، فإذا أراد المؤمن أن ينظر إلى عدوه - كان في الدنيا - اطلع عليه من تلك الكوى ، كما قال : فَاطَّلَعَ فَرَآهُ فِي سَوَاءِ الْجَحِيمِ) [الصافات: 55] ، فإذا اطلعوا من الجنة إلى أعدائهم وهم يعذبون في النار ضحكوا ، فذلك قوله - عز وجل - : فَالْيَوْمَ الَّذِينَ آمَنُوا مِنَ الْكُفَّارِ يَضْحَكُونَ)).",
        "commentary_en": "Al-Baghawi said: Ka‘b said that between Paradise and Hell are openings; when a believer wishes to look at his enemy from the world, he looks through those openings, as Allah said: “So he looked and saw him in the midst of Hellfire” [As-Saffat: 55]. When they look from Paradise at their enemies being punished in Hell, they laugh. That is His saying: “So today those who believed are laughing at the disbelievers.”"
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 4,
      "question_ar": "اذكر ثلاثة مواضع متفرقة من الجزء الثلاثين يأمر الله فيها المؤمنين بالتفكر في خلق الله.",
      "question_en": "Mention three separate places in Juz 30 where Allah commands reflection upon His creation.",
      "answer": {
        "surah": 80,
        "ayahs": [
          24,
          5,
          17,
          18,
          19,
          20
        ],
        "ayah_ar": "فَلْيَنظُرِ الْإِنسَانُ إِلَى طَعَامِهِ [عبس: 24]\nفَلْيَنظُرِ الْإِنسَانُ مِمَّ خُلِقَ [الطارق : 5]\nأَفَلَا يَنظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ وَإِلَى السَّمَاءِ كَيْفَ رُفِعَتْ وَإِلَى الْجِبَالِ كَيْفَ نُصِبَتْ وَإِلَى الْأَرْضِ كَيْفَ سُطِحَتْ [الغاشية : 17-20].",
        "ayah_en": "Let man look at his food. [‘Abasa: 24]\nSo let man observe from what he was created. [At-Tariq: 5]\nThen do they not look at the camels—how they are created? And at the sky—how it is raised? And at the mountains—how they are erected? And at the earth—how it is spread out? [Al-Ghashiyah: 17–20]",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 5,
      "question_ar": "آية من هذا الجزء ... ولكن من يكمل تلاوة الآيات يعرف أن هذا تهديد ووعيد من الله تعالى لمن أعرض عن دينه .",
      "question_en": "Mention the verse from this Juz which some cite as proof of religious freedom, though completing the passage reveals it as a warning and threat to those who turn away from Allah’s religion.",
      "answer": {
        "surah": 88,
        "ayahs": [
          22,
          23,
          24,
          25,
          26
        ],
        "ayah_ar": "لَسْتَ عَلَيْهِم بِمُصَيْطِرٍ إِلَّا مَن تَوَلَّى وَكَفَرَ فَيُعَذِّبُهُ اللَّهُ الْعَذَابَ الْأَكْبَرَ إِنَّ إِلَيْنَا إِيَابَهُمْ ثُمَّ إِنَّ عَلَيْنَا حِسَابَهُم [الغاشية : 22-26].",
        "ayah_en": "You are not over them a controller. But whoever turns away and disbelieves—Allah will punish him with the greatest punishment. Indeed, to Us is their return. Then indeed, upon Us is their account.",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 6,
      "question_ar": "اذكر آية من هذا الجزء تؤكد نفس المعنى.",
      "question_en": "Mention a verse from this Juz confirming that rejecting clear proofs is due to fault in the person, not deficiency in the evidence.",
      "answer": {
        "surah": 81,
        "ayahs": [
          27,
          28
        ],
        "ayah_ar": "إِنْ هُوَ إِلَّا ذِكْرٌ لِلْعَالَمِينَ لِمَن شَاءَ مِنكُمْ أَن يَسْتَقِيمَ [ التكوير: 27-28]",
        "ayah_en": "It is not except a reminder to the worlds—for whoever wills among you to take a straight path.",
        "commentary_ar": "قال ابن عاشور : (إشارة إلى أن الذين لم يتذكروا بالقرآن ما حال بينهم وبين التذكر به إلا أنهم لم يشاءوا أن يستقيموا ، بل رضوا لأنفسهم الانحراف، ومن رضي لنفسه الانحراف حُرِمَ الهداية فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ﴾ [الصف : 5]).",
        "commentary_en": "Ibn ‘Ashur said: This indicates that those who did not take admonition from the Qur’an were prevented only because they did not will to be upright; rather, they were content with deviation. Whoever is content with deviation is deprived of guidance—“So when they deviated, Allah caused their hearts to deviate” [As-Saff: 5]."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 7,
      "question_ar": "اذكر آيتين تبين أن الإيمان بالبعث والجزاء هو الذي يعين الإنسان في الإقدام على الأعمال الصالحة.",
      "question_en": "Mention two verses showing that belief in resurrection and recompense is what motivates a person to perform righteous deeds.",
      "answer": {
        "surah": 107,
        "ayahs": [
          1,
          2
        ],
        "ayah_ar": "أَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ فَذَلِكَ الَّذِي يَدُلُّ الْيَتِيمَ [الماعون :1-2]",
        "ayah_en": "Have you seen the one who denies the Recompense? That is the one who repulses the orphan.",
        "commentary_ar": "قال ابن عاشور: (هذا إيذان بأنَّ الإيمان بالبعث والجزاء هو الوازع الحق الذي يغرس في النفس جذور الإقبال على الأعمال الصالحة ، حتى يصير ذلك لها خُلقًا إذا شبت عليه ، فزكت وانساقت إلى الخير بدون كلفة ولا احتياج إلى آمر، ولا إلى مخافة ممن يقيم عليه العقوبات، حتى إذا اختلي بنفسه، وآمن الرقباء، جاء بالفحشاء والأعمال النكراء !).",
        "commentary_en": "Ibn ‘Ashur said: This indicates that belief in resurrection and recompense is the true deterrent that plants within the soul the roots of inclination toward righteous deeds, until it becomes a natural trait. Thus the person grows upon it, becomes purified, and inclines to good without coercion or need of supervision; whereas without it, when alone and secure from watchers, he would commit evil and wrongdoing."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 8,
      "question_ar": "اذكر آيتين يحذر الله فيهما من هذا الصنف.",
      "question_en": "Mention two verses in which Allah warns against this type of person who makes wealth the ultimate goal.",
      "answer": {
        "surah": 104,
        "ayahs": [
          2,
          3,
          2
        ],
        "ayah_ar": "الَّذِي جَمَعَ مَالاً وَعَدَّدَهُ يَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ [الهُمَزة : 2-3]\nمَا أَغْنَى عَنْهُ مَالُهُ وَمَا كَسَبَ [المسد : 2].",
        "ayah_en": "Who collects wealth and counts it. He thinks that his wealth will make him immortal. [Al-Humazah: 2–3]\nHis wealth will not avail him or that which he gained. [Al-Masad: 2]",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 9,
      "question_ar": "اذكر آية تؤكد على أن الوسوسة تأتي من شياطين الإنس والجن، ويجب على الإنسان الحذر منهم.",
      "question_en": "Mention a verse confirming that whispering comes from devils among jinn and humans, and that one must beware of them.",
      "answer": {
        "surah": 114,
        "ayahs": [
          6
        ],
        "ayah_ar": "مِنَ الْجِنَّةِ وَالنَّاسِ [ الناس : 6 ]",
        "ayah_en": "From among jinn and mankind.",
        "commentary_ar": "قال ابن عاشور : ( بين الله تعالى نوع الموسوس، بأنهم من الجنة والناس؛ لأنَّ ربما غاب عن البال أنَّ مِنَ الوسواس ما هو شر من وسواس الشياطين، وهو وسوسة الناس، وهو أشد خطرًا ، وهُمْ بالتعوذ منهم أجدر؛ لأنهم منهم أقرب وهو عليهم أخطر ، وأنهم في وسائل الضر أدخل وأقدر).",
        "commentary_en": "Ibn ‘Ashur said: Allah clarified the type of whisperer, that they are from the jinn and mankind; for it may be overlooked that some whispering is worse than that of devils—namely, the whispering of humans. It is more dangerous, and seeking refuge from them is even more warranted, for they are closer and more capable in causing harm."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 10,
      "question_ar": "اذكر آية تبين أن أبا بكر هو أفضل هذه الأمة بعد النبي - صلى الله عليه وسلم.",
      "question_en": "Mention a verse indicating that Abu Bakr is the best of this nation after the Prophet (peace be upon him).",
      "answer": {
        "surah": 92,
        "ayahs": [
          17,
          18
        ],
        "ayah_ar": "وَسَيُجَنَّبُهَا الْأَتْقَى الَّذِي يُؤْتِي مَالَهُ يَتَزَكَّى [الليل : 17 - 18 ]",
        "ayah_en": "But the most righteous will be removed from it—he who gives his wealth to purify himself.",
        "commentary_ar": "قال الرازي في التفسير الكبير: نزلت في أبي بكر بإجماع المفسرين، والأتقى أفعل التفضيل فإذا ضممت ذلك إلى قوله تعالى {إِنَّ أَكْرَمَكُمْ عِندَ اللَّهِ أَتْقَاكُمْ تَبين لنا أن أبا بكر أفضل هذه الأمة بعد رسول الله صلى الله عليه وسلم).",
        "commentary_en": "Ar-Razi said in At-Tafsir al-Kabir: It was revealed concerning Abu Bakr by consensus of the commentators. “Al-atqa” is a superlative form; when combined with Allah’s statement, “Indeed, the most noble of you in the sight of Allah is the most righteous of you,” it becomes clear that Abu Bakr is the best of this nation after the Messenger of Allah (peace be upon him)."
      },
      "difficulty": "",
      "theme": ""
    }
  ]
}
