{
  "juz": 27,
  "items": [
    {
      "qNum": 1,
      "question_ar": "اذكر كلمة تشير إلى عدم إيمان امرأة لوط.",
      "question_en": "Mention a word that indicates the lack of faith of the wife of Lut.",
      "answer": {
        "surah": 51,
        "ayahs": [
          36
        ],
        "ayah_ar": "فَمَا وَجَدْنَا فِيهَا غَيْرَ بَيْتٍ مِنَ الْمُسْلِمِينَ [الذاريات: 36]",
        "ayah_en": "And We found not within them other than a single house of Muslims.",
        "commentary_ar": "قال ابن عاشور والآية تشير إلى أنَّ امرأةَ لُوطٍ كانت تظهر الانقياد إلى زوجها وتُضْمِرُ الكُفْرَ وممالاة أهل القرية على فسادهم، قال تعالى (ضَرَبَ اللَّهُ مَثَلًا لِلَّذِينَ كَفَرُوا امْرَأَةَ نُوحٍ وَامْرَأَةَ لُوطٍ كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتَاهُمَا) [التحريم: 10] الآية، فَبَيْتُ لُوطٍ كانَ كُلُّهُ مِنَ الْمُسْلِمِينَ وَلَمْ يَكُنْ كُلُّهُ مِنَ الْمُؤْمِنِينَ فَلِذَلِكَ لَمْ يَنْجُ مِنْهُمْ إِلا الَّذِينَ اتَّصَفُوا بِالإِيمَانِ وَالإِسْلام مَعًا).\nفامرأة لوط كانت مسلمة تظهر الانقياد للإسلام، لكنها لم تكن مؤمنة في الحقيقة. والله إنما نجى المؤمنين. فوصفت الآية بيت لوط ب: بَيْتٍ مِنَ الْمُسْلِمِينَ لوجود امرأة لوط بينهم، فإنها من المسلمين وليست من المؤمنين الناجين.",
        "commentary_en": "Ibn ‘Ashur said: The verse indicates that the wife of Lut outwardly showed submission to her husband while inwardly concealing disbelief and siding with the people of the town in their فساد. Allah said: “Allah presents an example of those who disbelieved: the wife of Nuh and the wife of Lut. They were under two righteous servants among Our servants, but they betrayed them.” [At-Tahrim: 10]. The house of Lut was entirely of Muslims, but not entirely of believers; therefore, only those who combined faith and Islam were saved.\nThus the wife of Lut was Muslim in outward submission, but she was not truly a believer. Allah saved only the believers. So the verse described the house of Lut as: “a house of Muslims” because she was among them—she was from the Muslims but not from the believing ones who were saved."
      },
      "difficulty": "easy",
      "theme": "Iman"
    },
    {
      "qNum": 2,
      "question_ar": "قال الله تعالى في سورة النساء : ﴿إِنَّ الْمُنَافِقِينَ يُخَادِعُونَ اللَّهَ وَهُوَ خَادِعُهُمْ﴾ [النساء : 142] . اذكر آية تبين كيف يخدعهم الله .",
      "question_en": "Allah said in Surah An-Nisa’: “Indeed, the hypocrites seek to deceive Allah, but He is deceiving them.” [4:142]. Mention a verse explaining how Allah deceives them.",
      "answer": {
        "surah": 57,
        "ayahs": [
          13
        ],
        "ayah_ar": "يَوْمَ يَقُولُ الْمُنَافِقُونَ وَالْمُنَافِقَاتُ لِلَّذِينَ آمَنُوا انْظُرُونَا نَقْتَبِسْ مِنْ نُورِكُمْ قِيلَ ارْجِعُوا وَرَاءَكُمْ فَالْتَمِسُوا نُورًا فَضُرِبَ بَيْنَهُمْ بِسُورٍ لَهُ بــاب باطِنُهُ فِيهِ الرَّحْمَةُ وَظَاهِرُهُ مِنْ قِبَلِهِ الْعَذَابُ [الحديد: 13].",
        "ayah_en": "On the Day the hypocrite men and hypocrite women will say to those who believed, “Wait for us that we may acquire some of your light.” It will be said, “Go back behind you and seek light.” So a wall will be placed between them with a gate; its interior contains mercy, but its exterior facing them is punishment.",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 3,
      "question_ar": "آية بمعنى قول الله تعالى : ﴿يَا أَيُّهَا الَّذِينَ آمَنُوا إِن تَتَّقُوا اللَّهَ يَجْعَل لَّكُمْ فُرْقَانًا) [الأنفال : 29].",
      "question_en": "A verse with the meaning of Allah’s statement: “O you who believe, if you fear Allah, He will grant you a criterion.” [Al-Anfal: 29].",
      "answer": {
        "surah": 57,
        "ayahs": [
          28
        ],
        "ayah_ar": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَآمِنُوا بِرَسولِهِ يُؤْتِكُم كِفَلَينِ مِن رَحْمَتِهِ وَيَجْعَل لَكُم نورًا تَمشونَ بِهِ وَيَغْفِر لَكُم وَاللَّهُ غَفُورٌ رَحِيمٌ [الحديد : 28].",
        "ayah_en": "O you who have believed, fear Allah and believe in His Messenger; He will give you a double portion of His mercy and make for you a light by which you will walk and forgive you. And Allah is Forgiving and Merciful.",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 4,
      "question_ar": "آية تبين العاقبة المخيفة في لحظة حاسمة يوم القيامة لمن يحيط نفسه بدواعي الانحراف من شهوات وشبهات . اذكر الكلمتين تحديدا في هذه الآية اللتين تذكران تسبب الشخص لنفسه بهذا الزيغ والانحراف.",
      "question_en": "A verse showing the frightening consequence at a decisive moment on the Day of Resurrection for one who surrounds himself with causes of deviation from desires and doubts. Mention the two specific words in the verse that indicate the person caused this deviation for himself.",
      "answer": {
        "surah": 57,
        "ayahs": [
          14
        ],
        "ayah_ar": "يُنادونَهُم أَلَم نَكُن مَعَكُم قالوا بلى وَلَكِنَّكُم فَتَنتُم أَنفُسَكُم وَتَرَبَّصْتُم وَارتَبتُم وَغَرَّتْكُمُ الأَمانِي حَتَّى جَاءَ أَمْرُ اللهِ وَغَرَّكُم بِاللهِ الغَرُورُ [الحديد: 14].",
        "ayah_en": "They will call to them, “Were we not with you?” They will say, “Yes, but you afflicted yourselves and waited and doubted, and wishful thinking deceived you until the command of Allah came, and the Deceiver deceived you concerning Allah.”",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 5,
      "question_ar": "الناس يحاسبونك على النتائج والإنجازات ... اذكر كلمة واحدة من آية تدل على هذا المعنى.",
      "question_en": "People judge you based on results and achievements… Mention one word from a verse that indicates this meaning (that Allah judges effort itself).",
      "answer": {
        "surah": 53,
        "ayahs": [
          39,
          40
        ],
        "ayah_ar": "وَأَن لَيسَ لِلإِنسانِ إِلَّا ما سَعَى وَأَنَّ سَعيَهُ سَوفَ يُرى [ النجم : 39-40].",
        "ayah_en": "And that there is not for man except what he strives for. And that his striving will be seen.",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 6,
      "question_ar": "من الأعمال الصالحة ما يكون أكثر أجرا في حالة معينة وأقل أجرا في حالة أخرى ... اذكر آية من الجزء السابع والعشرين وأخرى من الجزء الثلاثين فيهما هذا المعنى.",
      "question_en": "Some righteous deeds carry greater reward in certain circumstances and less in others… Mention one verse from Juz 27 and another from Juz 30 that contain this meaning.",
      "answer": {
        "surah": 57,
        "ayahs": [
          10,
          90
        ],
        "ayah_ar": "وَمَا لَكُمْ أَلَّا تُنفِقُوا فِي سَبِيلِ اللَّهِ وَلِلَّهِ مِيرَاثُ السَّمَاوَاتِ وَالْأَرْضِ لَا يَسْتَوِي مِنكُم مَّنْ أَنفَقَ مِن قَبْلِ الْفَتْحِ وَقَاتَلَ أُولَئِكَ أَعْظَمُ دَرَجَةً مِّنَ الَّذِينَ أَنفَقُوا مِن بَعْدُ وَقَاتَلُوا وَكُلًّا وَعَدَ اللَّهُ الْحُسْنَى وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ [الحديد: 10]\nأَوْ إِطْعَامُ فِي يَوْمٍ ذِي مَسْغَبَةٍ [البلد: 14 ]",
        "ayah_en": "And what is [the matter] with you that you do not spend in the cause of Allah while to Allah belongs the heritage of the heavens and the earth? Not equal among you are those who spent before the Conquest and fought—those are greater in degree than those who spent afterward and fought. But to all Allah has promised the best reward. And Allah is Acquainted with what you do. [Al-Hadid: 10]\nOr feeding on a day of severe hunger. [Al-Balad: 14]",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 7,
      "question_ar": "آية ورد فيها تعجب من حال أقوام لمخالفتهم أمرا بدهيا ...",
      "question_en": "A verse expressing astonishment at a people for opposing something obvious—an astonishment clarified when understanding that the Prophet’s call was supported by sufficient proofs establishing the argument against them.",
      "answer": {
        "surah": 57,
        "ayahs": [
          8
        ],
        "ayah_ar": "وَمَا لَكُمْ لَا تُؤْمِنُونَ بِاللَّهِ وَالرَّسُولُ يَدْعُوكُمْ لِتُؤْمِنُوا بِرَبِّكُمْ وَقَدْ أَخَذَ مِيثَاقَكُمْ إن كُنتُم مُّؤْمِنِينَ [الحديد : 8]",
        "ayah_en": "And what is [the matter] with you that you do not believe in Allah while the Messenger invites you to believe in your Lord, and He has already taken your covenant, if you should be believers?",
        "commentary_ar": "قال ابن عاشور: ( والمعنى : ماذا يمنعكم من الإيمان وقد بين لكم الرسول من آيات القرآن ما فيه بلاغ وحجة على أن الإيمان بالله حق ؟ فلا عذر لكم في عدم الإيمان بالله . فقد جاءتكم بينات حقيته فتعين أن إصراركم على عدم الإيمان مكابرة وعناد ) .\nفليس معنى الآية الإنكار عليهم أنهم لا يؤمنون بدعوة رجل ما مجردة، بل أنهم ينكرون دعوة من قامت الحجج على أنه رسول، ويدعوهم إلى الإيمان الذي تدل عليه الفطرة والعقل.",
        "commentary_en": "Ibn ‘Ashur said: The meaning is: What prevents you from believing when the Messenger has clarified to you through the verses of the Qur’an that faith in Allah is truth? There is no excuse for you in not believing. Clear proofs of its truth have come to you; therefore, your persistence in disbelief is stubbornness and arrogance.\nThe verse does not merely condemn them for refusing the call of an ordinary man; rather, they are rejecting the call of one whose messengership has been established with decisive proofs and who calls them to faith affirmed by sound nature and reason."
      },
      "difficulty": "",
      "theme": ""
    }
  ]
}
