{
  "juz": 14,
  "items": [
    {
      "qNum": 1,
      "question_ar": "عند قراءة قول الله تعالى : (إِنَّ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ لَيُسَمُّونَ الْمَلَائِكَةَ تَسْمِيَةَ الأُنثَى) [ النجم : 27 ] ، و (وَجَعَلُوا الْمَلَائِكَةَ الَّذِينَ هُمْ عِبَادُ الرَّحْمَنِ إِنَاثًا) [الزخرف : 19 ] ، فقد تظن أن مَصَبَّ الإنكار هو أنهم ادعوا أن خواص الله من البنات، وأنهم لو ادعوهم ذكورا لما أنكر الله عليهم. اذكر من جزء اليوم جملة من أربع كلمات تصحح هذا الفهم وتبين مصب الإنكار.",
      "question_en": "When reading Allah’s words: ﴾إِنَّ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ لَيُسَمُّونَ الْمَلَائِكَةَ تَسْمِيَةَ الأُنثَى﴿ [An-Najm: 27] and ﴾وَجَعَلُوا الْمَلَائِكَةَ الَّذِينَ هُمْ عِبَادُ الرَّحْمَنِ إِنَاثًا﴿ [Az-Zukhruf: 19], you might think the main objection is that they claimed Allah’s special servants are ‘daughters’—and that if they called them ‘sons’ it would be acceptable. Mention a four-word phrase from today’s Juz that corrects this misunderstanding and shows what the real point of condemnation is.",
      "answer": {
        "surah": 16,
        "ayahs": [
          62
        ],
        "ayah_ar": "﴿وَيَجْعَلُونَ لِلَّهِ مَا يَكْرَهُونَ وَتَصِفُ أَلْسِنَتُهُمُ الْكَذِبَ أَنَّ لَهُمُ الْحُسْنَى﴾",
        "ayah_en": "And they attribute to Allah what they themselves dislike, and their tongues utter lies that they will have the best (outcome).",
        "commentary_ar": "قال الطبري : ( وتأويل الكلام : ويجعلون لله ما يكرهونه لأنفسهم، ويزعمون أن لهم الحسنى، الذي يكرهونه لأنفسهم : البنات يجعلونهن الله تعالى، وزعموا أن الملائكة بنات الله . وأما الحسنى التي جعلوها لأنفسهم : فالذكور من الأولاد ، وذلك أنهم كانوا يئدون الإناث من أولادهم ، ويستبقون الذكور منهم، ويقولون : لنا الذكور ولله البنات ، وهو نحو قوله : (وَيَجْعَلُونَ لِلَّهِ الْبَنَاتِ سُبْحَانَهُ وَلَهُمْ مَا يَشْتَهُونَ) [النحل : 57]).",
        "commentary_en": "Al-Tabari said: The meaning is that they assign to Allah what they themselves hate, and they claim for themselves “the best.” What they hate for themselves is daughters—yet they assign daughters to Allah Most High and claimed that the angels are Allah’s daughters. As for “the best” which they assign to themselves, it is sons—because they used to bury their female children and keep the male children, saying: “For us are sons, and for Allah are daughters.” This is like His saying: ﴾وَيَجْعَلُونَ لِلَّهِ الْبَنَاتِ سُبْحَانَهُ وَلَهُمْ مَا يَشْتَهُونَ﴿ [An-Nahl: 57]. The real condemnation is in ﴾وَيَجْعَلُونَ لِلَّهِ مَا يَكْرَهُونَ﴿: attributing to Allah what they themselves detest."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 2,
      "question_ar": "كثيراً ما تجد أقواماً يستندون إلى أسباب أرضية ظانين فيها الأمان، وقد تكون مما يسخط الله ، فيجعل الله نهايتهم من الناحية الذي ظنوها سبب أمانهم ! اذكر آية تذكرك بهذا المعنى.",
      "question_en": "You often find people relying on worldly ‘earthly’ means thinking they are safe—sometimes by means that anger Allah—then Allah makes their end come from the very side they thought would protect them. Mention a verse that reminds you of this meaning.",
      "answer": {
        "surah": 16,
        "ayahs": [
          26
        ],
        "ayah_ar": "﴿قَدْ مَكَرَ الَّذِينَ مِنْ قَبْلِهِمْ فَأَتَى اللَّهُ بُنْيَانَهُم مِّنَ الْقَوَاعِدِ فَخَرَّ عَلَيْهِمُ السَّقْفُ مِنْ فَوْقِهِمْ وَأَتَاهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ﴾",
        "ayah_en": "Those before them plotted, so Allah came at their structure from its foundations, and the roof collapsed upon them from above them, and the punishment came to them from where they did not perceive.",
        "commentary_ar": "قال السعدي : ( قَدْ مَكَرَ الَّذِينَ مِنْ قَبْلِهِمْ) برسلهم واحتالوا بأنواع الحيل على رد ما جاء وهم به وبنوا من مكرهم قصورا هائلة ، فَأَتَى اللَّهُ بُنْيَانَهُمْ مِنَ الْقَوَاعِدِ) أي : جاءها الأمر من أساسها وقاعدتها ، فَخَرَّ عَلَيْهِمُ السَّقْفُ مِنْ فَوْقِهِمْ فصار ما بنوه عذابا عذبوا به ، وَأَتَاهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ) وذلك أنهم ظنوا أن هذا البنيان سينفعهم ويقيهم العذاب فصار عذابهم فيما بنوه وأصلوه . وهذا من أحسن الأمثال في إبطال الله مكر أعدائه ).",
        "commentary_en": "As-Sa‘di said: ﴾قَدْ مَكَرَ الَّذِينَ مِنْ قَبْلِهِمْ﴿ means they plotted against their messengers and used many schemes to repel what came to them, and they built, on the basis of their plotting, huge ‘structures.’ Then ﴾فَأَتَى اللَّهُ بُنْيَانَهُم مِّنَ الْقَوَاعِدِ﴿ meaning the affair came upon it from its very foundation; ﴾فَخَرَّ عَلَيْهِمُ السَّقْفُ مِنْ فَوْقِهِمْ﴿ so what they built became a punishment by which they were punished; and ﴾وَأَتَاهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ﴿ because they thought that this ‘building’ would benefit them and protect them from punishment—yet their punishment came through what they themselves built and established. This is among the finest parables of Allah’s nullifying the plots of His enemies."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 3,
      "question_ar": "الاستثناء المنقطع يعني الانقطاع بين المستثنى والمستثنى منه . اذكر آيتين متتاليتين من جزء اليوم يساعد إدراك أنَّ استثناءَهُما منقطع على دفع فهم خاطئ.",
      "question_en": "A ‘disconnected exception’ (الاستثناء المنقطع) is when the excluded item is not of the same category as what precedes it. Mention two consecutive verses from today’s Juz where realizing the exception is disconnected helps prevent an incorrect understanding.",
      "answer": {
        "surah": 15,
        "ayahs": [
          30,
          31
        ],
        "ayah_ar": "﴿فَسَجَدَ الْمَلَائِكَةُ كُلُّهُمْ أَجْمَعُونَ ۝ إِلَّا إِبْلِيسَ أَبَى أَن يَكُونَ مَعَ السَّاجِدِينَ﴾",
        "ayah_en": "So the angels prostrated—all of them entirely—except Iblis; he refused to be among those who prostrated.",
        "commentary_ar": "لا يعني الاستثناء أن إبليس من الملائكة ، بل ما بعد (إلا) في الآية منقطع عما قبلها، فيصبح المعنى : سجد الملائكة ولم يسجد إبليس.",
        "commentary_en": "This exception does not mean that Iblis is from the angels. Rather, what comes after ﴾إِلَّا﴿ is disconnected from what came before it. The meaning becomes: the angels prostrated—and Iblis did not prostrate."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 4,
      "question_ar": "اذكر آية ترد بها على من يدعي أن مهمة النبي صلى الله عليه وسلم انحصرت في تبليغ القرآن بما يغني عن حفظ السنة.",
      "question_en": "Mention a verse you would use to refute someone who claims the Prophet ﷺ’s mission was limited to merely conveying the Qur’an in a way that makes preserving the Sunnah unnecessary.",
      "answer": {
        "surah": 16,
        "ayahs": [
          44
        ],
        "ayah_ar": "﴿بِالْبَيِّنَاتِ وَالزُّبُرِ ۗ وَأَنزَلْنَا إِلَيْكَ الذِّكْرَ لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيْهِمْ وَلَعَلَّهُمْ يَتَفَكَّرُونَ﴾",
        "ayah_en": "With clear proofs and scriptures. And We revealed to you the Reminder so that you may clarify to the people what was sent down to them, and so that they may reflect.",
        "commentary_ar": "قال القرطبي : ( لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيْهِمْ فِي هذا الكتابِ مِنَ الأَحكامِ وَالوَعْدِ وَالوَعِيدِ بِقَوْلِكَ وَفِعْلِكَ ، فَالرَّسُولُ مُبَيِّنٌ عَنِ اللَّهِ عَزَّ وَجَلَّ مُرادَهُ مِمَّا أَجْمَلَهُ فِي كِتَابِهِ مِنْ أحكام الصَّلاةِ وَالزَّكَاةِ ، وَغَيْرِ ذلكَ مِمَّا لَم يُفَصِّلْهُ ).",
        "commentary_en": "Al-Qurtubi said: ﴾لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيْهِمْ﴿ means: so that you (O Prophet) clarify to people what has been sent down to them in this Book—of rulings, promises, and warnings—through your speech and your actions. The Messenger clarifies on behalf of Allah عز وجل what Allah intended from what He summarized in His Book, such as the detailed rulings of prayer and zakah, and other matters that were not laid out in full detail in the text."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 5,
      "question_ar": "اذكر آية تثبت جهة العلو لله تعالى .",
      "question_en": "Mention a verse that affirms the ‘highness’ (جهة العلو) of Allah تعالى.",
      "answer": {
        "surah": 16,
        "ayahs": [
          50
        ],
        "ayah_ar": "﴿يَخَافُونَ رَبَّهُم مِّن فَوْقِهِمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ﴾",
        "ayah_en": "They fear their Lord above them, and they do what they are commanded.",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 6,
      "question_ar": "اذكر كلمة من جزء اليوم تبين أنه لا يليق بالجنة إلا من كان مطهرا من كل خبث.",
      "question_en": "Mention a word from today’s Juz indicating that none are fit for Paradise except those purified from every impurity.",
      "answer": {
        "surah": 16,
        "ayahs": [
          32
        ],
        "ayah_ar": "﴿الَّذِينَ تَتَوَفَّاهُمُ الْمَلَائِكَةُ طَيِّبِينَ يَقُولُونَ سَلَامٌ عَلَيْكُمُ ادْخُلُوا الْجَنَّةَ بِمَا كُنتُمْ تَعْمَلُونَ﴾",
        "ayah_en": "Those whom the angels take in death while they are pure, saying, “Peace be upon you; enter Paradise for what you used to do.”",
        "commentary_ar": "قال السعدي: ((طَيِّبِينَ ) أي : طاهرين مطهرين من كل نقص ودنس يتطرق إليهم ويخل في إيمانهم، فطابت قلوبهم بمعرفة الله ومحبته وألسنتهم بذكره والثناء عليه ، وجوارحهم بطاعته والإقبال عليه ).",
        "commentary_en": "As-Sa‘di said: ﴾طَيِّبِينَ﴿ means: pure—purified from every deficiency and stain that could affect them and compromise their faith. So their hearts became good through knowing Allah and loving Him; their tongues through remembering Him and praising Him; and their limbs through obeying Him and turning to Him."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 7,
      "question_ar": "قال رسول الله صلى الله عليه وسلم: (ومن سن في الإسلام سنة سيئة كان عليه وزرها ووزر من عمل بها من بعده لا ينقص ذلك من أوزارهم شيئا ) (رواه مسلم). اذكر آيةً تشير إلى المعنى نفسه.",
      "question_en": "The Prophet ﷺ said: “Whoever introduces a bad practice in Islam will bear its sin and the sin of those who act upon it after him, without their sins being reduced.” Mention a verse that points to the same meaning.",
      "answer": {
        "surah": 16,
        "ayahs": [
          25
        ],
        "ayah_ar": "﴿لِيَحْمِلُوا أَوْزَارَهُمْ كَامِلَةً يَوْمَ الْقِيَامَةِ وَمِنْ أَوْزَارِ الَّذِينَ يُضِلُّونَهُم بِغَيْرِ عِلْمٍ ۗ أَلَا سَاءَ مَا يَزِرُونَ﴾",
        "ayah_en": "So they will bear their burdens in full on the Day of Resurrection, and also some of the burdens of those whom they mislead without knowledge. Unquestionably, evil is what they bear.",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 8,
      "question_ar": "اذكر أربع كلمات من آية تبين أن الله تعهد ببيان الطريق المستقيم الموصل إليه.",
      "question_en": "Mention four words from a verse showing that Allah has taken it upon Himself to make clear the straight path that leads to Him.",
      "answer": {
        "surah": 16,
        "ayahs": [
          9
        ],
        "ayah_ar": "﴿وَعَلَى اللَّهِ قَصْدُ السَّبِيلِ﴾",
        "ayah_en": "And upon Allah is the explanation/clarification of the straight way.",
        "commentary_ar": "جاء في تفسير ابن كثير: ( ... شَرَعَ فِي ذِكرِ الطُّرقِ الَّتِي يَسْلُكُهَا النَّاسُ إِلَيْهِ، فَبَيَّنَ أَنَّ الحَقَّ مِنْهَا مَا هِيَ مُوَصِّلَةٌ إِلَيْهِ ، فَقَالَ : ﴿وَعَلَى اللَّهِ قَصْدُ السَّبِيلِ﴾ ... قَالَ مُجَاهِدُ : فِي [ قَولِهِ ] : ﴿وَعَلَى اللَّهِ قَصْدُ السَّبِيلِ﴾ قَالَ : طَرِيقُ الْحَقِّ عَلَى اللَّهِ . وَقَالَ العَوفِيُّ عَنِ ابْنِ عَبَّاسٍ فِي قَولِهِ : ﴿وَعَلَى اللَّهِ قَصْدُ السَّبِيلِ﴾ يَقُولُ : وَعَلَى اللَّهِ البَيَانُ ، أَي : تبيانُ الهُدَى وَالضَّلَالِ ).",
        "commentary_en": "Ibn Kathir mentioned that after Allah spoke of the animals people ride and by which they reach distant places, He then began mentioning the ‘paths’ people take toward Him, clarifying that the true path is the one that leads to Him—so He said: ﴾وَعَلَى اللَّهِ قَصْدُ السَّبِيلِ﴿. Mujahid said regarding ﴾وَعَلَى اللَّهِ قَصْدُ السَّبِيلِ﴿: “The path of truth is (clarified) upon Allah.” And Al-‘Awfi narrated from Ibn ‘Abbas that ﴾وَعَلَى اللَّهِ قَصْدُ السَّبِيلِ﴿ means: “Upon Allah is البيان—i.e., the clarification of guidance and misguidance.”"
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 9,
      "question_ar": "كلما زاد إيمان العبد بلقاء ربه زاد عفوه وتسامحه وقل انتصاره لنفسه فالمنشغلون بالآخرة لا وقت للعداوات والشحناء عندهم. اذكر جزءا من آية تذكرك بهذا المعنى.",
      "question_en": "The more a servant believes in meeting his Lord, the more forgiving and tolerant he becomes, and the less he seeks personal revenge—those preoccupied with the Hereafter have no time for grudges. Mention part of a verse that reminds you of this meaning.",
      "answer": {
        "surah": 15,
        "ayahs": [
          85
        ],
        "ayah_ar": "﴿فَاصْفَحِ الصَّفْحَ الْجَمِيلَ﴾",
        "ayah_en": "So pardon with gracious forgiveness.",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 10,
      "question_ar": "(هُنَّ أَطْهَرُ لَكُم﴾ [هود : 78] تُعيننا على صحة فهم ثلاث كلمات من آية وردت في هذا الجزء. ما هي هذه الكلمات الثلاثة ؟",
      "question_en": "The phrase ﴾هُنَّ أَطْهَرُ لَكُمْ﴿ [Hud: 78] helps confirm the correct understanding of three words in a verse found in this Juz. What are those three words?",
      "answer": {
        "surah": 15,
        "ayahs": [
          71
        ],
        "ayah_ar": "﴿هَؤُلَاءِ بَنَاتِي إِن كُنتُمْ فَاعِلِينَ﴾",
        "ayah_en": "He said, “These are my daughters—if you must do something.”",
        "commentary_ar": "لوط عليه الصلاة والسلام كان يدعو قومه إلى شيء طاهر، إلى الزواج بالإناث ، فقال : (هُنَّ أَطْهَرُ لَكُمْ) . فإن من يقرأ (هؤلاء بناتى إِن كُنتُم فَاعِلِينَ) قد يتوهم أن لوطاً عليه السلام كأنه يقول لقومه : إن كنتم فاعلين فاحشة ولا بد فببناتي وليس في الضيوف. وهذا ليس صحيحاً ! فهو إنما كان يدعوهم إلى شيء طاهر لا حرمة فيه (هُنَّ أَطْهَرُ لَكُمْ).\nوقيل في تفسير (هؤلاء بناتى) أنه قصد بناته اللواتي من صلبه ، يعني تزوجوا منهن بالحلال. وقيل معنى آخر: أنه يقصد بالبنات الإناث من قومه، فإن كل نبي هو بمثابة الأب . قال نبينا صلى الله عليه وسلم: (إنما أنا لكم بمنزلة الوالد أعلمكم) (صححه النووي في المجموع). فكأن لوطاً عليه السلام يقول : تزوجوا الإناث فهن أطهر لكم.",
        "commentary_en": "Lut عليه السلام was calling his people to something pure—to lawful marriage with women—so he said: ﴾هُنَّ أَطْهَرُ لَكُمْ﴿. Someone who reads ﴾هَؤُلَاءِ بَنَاتِي إِن كُنتُمْ فَاعِلِينَ﴿ might mistakenly imagine that Lut is saying: “If you are going to commit an indecency anyway, then do it with my daughters rather than my guests.” That is not correct. Rather, he was calling them to something pure and permissible: ﴾هُنَّ أَطْهَرُ لَكُمْ﴿.\nIt was also said in explaining ﴾هَؤُلَاءِ بَنَاتِي﴿ that he meant his own daughters by lineage—meaning: marry them lawfully. And it was also said he meant the ‘daughters’ as the women of his community, since every prophet is like a father to his people. The Prophet ﷺ said: “I am to you like a parent; I teach you.” (authenticated by An-Nawawi in Al-Majmu‘). So it is as if Lut is saying: marry women, for ﴾هُنَّ أَطْهَرُ لَكُمْ﴿."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 11,
      "question_ar": "لابد أن يعلم الداعية إلى الله أن أمر الدعوة لا يقتصر على الإقناع العقلي كي يهتدي من أمامه، فهناك موانع كاتباع الهوى. فعناد الكافر يوصله إلى إنكار البينات الحسية الضرورية ، فمثل هذا لا ينفع معه كثرة الأدلة . اذكر آيتين متتاليتين تحملان هذا المعنى :",
      "question_en": "A caller to Allah must realize that da‘wah is not only about intellectual persuasion—there are barriers such as following desires. A stubborn disbeliever can end up denying even necessary, clear sensory signs, so piling on more proofs won’t benefit him. Mention two consecutive verses that carry this meaning.",
      "answer": {
        "surah": 15,
        "ayahs": [
          14,
          15
        ],
        "ayah_ar": "﴿وَلَوْ فَتَحْنَا عَلَيْهِم بَابًا مِّنَ السَّمَاءِ فَظَلُّوا فِيهِ يَعْرُجُونَ ۝ لَقَالُوا إِنَّمَا سُكِّرَتْ أَبْصَارُنَا بَلْ نَحْنُ قَوْمٌ مَّسْحُورُونَ﴾",
        "ayah_en": "And even if We opened for them a gate from the heaven and they continued ascending through it, they would say, “Our eyes have only been dazzled; rather, we are a people bewitched.”",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 12,
      "question_ar": "اذكر آية بمعنى : (أَفَتُؤْمِنُونَ بِبَعْضِ الْكِتَابِ وَتَكْفُرُونَ بِبَعْضٍ) [البقرة: 85].",
      "question_en": "Mention a verse with the meaning of: “Do you believe in part of the Book and disbelieve in part?” [Al-Baqarah: 85].",
      "answer": {
        "surah": 15,
        "ayahs": [
          91
        ],
        "ayah_ar": "﴿الَّذِينَ جَعَلُوا الْقُرْآنَ عِضِينَ﴾",
        "ayah_en": "(They are) those who made the Qur’an into parts.",
        "commentary_ar": "عَنِ ابْنِ عَبَّاسٍ : (جَعَلُوا الْقُرْآنَ عِضِينَ ) قال : هم أهل الكتاب ، جَزَوْوه أَجْزَاءً، فَآمَنُوا بِبَعْضِهِ ، وَكَفَرُوا بِبَعْضِهِ.",
        "commentary_en": "Ibn ‘Abbas said about ﴾جَعَلُوا الْقُرْآنَ عِضِينَ﴿: they are the People of the Book; they split it into parts—believing in some of it and disbelieving in some of it."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 13,
      "question_ar": "ما لا ترتضيه لنفسك لا ينبغي أن ترتضيه لغيرك ، فما بالك بالخالق سبحانه . قال تعالى : ( ضَرَبَ لَكُم مَّثَلًا مِّنْ أَنفُسِكُمْ هَل لَّكُم مِّن مَّا مَلَكَتْ أَيْمَانُكُم مِّن شُرَكَاءَ فِي مَا رَزَقْنَاكُمْ فَأَنتُمْ فِيهِ سَوَاءٌ تَخَافُونَهُمْ كَخِيفَتِكُمْ أَنفُسَكُمْ) [الروم : 28] . اذكر آية بنفس المعنى.",
      "question_en": "What you would not accept for yourself, you should not accept for others—so how about the Creator سبحانه? Allah said: ﴾ضَرَبَ لَكُم مَّثَلًا مِّنْ أَنفُسِكُمْ...﴿ [Ar-Rum: 28]. Mention a verse with the same meaning.",
      "answer": {
        "surah": 16,
        "ayahs": [
          71
        ],
        "ayah_ar": "﴿وَاللَّهُ فَضَّلَ بَعْضَكُمْ عَلَىٰ بَعْضٍ فِي الرِّزْقِ ۚ فَمَا الَّذِينَ فُضِّلُوا بِرَادِّي رِزْقِهِمْ عَلَىٰ مَا مَلَكَتْ أَيْمَانُهُمْ فَهُمْ فِيهِ سَوَاءٌ ۚ أَفَبِنِعْمَةِ اللَّهِ يَجْحَدُونَ﴾",
        "ayah_en": "And Allah has favored some of you over others in provision. But those who were favored would not hand over their provision to those whom their right hands possess so that they would be equal in it. So do they deny the favor of Allah?",
        "commentary_ar": "قال ابن كثير : يبين تعالى للمشركين جهلهم وكفرهم فيما زعموه لله من الشركاء، وهم يعترفون أنها عبيد له ... فقال تعالى منكرا عليهم : إنكم لا ترضون أن تساووا عبيدكم فيما رزقناكم ، فكيف يرضى هو تعالى بمساواة عبيده له في الإلهية والتعظيم.",
        "commentary_en": "Ibn Kathir explained that Allah is showing the idolaters their ignorance and disbelief regarding what they claimed of partners for Allah, while they themselves admit those alleged partners are Allah’s servants. Allah rebukes them: you do not accept making your own slaves equal with you in what Allah has provided you—so how could Allah accept that His servants be made equal with Him in divinity and veneration?"
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 14,
      "question_ar": "اذكر آية تُخَوِّف من سوء خلق يؤدي إلى فتنة الناس عن دينهم.",
      "question_en": "Mention a verse that warns against a bad trait/behavior that can cause people to be turned away (fitnah) from the religion.",
      "answer": {
        "surah": 16,
        "ayahs": [
          94
        ],
        "ayah_ar": "﴿وَلَا تَتَّخِذُوا أَيْمَانَكُمْ دَخَلًا بَيْنَكُمْ فَتَزِلَّ قَدَمٌ بَعْدَ ثُبُوتِهَا وَتَذُوقُوا السُّوءَ بِمَا صَدَدتُّمْ عَن سَبِيلِ اللَّهِ وَلَكُمْ عَذَابٌ عَظِيمٌ﴾",
        "ayah_en": "And do not take your oaths as deceit between you, lest a foot slip after it was firm and you taste evil because you turned (people) away from the path of Allah; and you will have a great punishment.",
        "commentary_ar": "قال ابن كثير : ثم حذر تعالى عباده عن اتخاذ الأيمان دخلا، أي خديعة ومكرا؛ لئلا تزل قدم بعد ثبوتها ... لأن الكافر إذا رأى أن المؤمن قد عاهده ثم غدر به ، لم يبق له وثوق بالدين، فانصد بسببه عن الدخول في الإسلام; ولهذا قال : ﴿وَتَذُوقُوا السُّوءَ بِمَا صَدَدتُّمْ عَن سَبِيلِ اللَّهِ﴾.",
        "commentary_en": "Ibn Kathir said: Allah warns His servants against making oaths a means of deception and plotting, lest a foot slip after being firm… because when a disbeliever sees that a believer made a covenant and then betrayed it, his trust in the religion is shaken, and he may be turned away from entering Islam. That is why Allah said: ﴾وَتَذُوقُوا السُّوءَ بِمَا صَدَدتُّمْ عَن سَبِيلِ اللَّهِ﴿."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 15,
      "question_ar": "أنكر الله على من لا يقف على شواهد عظمته في خلقه فيتدبرها . اذكر آية فيها هذا المعنى.",
      "question_en": "Allah condemned those who pass by signs of His عظَمة in creation without stopping to reflect. Mention a verse carrying this meaning.",
      "answer": {
        "surah": 12,
        "ayahs": [
          105
        ],
        "ayah_ar": "﴿وَكَأَيِّن مِّنْ آيَةٍ فِي السَّمَاوَاتِ وَالْأَرْضِ يَمُرُّونَ عَلَيْهَا وَهُمْ عَنْهَا مُعْرِضُونَ﴾",
        "ayah_en": "And how many a sign in the heavens and the earth they pass by while they are turning away from it.",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    }
  ]
}
