{
  "juz": 19,
  "items": [
    {
      "qNum": 1,
      "question_ar": "قال الله تعالى: (وَإِذَا أَرَدْنَا أَن نُّهْلِكَ قَرْيَةً أَمَرْنَا مُتْرَفِيهَا فَفَسَقُوا فِيهَا فَحَقَّ عَلَيْهَا الْقَوْلُ فَدَمَّرْنَاهَا تَدْمِيرًا) [الإسراء : 16 ]\nمن الأوجه في تفسيرها : أي أمرنا مترفيها بما يأمر به الرسل عادة من الإيمان والطاعة . ففسقوا فيها .\nوهذا من طرائق اللغة العربية، أن يحذف كلام مفهوم من السياق . قد ينكر من لا يعرف بالعربية مثل هذا التفسير ويقول من أين لكم هذه التقديرات التي لم ترد في الآية . اذكر من هذا الجزء آية تستدل لها بها بتقدير شبيه .",
      "question_en": "In Surah Al-Isra (17:16), one interpretation says “We commanded its affluent ones” means: we commanded them with faith and obedience (an implied, omitted object understood from context). Mention a verse in this Juz that proves a similar kind of contextual omission/ellipsis.",
      "answer": {
        "surah": 25,
        "ayahs": [
          36
        ],
        "ayah_ar": "﴿فَقُلْنَا اذْهَبَا إِلَى الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِنَا فَدَمَّرْنَاهُمْ تَدْمِيرًا﴾\n[الفرقان: 36]",
        "ayah_en": "So We said, “Go to the people who denied Our signs,” then We destroyed them utterly. (The text omits the intervening events—going, delivering the message, the response—yet the meaning is understood.)",
        "commentary_ar": "لاحظ كيف أن هنالك حذفاً كبيراً في هذه الآية ما بين ذهابهما وإهلاك قومهما.",
        "commentary_en": "Notice how there is a large omitted span in the verse between “go to the people” and “then We destroyed them,” with the missing steps understood from context."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 2,
      "question_ar": "اذكر آية ترد بها على أصحاب المبدأ المسمى بالإنساني، والذي يجعل معيار المفاضلة بين الناس ما يتحلون به من أخلاق أو نفع مادي علمي للناس بصرف النظر عن علاقتهم بالله تعالى . هذه الآية لا تعطي أية قيمة للمعرض عن الله تعالى .",
      "question_en": "Mention a verse that refutes the idea that ‘humanitarianism’ alone (morals or worldly benefit) is the sole standard of merit regardless of one’s relationship with Allah—i.e., a verse indicating no worth for the one who turns away from Allah.",
      "answer": {
        "surah": 25,
        "ayahs": [
          77
        ],
        "ayah_ar": "﴿قُلْ مَا يَعْبَأُ بِكُمْ رَبِّي لَوْلَا دُعَاؤُكُمْ فَقَدْ كَذَّبْتُمْ فَسَوْفَ يَكُونُ لِزَامًا﴾\n[الفرقان: 77]",
        "ayah_en": "Say: My Lord would not care for you were it not for your worship/supplication—yet you have denied, so the consequence will surely come.",
        "commentary_ar": "قال ابن كثير: (أي : لا يبالي ولا يكترث بكم إذا لم تعبدوه فإنه إنما خلق الخلق ليعبدوه ويوحدوه ويسبحوه بكرة وأصيلا).",
        "commentary_en": "Ibn Kathir explains: Allah does not regard people who do not worship Him—He created creation to worship and single Him out in devotion."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 3,
      "question_ar": "على المسلم ألا يتنازل عن حقوقه التي وهبه الله إياها وأن يعلم أن الفضل فيها الله وحده، كما عليه ألا تُسْكِتَه نجاته من الظلم عن المطالبة بحقوق الآخرين المظلومين . فبعض الظالمين قد يظلم مجموعة من الناس ظلماً عاماً ثم إذا أحسن إلى أحدهم وأعطاه شيئا من حقوقه اعتبر ذلك تفضلاً.\nاذكر آيةً تبين أن المؤمن بحق لا يكفيه أن يُحسن الظالم إليه إن كان يظلم الآخرين، ولا يعتبر استثناءه من هذا الظلم فضلاً من الظالم عليه.",
      "question_en": "Mention a verse showing that a believer should not treat a tyrant’s ‘kindness’ to him as a favor if that tyrant oppresses others—i.e., being spared personally doesn’t erase the injustice done to the rest.",
      "answer": {
        "surah": 26,
        "ayahs": [
          22
        ],
        "ayah_ar": "﴿وَتِلْكَ نِعْمَةٌ تَمُنُّهَا عَلَيَّ أَنْ عَبَّدْتَ بَنِي إِسْرَائِيلَ﴾\n[الشعراء: 22]",
        "ayah_en": "And is that a favor you hold over me—that you enslaved the Children of Israel?",
        "commentary_ar": "قال ابن كثير: (أي : وما أحسنت إلي وربيتني مقابل ما أسأت إلى بني إسرائيل، فجعلتهم عبيدا وخدما، تصرفهم في أعمالك ومشاق رعيتك، أفي إحسانك إلى رجل واحد منهم بما أسأت إلى مجموعهم؟ أي : ليس ما ذكرته شيئا بالنسبة إلى ما فعلت بهم).",
        "commentary_en": "Ibn Kathir: Pharaoh’s ‘raising’ Moses cannot be counted as a favor while Pharaoh enslaved and abused an entire people—being good to one does not offset wrongdoing to the many."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 4,
      "question_ar": "اذكر آيةً تبين تلاعب المبطلين بالحقائق وقلبهم للتسميات بحيث يثنون على عنادهم ويذمون دعوة الحق في الآية ذاتها.",
      "question_en": "Mention a verse showing how falsehood-people manipulate labels: they praise their own stubbornness and condemn the call to truth in the same breath.",
      "answer": {
        "surah": 25,
        "ayahs": [
          42
        ],
        "ayah_ar": "﴿إِنْ كَادَ لَيُضِلُّنَا عَنْ آلِهَتِنَا لَوْلَا أَنْ صَبَرْنَا عَلَيْهَا ۚ وَسَوْفَ يَعْلَمُونَ حِينَ يَرَوْنَ الْعَذَابَ مَنْ أَضَلُّ سَبِيلًا﴾\n[الفرقان: 42]",
        "ayah_en": "He nearly led us away from our gods—if only we had not ‘held firm’ to them! And they will soon know, when they see the punishment, who is truly farthest from the path.",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 5,
      "question_ar": "اذكر آيةً تبين أن ما يتمادى به المكذبون بالرسالة من طلبات إنما هو نابع عن كبرهم.",
      "question_en": "Mention a verse showing that the demands of those who deny the Messenger are driven by arrogance.",
      "answer": {
        "surah": 25,
        "ayahs": [
          21
        ],
        "ayah_ar": "﴿وَقَالَ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا لَوْلَا أُنْزِلَ عَلَيْنَا الْمَلَائِكَةُ أَوْ نَرَىٰ رَبَّنَا ۗ لَقَدِ اسْتَكْبَرُوا فِي أَنْفُسِهِمْ وَعَتَوْا عُتُوًّا كَبِيرًا﴾\n[الفرقان: 21]",
        "ayah_en": "Those who do not expect to meet Us say: “Why aren’t angels sent down to us, or why don’t we see our Lord?” They have certainly grown arrogant within themselves and rebelled enormously.",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 6,
      "question_ar": "كلمة التوحيد مقدمة على وحدة الكلمة . ولا يُثنى على اجتماع الناس إن كان على ضلال . اذكر آية تبين كيف فرق نبي قومه وأحدث بينهم خلافا.",
      "question_en": "Tawhid comes before mere ‘unity.’ Mention a verse showing how a prophet’s call divided his people into opposing groups (because one side accepted truth and the other rejected it).",
      "answer": {
        "surah": 27,
        "ayahs": [
          45
        ],
        "ayah_ar": "﴿وَلَقَدْ أَرْسَلْنَا إِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحًا أَنِ اعْبُدُوا اللَّهَ فَإِذَا هُمْ فَرِيقَانِ يَخْتَصِمُونَ﴾\n[النمل: 45]",
        "ayah_en": "We sent to Thamud their brother Salih: “Worship Allah.” Then they became two disputing factions.",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 7,
      "question_ar": "تزيد النعم أهل الإيمان تواضعاً وخضوعاً وشكراً لله ، بخلاف أهل الطغيان الذين يكفرون النعمة . اذكر جزءاً من آية فيه هذا المعنى .",
      "question_en": "Blessings make people of faith more humble and grateful, unlike tyrants who deny favors. Mention a part of a verse in this Juz expressing that meaning.",
      "answer": {
        "surah": 27,
        "ayahs": [
          40
        ],
        "ayah_ar": "﴿هَٰذَا مِنْ فَضْلِ رَبِّي لِيَبْلُوَنِي أَأَشْكُرُ أَمْ أَكْفُرُ﴾\n[النمل: 40]",
        "ayah_en": "This is from my Lord’s فضل (bounty), to test me: will I be grateful or ungrateful?",
        "commentary_ar": "قال السعدي: (فلم يغتر عليه السلام بملكه وسلطانه وقدرته... بل علم أن ذلك اختبار من ربه فخاف أن لا يقوم بشكر هذه النعمة... وأن الشكر لا ينتفع الله به وإنما يرجع نفعه إلى صاحبه... وأن كفر النعمة داع لزوالها).",
        "commentary_en": "As-Sa‘di explains: the believer does not become deluded by power; he sees blessings as a test, fears falling short in gratitude, and knows gratitude benefits the servant while ingratitude leads to loss of نعمة."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 8,
      "question_ar": "قد تكون هناك قلة قليلة فاسدة تسعى في الأرض فساداً تؤدي إلى هلاك قرية بأكملها حينما لا يؤخذ على أيديهم . اذكر آية من هذا الجزء فيها إشارة لهذا المعنى.",
      "question_en": "A small corrupt minority can cause the ruin of an entire town when they are not restrained. Mention a verse in this Juz indicating that meaning.",
      "answer": {
        "surah": 27,
        "ayahs": [
          48
        ],
        "ayah_ar": "﴿وَكَانَ فِي الْمَدِينَةِ تِسْعَةُ رَهْطٍ يُفْسِدُونَ فِي الْأَرْضِ وَلَا يُصْلِحُونَ﴾\n[النمل: 48]",
        "ayah_en": "In the city there were nine men who spread corruption in the land and did not reform.",
        "commentary_ar": "فقوم صالح هلكوا جميعاً بسبب تسعة؛ لأنّ المجموع كانوا متورطين سكوتاً أو إقراراً أو حثاً.",
        "commentary_en": "The idea is that the wider community shares responsibility when they remain silent, approve, or enable the corrupt few—so the punishment can encompass all."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 9,
      "question_ar": "ميدان من أهم ميادين الجهاد ومتاح لكثيرين منا مذكور في آية ، فما هي ؟",
      "question_en": "One of the most important and widely accessible forms of jihad is mentioned in a verse—what is the verse?",
      "answer": {
        "surah": 25,
        "ayahs": [
          52
        ],
        "ayah_ar": "﴿فَلَا تُطِعِ الْكَافِرِينَ وَجَاهِدْهُمْ بِهِ جِهَادًا كَبِيرًا﴾\n[الفرقان: 52]",
        "ayah_en": "Do not obey the disbelievers; strive against them with it (the Qur’an) with a great striving.",
        "commentary_ar": "جهاد (بِهِ) أي بالقرآن: بالحجة والبيان وتبليغ الوحي، ومقاومة الشبهات والطعنات بالعلم النافع ووسائل التأثير.",
        "commentary_en": "This points to jihad by the Qur’an: clarifying, arguing with proof, conveying revelation, and countering doubts and attacks through sound knowledge and effective communication."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 10,
      "question_ar": "المؤمن صاحب همة عالية . قال رسول الله ﷺ : ( إن الله يحب معالي الأمور ويكره سفسافها ) ( صححه الألباني ) ، وقال أيضاً: (إذا سألتم الله الجنة فاسألوه الفردوس ) (البخاري ) . اذكر ثلاث كلمات من آية فيها بيان لعلو همة المؤمن بطلبه معالي الأمور من ربه عز وجل.",
      "question_en": "The believer has high aspirations. Mention three words from a verse showing this high ambition—seeking lofty ranks from Allah.",
      "answer": {
        "surah": 25,
        "ayahs": [
          74
        ],
        "ayah_ar": "﴿وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا﴾\n[الفرقان: 74]",
        "ayah_en": "And make us leaders (examples) for the righteous.",
        "commentary_ar": "قال السعدي: (أي أوصلنا إلى درجة الإمامة في الدين وأن نكون قدوة للمتقين).",
        "commentary_en": "As-Sa‘di: it’s a du‘a for the highest level—becoming an example and leader in دين for those who have taqwa."
      },
      "difficulty": "",
      "theme": ""
    }
  ]
}
