{
  "juz": 1,
  "items": [
    {
      "qNum": 1,
      "question_ar": "حين خلق الله آدم، كان سبحانه يعلم أن آدم سيهبط من الجنة، وما حصل مع آدم وحواء من تعليم ثم من التعرض لوسوسة الشيطان الذي أغراهما بالأكل من الشجرة كان كله تهيئة لمهمة عظيمة تتطلب أن يكون لديهما حرية الاختيار وأن يتنبها لعداوة الشيطان ومقاومة نوازع الشهوات. اذكر جزءاً من آية يدل على ذلك.",
      "question_en": "When Allah created Adam, He already knew that Adam would descend from Paradise. What occurred with Adam and Hawwa — including instruction and exposure to Satan’s whispering that tempted them to eat from the tree — was all preparation for a great mission that required free choice and awareness of Satan’s enmity and resistance to desires. Mention part of a verse that indicates this meaning.",
      "answer": {
        "surah": 2,
        "ayahs": [
          30
        ],
        "ayah_ar": "﴿وَإِذْ قَالَ رَبُّكَ لِلْمَلَائِكَةِ إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً قَالُوا أَتَجْعَلُ فِيهَا مَن يُفْسِدُ فِيهَا وَيَسْفِكُ الدِّمَاءَ وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ ۖ قَالَ إِنِّي أَعْلَمُ مَا لَا تَعْلَمُونَ﴾",
        "commentary_ar": "فالله - عز وجل - علم أزلاً أن آدم سينزل إلى الأرض بسبب معصيته من قبل أن يخلقه، كما قال: ﴿إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً﴾، ولكنه لم يجبره على معصيته، ولا يخرج شيء عن تقدير الله - تعالى - وحكمته.\nقارن ذلك بما في كتب أهل الكتاب المحرفة التي تُظهر وكان الربُّ متفاجئاً وغضب وخاف من أكل آدم وحواء من الشجرة، تعالى الله عن ذلك.",
        "commentary_en": "Allah — the Exalted — knew from eternity that Adam would descend to the earth because of his sin even before He created him, as He said: ﴾إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً﴿. However, He did not compel him to commit the sin. Nothing occurs outside the decree and wisdom of Allah — the Most High.\nCompare this with what appears in the altered scriptures of the People of the Book, which portray the Lord as surprised, angered, and fearful when Adam and Hawwa ate from the tree. Exalted is Allah far above that."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 2,
      "question_ar": "الأدلة على صحة دين الله تعالى واضحة شافية كافية لكل طالب حق. فإذا رفضها أحد، فهذه دلالة على سوءه، وعلى أن الخروج عن طريق الخير شأنه ودأبه، وذلك بسبب تكذيبه لهذه الأدلة. وفي ذلك رد على من يدعي أن \"الملحد المسكين\" قد تُعرض عليه أدلة الإسلام فلا يقبلها ويكون مع ذلك معذوراً لأنه لم يقتنع بها! بل إذا رفض أي أحد أدلة الإسلام فهذا العيب فيه لا لنقص في الأدلة. اذكر آية تدل على ذلك.",
      "question_en": "The evidences for the truth of Allah’s religion are clear, sufficient, and decisive for anyone seeking truth. If someone rejects them, that indicates fault within himself, not deficiency in the proofs. This refutes the claim that a person who rejects Islam’s evidences is excused simply because he was not convinced. Mention a verse that indicates this meaning.",
      "answer": {
        "surah": 2,
        "ayahs": [
          99
        ],
        "ayah_ar": "﴿وَلَقَدْ أَنْزَلْنَا إِلَيْكَ آيَاتٍ بَيِّنَاتٍ وَمَا يَكْفُرُ بِهَا إِلَّا الْفَاسِقُونَ﴾",
        "commentary_ar": "حيث ذكر الله تعالى أن آياته ﴿بَيِّنَاتٍ﴾ في غاية الوضوح، والدلالة كافية لإقامة الحجة، وعاقبتها - سبحانه - بقوله: ﴿وَمَا يَكْفُرُ بِهَا إِلَّا الْفَاسِقُونَ﴾. فتقديم النفي مع الاستثناء يفيد الحصر، يعني هذه الآيات الواضحات لا يكفر بها إلا الفاسقون الجاحدون لأمر الله تعالى.",
        "commentary_en": "Allah states that His verses are ﴾بَيِّنَاتٍ﴿ — extremely clear and evident — and their proof is sufficient to establish the argument. He then concludes: ﴾وَمَا يَكْفُرُ بِهَا إِلَّا الْفَاسِقُونَ﴿ . The construction of negation followed by exception indicates exclusivity, meaning that none reject these clear signs except those who are defiantly disobedient and who knowingly deny the command of Allah."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 3,
      "question_ar": "تكاليف الإسلام ثقيلة على ضعيف اليقين، وكلما زاد يقينك بالله وباليوم الآخر سهل عليك القيام بها. اذكر الجواب في آيتين متتاليتين.",
      "question_en": "The obligations of Islam are heavy upon one whose certainty is weak. The stronger your certainty in Allah and the Hereafter, the easier they become. Mention the answer in two consecutive verses.",
      "answer": {
        "surah": 2,
        "ayahs": [
          45,
          46
        ],
        "ayah_ar": "﴿وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ ۝ الَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَاقُو رَبِّهِمْ وَأَنَّهُمْ إِلَيْهِ رَاجِعُونَ﴾",
        "commentary_ar": "فالله يذكر لنا في الآية الكريمة شأن الصلاة ﴿وَإِنَّهَا لَكَبِيرَةٌ﴾ يعني: ثقيلة أو شاقة على النفوس. إلا أنها غير ثقيلة على عباده الخاشعين، ووصف هؤلاء الخاشعين بـ﴿الَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَاقُو رَبِّهِمْ﴾ يعني لديهم اليقين بأنهم مبعوثون ومحاسبون وراجعون إلى الله - تعالى -، وهذا اليقين هو ما يعينهم على إقامة الصلاة. والظن هنا بمعنى اليقين، كما في قوله تعالى مثلاً: ﴿إِنِّي ظَنَنتُ أَنِّي مُلَاقٍ حِسَابِيَهْ﴾.\n\nقال ابن عاشور: (والمراد بالخاشع هذا الذي ذلَّ نفسه، وكسر سورتها وعودها أن تطمئن إلى أمر الله، وتطلب حسن العواقب، وأن لا تغتر بما تزينه الشهوة الحاضرة). فهذا الذي كانت تلك صفته قد استعدت نفسه لقبول الخير. وكان المراد بالخاشعين هنا الخائفون الناظرون في العواقب، فتخف عليهم الاستعانة بالصبر والصلاة، مع ما في الصبر من القمع للنفس وما في الصلاة من التزام أوقات معينة وطهارة في أوقات قد يكون للعبد فيها اشتغال بما يهوى أو بما يحصل منه مالاً أو ولداً).",
        "commentary_en": "Allah mentions regarding prayer: ﴾وَإِنَّهَا لَكَبِيرَةٌ﴿ — meaning it is heavy and burdensome upon the souls. However, it is not heavy upon His humble servants. He describes them as ﴾الَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَاقُو رَبِّهِمْ﴿, meaning they possess certainty that they will be resurrected, held accountable, and returned to Allah — the Most High. This certainty is what helps them establish prayer. The word \"yadhunnūn\" here means certainty, as in His statement: ﴾إِنِّي ظَنَنتُ أَنِّي مُلَاقٍ حِسَابِيَهْ﴿.\n\nIbn ‘Ashur said: The khāshi‘ (humbly submissive one) is the person who humbles himself, restrains his impulses, trains his soul to find tranquility in obedience to Allah, seeks good outcomes, and is not deceived by immediate desires. Such a person is prepared to accept goodness. The intended meaning of khāshi‘īn here refers to those who fear consequences and reflect upon outcomes. Therefore, seeking help through patience and prayer becomes easier for them, despite the self-restraint required in patience and the structured times and purification required in prayer, which may conflict with personal desires or worldly pursuits."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 4,
      "question_ar": "من عادة الظالمين والمتآمرين على المسلمين أنهم يعملون بعض الأعمال \"الخيرية\" لضحايا ظلمهم وتآمرهم؛ فلا يقال في هذه الحالة: (أحسنوا في هذا الجانب وإن كانوا أساؤوا في غيره)، بل هم مذمومون بالتسبب في الأذية للناس ولا يُحمدون على تخفيف آثار أذيتهم بعد ذلك. الجواب في آيتين متتاليتين.",
      "question_en": "It is common for oppressors and conspirators against Muslims to perform certain ‘charitable’ acts toward the victims of their own wrongdoing. In such a case, it is not said: ‘They did well in this aspect even if they erred in others.’ Rather, they are blameworthy for causing harm and are not praised for merely lessening its effects afterward. Mention the answer in two consecutive verses.",
      "answer": {
        "surah": 2,
        "ayahs": [
          84,
          85
        ],
        "ayah_ar": "﴿وَإِذْ أَخَذْنَا مِيثَاقَكُمْ لَا تَسْفِكُونَ دِمَاءَكُمْ وَلَا تُخْرِجُونَ أَنفُسَكُم مِّن دِيَارِكُمْ ثُمَّ أَقْرَرْتُمْ وَأَنتُمْ تَشْهَدُونَ ۝ ثُمَّ أَنتُمْ هَؤُلَاءِ تَقْتُلُونَ أَنفُسَكُمْ وَتُخْرِجُونَ فَرِيقًا مِّنكُم مِّن دِيَارِهِمْ تَظَاهَرُونَ عَلَيْهِم بِالْإِثْمِ وَالْعُدْوَانِ وَإِن يَأْتُوكُمْ أُسَارَىٰ تُفَادُوهُمْ وَهُوَ مُحَرَّمٌ عَلَيْكُمْ إِخْرَاجُهُمْ ۚ أَفَتُؤْمِنُونَ بِبَعْضِ الْكِتَابِ وَتَكْفُرُونَ بِبَعْضٍ ۚ فَمَا جَزَاءُ مَن يَفْعَلُ ذَٰلِكَ مِنكُمْ إِلَّا خِزْيٌ فِي الْحَيَاةِ الدُّنْيَا ۖ وَيَوْمَ الْقِيَامَةِ يُرَدُّونَ إِلَىٰ أَشَدِّ الْعَذَابِ ۗ وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ﴾",
        "commentary_ar": "جاء في تفسير البغوي: (قال السدي: إن الله تعالى أخذ على بني إسرائيل في التوراة أن لا يقتل بعضهم بعضًا، ولا يُخرج بعضهم بعضًا من ديارهم، وإنما عبد أمة وجدتموه من بني إسرائيل فاشتروه بما قام من ثمنه وأعتقوه، فكانت قريظة حلفاء الأوس، والنضير حلفاء الخزرج، وكانوا يقتتلون في حرب سِمير فيقاتل بنو قريظة وحلفاؤهم وبنو النضير وحلفاؤهم، فإذا غلبوا أخرجوهم من ديارهم وأخرجوهم منها، وإذا أسروا رجلاً من الفريقين جمعوا له حتى يفدوه وإن كان الأسير من عدوهم، فتعيِّرهم العرب وتقول: كيف تقاتلونهم وتفدونهم؟ قالوا: إنا أُمرنا أن نفديهم، فلم تقاتلونهم؟ قالوا: إنا نستحي أن يستذل حلفاؤنا).\n\nفاليهود كانوا يفعلون هذه الأفعال من افتداء الأسرى والتي ظاهرها (أعمال خيرية)، ومع ذلك لم يقل الله لهم: أحسنتم في هذا الجانب (افتداء الأسرى)، وإن كنتم أسأتم في غيره (قتال إخوانهم من اليهود والتسبب في أسرهم)، بل إن الله تعالى يوجه لهم خطابًا شديدًا بسبب تسببهم بالأذية من البداية ومخالفة النهي ﴿لَا تَسْفِكُونَ دِمَاءَكُمْ وَلَا تُخْرِجُونَ أَنفُسَكُم مِّن دِيَارِكُمْ﴾، ويوجه لهم خطابًا في غاية التشنيع ﴿فَمَا جَزَاءُ مَن يَفْعَلُ ذَٰلِكَ مِنكُمْ إِلَّا خِزْيٌ فِي الْحَيَاةِ الدُّنْيَا وَيَوْمَ الْقِيَامَةِ يُرَدُّونَ إِلَىٰ أَشَدِّ الْعَذَابِ وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ﴾.",
        "commentary_en": "Al-Baghawi reports from al-Suddi that Allah took a covenant upon the Children of Israel in the Torah not to kill one another nor expel one another from their homes. If they found a fellow Israelite enslaved, they were commanded to purchase and free him. Qurayzah were allies of al-Aws and al-Nadir were allies of al-Khazraj. They fought each other in their tribal wars. When victorious, they expelled their opponents from their homes. Yet if captives were taken from either side, they would gather money to ransom them — even if the captive was from their opposing faction. The Arabs would criticize them: “How do you fight them and then ransom them?” They replied: “We were commanded to ransom them.” It was said to them: “Then why do you fight them?” They answered: “We are ashamed that our allies should be humiliated.”\n\nThus the Jews performed acts such as ransoming captives — actions that outwardly appeared charitable. Yet Allah did not say to them: “You did well in this aspect,” even though they wronged in others by fighting and expelling their brethren and causing their captivity. Rather, Allah addresses them sternly for causing harm from the beginning and violating the prohibition: ﴾لَا تَسْفِكُونَ دِمَاءَكُمْ وَلَا تُخْرِجُونَ أَنفُسَكُم مِّن دِيَارِكُمْ﴿. He further condemns them strongly: ﴾فَمَا جَزَاءُ مَن يَفْعَلُ ذَٰلِكَ مِنكُمْ إِلَّا خِزْيٌ فِي الْحَيَاةِ الدُّنْيَا وَيَوْمَ الْقِيَامَةِ يُرَدُّونَ إِلَىٰ أَشَدِّ الْعَذَابِ وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ﴿."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 5,
      "question_ar": "الله عز وجل يعجب لعباده أمر الفاكهة التي تكون بنفس الشكل ولكن بمذاق مختلف. اذكر آية تدل على هذا المعنى.",
      "question_en": "Allah, the Exalted, amazes His servants with fruits that appear identical in form yet differ in taste. Mention a verse that indicates this meaning.",
      "answer": {
        "surah": 2,
        "ayahs": [
          25
        ],
        "ayah_ar": "﴿وَبَشِّرِ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أَنَّ لَهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ۖ كُلَّمَا رُزِقُوا مِنْهَا مِن ثَمَرَةٍ رِّزْقًا قَالُوا هَٰذَا الَّذِي رُزِقْنَا مِن قَبْلُ وَأُتُوا بِهِ مُتَشَابِهًا وَلَهُمْ فِيهَا أَزْوَاجٌ مُّطَهَّرَةٌ وَهُمْ فِيهَا خَالِدُونَ﴾",
        "commentary_ar": "﴿وَأُتُوا بِهِ مُتَشَابِهًا﴾ قيل: يشبه بعضه بعضًا، ويختلف في الطعم، فلا سآمة ولا رتابة في الجنة. حتى الفاكهة التي تبدو بنفس الشكل يتغير طعمها من قبل المفاجأة والله أعلم.",
        "commentary_en": "﴾وَأُتُوا بِهِ مُتَشَابِهًا﴿ — it was said: it resembles one another in appearance, yet differs in taste. Thus there is no boredom or monotony in Paradise. Even fruit that appears identical in form varies in flavor, bringing renewed delight each time. And Allah knows best."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 6,
      "question_ar": "مغفرة الله لذنب عبد لا يلزم منها محو الآثار الدنيوية لمعصيته. اذكر جزءًا من آية يوضح هذا المعنى.",
      "question_en": "Allah’s forgiveness of a servant’s sin does not necessarily mean that the worldly consequences of that sin are removed. Mention part of a verse that clarifies this meaning.",
      "answer": {
        "surah": 2,
        "ayahs": [
          37,
          38
        ],
        "ayah_ar": "﴿فَتَلَقَّىٰ آدَمُ مِن رَّبِّهِ كَلِمَاتٍ فَتَابَ عَلَيْهِ ۚ إِنَّهُ هُوَ التَّوَّابُ الرَّحِيمُ ۝ قُلْنَا اهْبِطُوا مِنْهَا جَمِيعًا﴾",
        "commentary_ar": "فالله - عز وجل - قبل توبة آدم كما أوضح في سورة الأعراف ﴿فَتَلَقَّىٰ آدَمُ مِن رَّبِّهِ كَلِمَاتٍ فَتَابَ عَلَيْهِ﴾، ولكن مع هذه التوبة من الله فإنها لم تمحُ الآثار الدنيوية، وهي الهبوط من الجنة ﴿قُلْنَا اهْبِطُوا مِنْهَا جَمِيعًا﴾.\n\nومثال آخر على ذلك قوله - تعالى -:\n﴿وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ يَا قَوْمِ إِنَّكُمْ ظَلَمْتُمْ أَنفُسَكُم بِاتِّخَاذِكُمُ الْعِجْلَ فَتُوبُوا إِلَىٰ بَارِئِكُمْ فَاقْتُلُوا أَنفُسَكُمْ ذَٰلِكُمْ خَيْرٌ لَّكُمْ عِندَ بَارِئِكُمْ فَتَابَ عَلَيْكُمْ ۚ إِنَّهُ هُوَ التَّوَّابُ الرَّحِيمُ﴾",
        "commentary_en": "Allah — the Exalted — accepted Adam’s repentance as clarified in Surah al-A‘raf: ﴾فَتَلَقَّىٰ آدَمُ مِن رَّبِّهِ كَلِمَاتٍ فَتَابَ عَلَيْهِ﴿. Yet despite this acceptance, the worldly consequence — descending from Paradise — remained: ﴾قُلْنَا اهْبِطُوا مِنْهَا جَمِيعًا﴿.\n\nAnother example is His statement:\n﴾وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ يَا قَوْمِ إِنَّكُمْ ظَلَمْتُمْ أَنفُسَكُم بِاتِّخَاذِكُمُ الْعِجْلَ فَتُوبُوا إِلَىٰ بَارِئِكُمْ فَاقْتُلُوا أَنفُسَكُمْ ذَٰلِكُمْ خَيْرٌ لَّكُمْ عِندَ بَارِئِكُمْ فَتَابَ عَلَيْكُمْ ۚ إِنَّهُ هُوَ التَّوَّابُ الرَّحِيمُ﴿\nAllah accepted their repentance, but it was conditioned upon carrying out the worldly punishment: ﴾فَاقْتُلُوا أَنفُسَكُمْ ذَٰلِكُمْ خَيْرٌ لَّكُمْ عِندَ بَارِئِكُمْ﴿."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 7,
      "question_ar": "في الحديث عن أدلة وجود الله تعالى: نذكر دليل إيجاد المخلوقات. قد يقول قائل: أنا أوجدت من الحيوان المنوي لأبي وبويضة أمي... فنقول: هؤلاء الآباء بدورهم وآباء آبائهم لابد لهم من خالق ينتهي عنده التسلسل. يعني يستحيل عقلاً أن تتسلسل الأسباب إلى ما لا بداية. اذكر ثلاث كلمات من آية تشير إلى هذا المعنى.",
      "question_en": "When discussing proofs for the existence of Allah, we mention the evidence of creation. Someone may say: I was created from my father’s sperm and my mother’s ovum. We respond: those parents — and their parents — must ultimately trace back to a Creator where the chain ends. It is rationally impossible for causes to regress infinitely without a beginning. Mention three words from a verse that indicate this meaning.",
      "answer": {
        "surah": 2,
        "ayahs": [
          21
        ],
        "ayah_ar": "﴿يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ﴾",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 8,
      "question_ar": "من علوية الخطاب القرآني أنك تجد أن الله تعالى يهدد تهديدًا يُخلع القلوب ثم يتبعه بخطاب فيه إيناس وإرشاد وفتح باب التوبة كما قال تعالى:\n\n﴿كَفَرَ الَّذِينَ قَالُوا إِنَّ اللَّهَ ثَالِثُ ثَلَاثَةٍ وَمَا مِنْ إِلَٰهٍ إِلَّا إِلَٰهٌ وَاحِدٌ وَإِن لَّمْ يَنتَهُوا عَمَّا يَقُولُونَ لَيَمَسَّنَّ الَّذِينَ كَفَرُوا مِنْهُمْ عَذَابٌ أَلِيمٌ ۝ أَفَلَا يَتُوبُونَ إِلَى اللَّهِ وَيَسْتَغْفِرُونَهُ وَاللَّهُ غَفُورٌ رَّحِيمٌ﴾\n[المائدة: 73-74]\n\nاذكر آية فيها إقبال من الله تعالى على عباده بعد تخويف وتقريع.",
      "question_en": "From the elevated nature of Qur’anic discourse is that Allah may issue a stern warning that shakes hearts, then follow it with words of comfort, guidance, and an opening toward repentance — as in the cited verses. Mention a verse in which Allah turns toward His servants after warning and reprimand.",
      "answer": {
        "surah": 2,
        "ayahs": [
          20,
          21
        ],
        "ayah_ar": "﴿وَلَوْ شَاءَ اللَّهُ لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَارِهِمْ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ ۝ يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ﴾",
        "commentary_ar": "فجاء التخويف والتقريع في الآية الأولى ﴿وَلَوْ شَاءَ اللَّهُ لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَارِهِمْ﴾، ثم أتبعه بخطاب إقبال ورحمة من الله تعالى ﴿يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ﴾.",
        "commentary_en": "The warning and reprimand come in the first verse: ﴾وَلَوْ شَاءَ اللَّهُ لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَارِهِمْ﴿. Then it is followed by a call of mercy and invitation from Allah: ﴾يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ﴿."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 9,
      "question_ar": "قد يصل المرء مطموس القلب إلى مرحلة أنه لا يدرك سوء عاقبة أفعاله في الأرض والخلق.",
      "question_en": "A person whose heart has become sealed may reach a point where he no longer perceives the evil consequences of his actions upon the earth and its people.",
      "answer": {
        "surah": 2,
        "ayahs": [
          11,
          12
        ],
        "ayah_ar": "﴿وَإِذَا قِيلَ لَهُمْ لَا تُفْسِدُوا فِي الْأَرْضِ قَالُوا إِنَّمَا نَحْنُ مُصْلِحُونَ ۝ أَلَا إِنَّهُمْ هُمُ الْمُفْسِدُونَ وَلَٰكِن لَّا يَشْعُرُونَ﴾",
        "commentary_ar": "فالمنافقون لم يستشعروا سوء عاقبة أفعالهم، وأنها تنشر الفساد في الأرض، بل أوصلهم عمى قلوبهم إلى استشعار أن ما يفعلونه هو من الإصلاح ﴿قَالُوا إِنَّمَا نَحْنُ مُصْلِحُونَ﴾.",
        "commentary_en": "The hypocrites did not sense the evil consequences of their actions or that they were spreading corruption in the land. Rather, the blindness of their hearts led them to believe that what they were doing was reform: ﴾قَالُوا إِنَّمَا نَحْنُ مُصْلِحُونَ﴿."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 10,
      "question_ar": "يحتج بعض المبطلين بقولهم: \"إن الله كتب علينا الضلال، ولو شاء الله لهدانا\". وكأن الله أجبرهم على الضلال ولم يخيرهم. وقد بيَّن القرآن الكريم في عدة مواضع بطلان هذا الادعاء، وأن الإنسان يكتسب بعمل نفسه الحرمان من هداية الله وتوفيقه، كما قال تعالى:\n\n﴿وَقَالُوا قُلُوبُنَا غُلْفٌ ۚ بَل لَّعَنَهُمُ اللَّهُ بِكُفْرِهِمْ فَقَلِيلًا مَّا يُؤْمِنُونَ﴾\n[البقرة: 88]",
      "question_en": "Some false claimants argue: “Allah decreed misguidance upon us, and if He had willed, He would have guided us,” as though Allah forced them into misguidance without choice. The Qur’an clarifies in several places the falsehood of this claim and that a person earns deprivation of guidance through his own actions, as Allah says:\n\n“And they say, ‘Our hearts are wrapped.’ Rather, Allah has cursed them for their disbelief, so little is it that they believe.” [2:88]\n\nMention the answer.",
      "answer": {
        "surah": 2,
        "ayahs": [
          10
        ],
        "ayah_ar": "﴿فِي قُلُوبِهِم مَّرَضٌ فَزَادَهُمُ اللَّهُ مَرَضًا ۖ وَلَهُمْ عَذَابٌ أَلِيمٌ بِمَا كَانُوا يَكْذِبُونَ﴾",
        "commentary_ar": "فالأصل أن قلوبهم كانت مريضة فزادهم الله مرضًا فلم يجبرهم الله عز وجل على مرض القلوب، كما قال تعالى:\n﴿فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ﴾ [الصف: 5].\n\nونجد في المقابل أن من آمن قلبه واهتدى واستسلم له فإن الله يزيده هدى وإيمانًا كما في قوله تعالى:\n﴿وَالَّذِينَ اهْتَدَوْا زَادَهُمْ هُدًى وَآتَاهُمْ تَقْوَاهُمْ﴾\n[محمد: 17].\n\nفالجزاء من جنس العمل.",
        "commentary_en": "The foundation was that their hearts were diseased, so Allah increased them in disease. Allah did not compel them into having diseased hearts. As He says:\n﴾فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ﴿ [As-Saff: 5].\n\nIn contrast, whoever believes with his heart, is guided, and submits — Allah increases him in guidance and faith, as in His statement:\n﴾وَالَّذِينَ اهْتَدَوْا زَادَهُمْ هُدًى وَآتَاهُمْ تَقْوَاهُمْ﴿ [Muhammad: 17].\n\nThus, the recompense is of the same nature as the action."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 11,
      "question_ar": "ما نحن فيه من بلاء ينبغي أن يدفع الناس إلى اللجوء لربهم وطاعته. ولكن بعض العباد إذا لم يُعاجَلوا بالعقوبة أمنوا من عذاب الله. اذكر آيتين متتاليتين يذكر الله فيهما حال أناس أحسوا بالأمان من عذاب الله عز وجل بعد أن صرفه عنهم.",
      "question_en": "The trials we face should drive people to turn to their Lord and obey Him. Yet some people, when not immediately punished, feel secure from Allah’s punishment. Mention two consecutive verses in which Allah describes people who felt safe after punishment was lifted from them.",
      "answer": {
        "surah": 2,
        "ayahs": [
          63,
          64
        ],
        "ayah_ar": "﴿وَإِذْ أَخَذْنَا مِيثَاقَكُمْ وَرَفَعْنَا فَوْقَكُمُ الطُّورَ خُذُوا مَا آتَيْنَاكُم بِقُوَّةٍ وَاذْكُرُوا مَا فِيهِ لَعَلَّكُمْ تَتَّقُونَ ۝ ثُمَّ تَوَلَّيْتُم مِّن بَعْدِ ذَٰلِكَ فَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ لَكُنتُم مِّنَ الْخَاسِرِينَ﴾",
        "commentary_ar": "فالله عز وجل يحكي قصة بني إسرائيل لما رُفع فوقهم الجبل تهديدًا لهم حتى يقبلوا بالتوراة ويعملوا بما فيها، ولكنهم عندما لم يُعاجَلوا بالعقوبة أحسوا بالأمان وانصرفوا عن امتثال الأمر ﴿ثُمَّ تَوَلَّيْتُم مِّن بَعْدِ ذَٰلِكَ﴾.",
        "commentary_en": "Allah recounts the story of the Children of Israel when the mountain was raised above them as a threat so that they would accept the Torah and act upon it. Yet when they were not immediately punished, they felt secure and turned away from obedience: ﴾ثُمَّ تَوَلَّيْتُم مِّن بَعْدِ ذَٰلِكَ﴿."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 12,
      "question_ar": "من ترك ما ينفعه ابتُلي بالاشتغال بما يضره. فمن ترك عبادة الرحمن ابتُلي بعبادة الأوثان، ومن ترك محبة الله وخوفه ورجاءه ابتُلي بمحبة غير الله وخوفه ورجائه، ومن ترك الذل لربه ابتُلي بالذل للعبيد، ومن ترك الحق ابتُلي بالباطل. اذكر ما يدل على ذلك من الجزء الأول.",
      "question_en": "Whoever abandons what benefits him will be tested by becoming occupied with what harms him. Whoever abandons worship of the Most Merciful will be tried with worship of idols; whoever abandons love, fear, and hope in Allah will be tried with directing them elsewhere; whoever abandons humility before his Lord will be tried with humiliation before creation; whoever abandons truth will be tried with falsehood. Mention what indicates this from Juz 1.",
      "answer": {
        "surah": 2,
        "ayahs": [
          101,
          102
        ],
        "ayah_ar": "﴿وَلَمَّا جَاءَهُمْ رَسُولٌ مِّنْ عِندِ اللَّهِ مُصَدِّقٌ لِّمَا مَعَهُمْ نَبَذَ فَرِيقٌ مِّنَ الَّذِينَ أُوتُوا الْكِتَابَ كِتَابَ اللَّهِ وَرَاءَ ظُهُورِهِمْ كَأَنَّهُمْ لَا يَعْلَمُونَ ۝ وَاتَّبَعُوا مَا تَتْلُوا الشَّيَاطِينُ عَلَىٰ مُلْكِ سُلَيْمَانَ ۚ وَمَا كَفَرَ سُلَيْمَانُ وَلَٰكِنَّ الشَّيَاطِينَ كَفَرُوا يُعَلِّمُونَ النَّاسَ السِّحْرَ﴾",
        "commentary_ar": "قال السعدي: (كذلك هؤلاء اليهود لما نبذوا كتاب الله اتبعوا ما تتلو الشياطين واختلفوا من السحر على ملك سليمان حيث أخرجت الشياطين للناس السحر وزعموا أن سليمان عليه السلام كان يستعمله وبه حصل له الملك العظيم، وهم كذبة في ذلك).\n\nوفي المعنى نفسه – أي من ترك الحق ابتلي بالباطل – يقول الله تعالى:\n﴿فَخَلَفَ مِن بَعْدِهِمْ خَلْفٌ أَضَاعُوا الصَّلَاةَ وَاتَّبَعُوا الشَّهَوَاتِ فَسَوْفَ يَلْقَوْنَ غَيًّا﴾\n[مريم: 59].",
        "commentary_en": "As-Sa‘di said: When these Jews cast aside the Book of Allah, they followed what the devils recited during the reign of Solomon. The devils brought forth magic to the people and falsely claimed that Solomon used it and that through it he attained his great kingdom. They were liars in that claim.\n\nIn the same meaning — that whoever abandons truth is tested with falsehood — Allah says:\n﴾فَخَلَفَ مِن بَعْدِهِمْ خَلْفٌ أَضَاعُوا الصَّلَاةَ وَاتَّبَعُوا الشَّهَوَاتِ فَسَوْفَ يَلْقَوْنَ غَيًّا﴿ [Maryam: 59]."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 13,
      "question_ar": "عدم تقدير النعمة قد يجعل العبد يطلب الانتقال إلى ما دونها، وهذا من أسباب سخط الله. قال الله في قوم سبأ: ﴿فَقَالُوا رَبَّنَا بَاعِدْ بَيْنَ أَسْفَارِنَا وَظَلَمُوا أَنفُسَهُمْ﴾ [سبأ: 19]. اذكر آية من الجزء الأول فيها مثل هذا المعنى.",
      "question_en": "Failure to appreciate blessings may lead a person to desire something lesser, which is a cause of Allah’s displeasure. Allah said regarding the people of Saba’: “Our Lord, increase the distance between our journeys,” and they wronged themselves [34:19]. Mention a verse from Juz 1 with a similar meaning.",
      "answer": {
        "surah": 2,
        "ayahs": [
          61
        ],
        "ayah_ar": "﴿وَإِذْ قُلْتُمْ يَا مُوسَىٰ لَن نَّصْبِرَ عَلَىٰ طَعَامٍ وَاحِدٍ فَادْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنبِتُ الْأَرْضُ مِن بَقْلِهَا وَقِثَّائِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَا ۖ قَالَ أَتَسْتَبْدِلُونَ الَّذِي هُوَ أَدْنَىٰ بِالَّذِي هُوَ خَيْرٌ ۚ اهْبِطُوا مِصْرًا فَإِنَّ لَكُم مَّا سَأَلْتُمْ ۗ وَضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ وَالْمَسْكَنَةُ وَبَاءُوا بِغَضَبٍ مِّنَ اللَّهِ ۗ ذَٰلِكَ بِأَنَّهُمْ كَانُوا يَكْفُرُونَ بِآيَاتِ اللَّهِ وَيَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ الْحَقِّ ۗ ذَٰلِكَ بِمَا عَصَوا وَّكَانُوا يَعْتَدُونَ﴾",
        "commentary_ar": "فإن بني إسرائيل لم يقدروا ما أنعم الله به عليهم من المنِّ والسلوى، فطلبوا ما هو أدنى من الأطعمة.",
        "commentary_en": "The Children of Israel did not appreciate the blessing Allah had bestowed upon them of manna and quail, so they asked for food that was inferior."
      },
      "difficulty": "",
      "theme": ""
    }
  ]
}
