{
  "juz": 3,
  "items": [
    {
      "qNum": 1,
      "question_ar": "هناك جملة معترضة في آية ، اعتراضها يدل على أن الله يُعَجِّبُ فيها من\nالضلال الذي يَصِلُ إليه من حُرم من هداية الله وتوفيقه، بحيث يقول أقوالا\nلا يقولها عاقل ، تدل على استهانة بصفات الله . اذكر هذه الآية والجملة\nالمعترضة فيها.",
      "question_en": "There is an interrupting phrase (a parenthetical insertion) inside an ayah. Its placement shows Allah’s amazement at the misguidance a person reaches when deprived of Allah’s guidance and help—until he says things no rational person would say, showing disrespect toward Allah’s attributes. Mention the ayah and the interrupting phrase.",
      "answer": {
        "surah": 3,
        "ayahs": [
          72,
          73
        ],
        "ayah_ar": "وقالت طائِفَةٌ مِن أَهلِ الكِتابِ آمنوا بِالَّذى أُنزِلَ عَلَى الَّذِينَ آمَنوا وَجَهَ النَّهَارِ\nوَاكْفُرُوا آخِرَهُ لَعَلَّهُم يَرْجِعُونَ وَلَا تُؤْمِنُوا إِلَّا لِمَن تَبِعَ دِينَكُم قُلْ إِنَّ الهُدى\nهُدَى اللَّهِ أَن يُؤْتَى أَحَدٌ مِثلَ ما أوتيتُم أَو يُحاجَوكُم عِندَ رَبِّكُم قُلْ إِنَّ الفَضْلَ بِيَدِ\nاللَّهِ يُؤْتِيهِ مَن يَشَاءُ وَاللَّهُ وَاسِعٌ عَلِيمٌ) [آل عمران : 72-73]",
        "commentary_ar": "قال ابن عاشور: وفائدة الاعتراض في أثناء كلامهم المبادرة بما يفيد ضلالهم\nلأن الله حرمهم التوفيق.\nوقال ابن كثير في تفسير وَلا تُؤْمِنُوا إِلَّا لِمَن تَبِعَ دِينَكُم)\nأي : لا تطمئنوا وتظهروا سركم وما عندكم إلا لمن تبع دينكم، ولا تظهروا ما\nبأيديكم إلى المسلمين .. وقوله أَن يُؤتى أَحَدٌ مِثلَ ما أوتيتُم أَو يُحاجَوكُم عِندَ\nرَبِّكُم) ، يقولون : لا تظهروا ما عندكم من العلم للمسلمين، فيتعلموه منكم،\nويساووكم فيه، ويمتازوا به عليكم لشدة الإيمان به، أو يحاجوكم به عند\nالله .\nفانظر كيف أن هؤلاء ما قدروا الله حق قدره فكانوا يتكلمون وكأن الله\nتعالى - لا يعلم سرهم ونجواهم، فخافوا أن إذا آمنوا لغير أهل ملتهم أن يكون\nذلك حُجَّةً عليهم عند ربهم، وكأن الله لا يطلع على نقاشهم هذا . فعجب الله\nمن حالهم بهذه الجملة المعترضة قُل إِنَّ الهُدى هُدَى الله، والله أعلم.",
        "commentary_en": "Ibn ‘Ashur said: The benefit of the parenthetical interruption in the middle of their speech is to hasten to what makes their misguidance clear, because Allah withheld from them true divine enablement (tawfiq).\n\nIbn Kathir said regarding: (وَلَا تُؤْمِنُوا إِلَّا لِمَن تَبِعَ دِينَكُم)\nMeaning: Do not feel secure, and do not reveal your secrets and what you have except to whoever follows your religion; do not disclose what is in your hands to the Muslims. As for His saying: (أَن يُؤْتَى أَحَدٌ مِثلَ ما أوتيتُم أَو يُحاجَوكُم عِندَ رَبِّكُم)\nThey mean: Do not disclose to the Muslims what you have of knowledge, lest they learn it from you, become equal to you in it, and even surpass you by the strength of their faith in it; or lest they use it to argue against you before Allah.\n\nSo look how these people did not give Allah His due—speaking as though Allah Most High does not know their secrets and private counsel. They feared that if they believed openly to someone outside their community, it would become evidence against them before their Lord—as if Allah were not aware of this very discussion. So Allah’s amazement at their state appears in this parenthetical phrase: (قُلْ إِنَّ الهُدى هُدَى الله)، and Allah knows best."
      }
    },
    {
      "qNum": 2,
      "question_ar": "الأصل في العلم أن يُحدِثَ تواضعا للحق وأُلْفَةً بين الناس، لكن من الناس من\nاتخذوه سببا للاختلاف ومادة للتحاسد والتظالم، فعملوا بعكس مقصده.\nاذكر آية بهذا المعنى.",
      "question_en": "Knowledge is supposed to create humility toward the truth and closeness among people. But some people make it a reason for dispute and a fuel for envy and wrongdoing—acting against its purpose. Mention an ayah with this meaning.",
      "answer": {
        "surah": 3,
        "ayahs": [
          19
        ],
        "ayah_ar": "﴿إِنَّ الدِّينَ عِندَ اللهِ الْإِسْلَامُ وَمَا اخْتَلَفَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِن بَعْدِ مَا جَاءَهُمُ\nالْعِلْمُ بَغْيًا بَيْنَهُمْ وَمَن يَكْفُرْ بِآيَاتِ اللَّهِ فَإِنَّ اللَّهَ سَرِيعُ الْحِسَابِ﴾ [آل عمران: 19]",
        "commentary_ar": "وهناك آية من سورة البقرة بهذا المعنى : ﴿وَمَا اخْتَلَفَ فِيهِ إِلَّا الَّذِينَ أُوتُوهُ مِنْ\nبَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَاتُ بَغْيًا بَيْنَهُمْ﴾ [البقرة : 213] . قال ابن كثير: فاختلفوا في\nالحق لتحاسدهم وتباغضهم وتدابرهم ، فحَمِلَ بعضهم بغض البعض الآخر\nعلى مخالفته في جميع أقواله وأفعاله، وإن كانت حقا).",
        "commentary_en": "There is also an ayah from Surah al-Baqarah with this meaning: ﴿وَمَا اخْتَلَفَ فِيهِ إِلَّا الَّذِينَ أُوتُوهُ مِنْ بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَاتُ بَغْيًا بَيْنَهُمْ﴾ [البقرة : 213].\n\nIbn Kathir said: They differed over the truth because of their mutual envy, hatred, and turning away from one another; and some of them were driven by hatred of others to oppose them in all their statements and actions—even when those were correct."
      }
    },
    {
      "qNum": 3,
      "question_ar": "إذا ضحى المسلم في سبيل دينه وبذل له الغالي والنفيس موقنا ومصدقًا\nبالجزاء فإن ذلك يزيده تمسكا بدينه وثباتا عليه . اذكر ثلاث كلمات من آية\nتدل على ذلك.",
      "question_en": "If a Muslim sacrifices for his religion and gives what is precious, fully convinced of Allah’s reward, that increases his attachment to the religion and steadiness upon it. Mention three words from an ayah that show this.",
      "answer": {
        "surah": 2,
        "ayahs": [
          265
        ],
        "ayah_ar": "﴿وَمَثَلُ الَّذِينَ يُنفِقُونَ أَمْوَالَهُمُ ابْتِغَاءَ مَرْضَاتِ اللَّهِ وَتَثْبِيتًا مِّنْ أَنفُسِهِمْ كَمَثَلِ جَنَّةٍ\nبِرَبْوَةٍ أَصَابَهَا وَابِلٌ فَآتَتْ أُكُلَهَا ضِعْفَيْنِ فَإِن لَّمْ يُصِبْهَا وَابِلٌ فَظَلُّ وَاللَّهُ بِمَا\nتَعْمَلُونَ بَصِيرٌ [البقرة : 265 ]",
        "commentary_ar": "قال ابن عاشور : ( ويجيء على الوجه الأول في تفسير التثبيت معنى أخلاقي\nجليل أشار إليه الفخر، وهو ما تقرر في الحكمة الخلقية أن تكرر الأفعال هو\nالذي يُوجِبُ حصول الملكة الفاضلة في النفس، بحيث تَنْساقُ عَقِبَ\nحصولها إلى الكمالات باختيارها ، وبلا كلفة ولا ضجر، فالإيمان يأمر بالصدقة\nوأفعال البر، والذي يأتي تلك المأمورات يُثبت نفسه بأخلاق الإيمان، وعلى\nهذا الوجه تصير الآية تحريضًا على تكرير الإنفاق ) .\nوقال غيره من المفسرين كابن كثير أن الله سيجزيهم على ذلك أوفر الجزاء.",
        "commentary_en": "Ibn ‘Ashur said: In the first approach to explaining “تثبيتًا”, it carries a lofty ethical meaning pointed out by al-Fakhr: in moral wisdom it is established that repeating actions is what produces a firm virtuous trait (malakah) in the soul, such that after it forms, the soul naturally advances—by its own choice—toward higher perfections, without hardship or annoyance. So faith commands charity and righteous deeds; and whoever performs those commanded acts strengthens himself with the character of faith. On this view, the ayah becomes an encouragement to repeat acts of spending.\n\nAnd other commentators, such as Ibn Kathir, said that Allah will reward them for that with the most abundant reward."
      }
    },
    {
      "qNum": 4,
      "question_ar": "عادة ما يُخَذِّلُ الشيطان عن طاعة الله بالتخويف من عواقب هذه الطاعة.\nاذكر آية تدل على ذلك .",
      "question_en": "Shaytan commonly discourages people from obeying Allah by frightening them about the consequences of obedience. Mention an ayah that shows this.",
      "answer": {
        "surah": 2,
        "ayahs": [
          268
        ],
        "ayah_ar": "الشَّيطانُ يَعِدُكُمُ الفَقرَ وَيَأْمُرُكُم بِالفَحْشاءِ وَاللَّهُ يَعِدُكُم مَغْفِرَةً مِنهُ وَفَضْلًا\nوَاللهُ واسِعٌ عَلِيمٌ﴾ [البقرة: 268]",
        "commentary_ar": "الشَّيْطَانُ يَعِدُكُمُ الفَقْرَ) يعني يخوفكم من الفقر إذا أنفقتم في سبيل الله ،\nوَيَأْمُرُكُم بِالفَحشاء) أي بالبخل وعدم إعطاء الزكاة.\nضع هذه الآية أمام عينيك عندما يُخَذِّلُكَ الشيطان عن أي طاعة ويخوفك\nبعواقب هذه الطاعة . تذكر وعد الشيطان ووعد الله - تعالى - وَاللَّهُ يَعِدُكُم\nمَغْفِرَةً مِنْهُ وَفَضلًا).",
        "commentary_en": "(الشَّيْطَانُ يَعِدُكُمُ الفَقْرَ) meaning: he frightens you with poverty if you spend in Allah’s path.\n(وَيَأْمُرُكُم بِالفَحشاء) meaning: he commands you to miserliness and to withhold the obligatory zakah.\n\nKeep this ayah before your eyes when Shaytan discourages you from any act of obedience and scares you with its consequences. Remember Shaytan’s promise and Allah Most High’s promise: (وَاللَّهُ يَعِدُكُم مَغْفِرَةً مِنهُ وَفَضلًا)."
      }
    },
    {
      "qNum": 5,
      "question_ar": "القرآن يعمل على تطهير القلب من خواطر السوء، وذلك باستحضار أن الله\nمطلع على ما يجول فيه، فيستحي العبد أن يرى الله قلبه محلا لتفكير رديء.\nاذكر آية تنمي هذه الرقابة.",
      "question_en": "The Qur’an purifies the heart from evil thoughts by reminding a person that Allah sees what passes within it, so the servant feels ashamed that Allah would see his heart as a place for corrupt thinking. Mention an ayah that nurtures this inner watchfulness.",
      "answer": {
        "surah": 3,
        "ayahs": [
          29
        ],
        "ayah_ar": "قُل إن تُخفوا ما في صدورِكُم أَو تُبدوهُ يَعلَمهُ اللهُ وَيَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي\nالأَرْضِ وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ [آل عمران : 29].",
        "commentary_ar": "",
        "commentary_en": ""
      }
    },
    {
      "qNum": 6,
      "question_ar": "يحلف بعض التجار أيمانا كاذبة أن البضاعة عليه بكذا أو دفع له فيها كذا، ولا\nيدري أن الله - تعالى - هَدَّدَ من يفعل ذلك بآية . اذكرها.",
      "question_en": "Some merchants swear false oaths about what the goods cost them or what they paid, not realizing that Allah Most High threatened those who do this with an ayah. Mention it.",
      "answer": {
        "surah": 3,
        "ayahs": [
          77
        ],
        "ayah_ar": "إِنَّ الَّذِينَ يَشتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِم ثَمَنًا قَلِيلًا أُولبِكَ لَا خَلاقَ لَهُم فِي الْآخِرَةِ\nوَلا يُكَلِّمُهُمُ اللَّهُ وَلا يَنظُرُ إِلَيْهِم يَومَ القِيامَةِ وَلا يُزَكِّيهِم وَلَهُمْ عَذَابٌ أَلِيمٌ﴾ [آل\nعمران : 77]",
        "commentary_ar": "روى البخاري في كتاب البيوع (حديث رقم (2088) : ( عن عبد الله بن أبي أوفى\nأنَّ رَجُلًا أَقامَ سِلْعَةً وهو في السوق ، فَحَلَفَ بِاللَّهِ لَقَدْ أُعْطَى بِهَا مَا لَمْ يُعْط\nلِيُوقِعَ فِيهَا رَجُلًا مِنَ المُسْلِمِينَ ، فَنَزَلَتْ : (إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ\nثَمَنًا قَلِيلًا)).",
        "commentary_en": "Al-Bukhari narrated in the Book of Sales (Hadith no. 2088): from ‘Abdullah ibn Abi Awfa that a man displayed merchandise in the marketplace and swore by Allah that he had been offered for it what he had not actually been offered, in order to deceive a Muslim into buying it. Then this ayah was revealed: (إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا)."
      }
    },
    {
      "qNum": 7,
      "question_ar": "إحدى الأخوات الفاضلات حَثَّت معارفها على التبرع بما لديهم من ملابس\nزائدة لتعطيها للفقراء . فجاءتها تبرعات من أناس أغنياء بملابس متسخة ما\nكانوا ليحبوا مثلها لهم. اذكر آية يَحْسُنُ أن تخاطب بها الأخت هؤلاء لتنبيههم\nعلى خطئهم.",
      "question_en": "A sister encouraged people to donate extra clothing to give to the poor. Some wealthy people donated dirty clothes they would not like for themselves. Mention an ayah that would be suitable for her to remind them of their mistake.",
      "answer": {
        "surah": 2,
        "ayahs": [
          267
        ],
        "ayah_ar": "يَا أَيُّهَا الَّذِينَ آمَنُوا أَنفِقُوا مِن طَيِّبَاتِ مَا كَسَبْتُمْ وَمِمَّا أَخْرَجْنَا لَكُم مِّنَ الْأَرْضِ\nوَلَا تَيَمَّمُوا الْخَبِيثَ مِنْهُ تُنفِقُونَ وَلَسْتُم بِآخِذِيهِ إِلَّا أَن تُغْمِضُوا فِيهِ وَاعْلَمُوا أَنَّ\nاللَّهَ غَنِيٌّ حَمِيدٌ) [البقرة : 267 ]",
        "commentary_ar": "قال القرطبي : قوله تعالى : وَلَسْتُم بِآخِذِيهِ إِلَّا أَن تُغْمِضُوا فِيهِ) أي لستم\nبأخذيه في ديونكم وحقوقكم من الناس إلا أن تتساهلوا في ذلك وتتركوا من\nحقوقكم، وتكرهونه ولا ترضونه . أي : فلا تفعلوا مع الله ما لا ترضونه\nلأنفسكم.",
        "commentary_en": "Al-Qurtubi said regarding His saying: (وَلَسْتُم بِآخِذِيهِ إِلَّا أَن تُغْمِضُوا فِيهِ)\nMeaning: You would not accept it in your debts and the rights people owe you unless you were to be lenient and waive some of your right; you would dislike it and not be pleased with it. Meaning: do not do with Allah what you would not be pleased with for yourselves."
      }
    },
    {
      "qNum": 8,
      "question_ar": "تصور نفسك تكاد تهوي في واد ، فجاء من ينقذك وأنت تخاف أن تكون عقدته\nمرتخية الشد، ولكنك وجدت الحبل منعقداً بإحكام. اذكر آية تُذَكَّرُك بهذه\nالصورة وتطمئن المؤمن .",
      "question_en": "Imagine you are about to fall into a valley, and someone comes to save you. You fear his knot may be loose, but you find the rope tightly secured. Mention an ayah that reminds you of this image and reassures the believer.",
      "answer": {
        "surah": 2,
        "ayahs": [
          256
        ],
        "ayah_ar": "لَا إِكْرَاهَ فِي الدِّينِ قَد تَّبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ فَمَن يَكْفُرْ بِالطَّاغُوتِ وَيُؤْمِن\nبِاللَّهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَى لَا انفِصَامَ لَهَا وَاللَّهُ سَمِيعٌ عَلِيمٌ)\n256 :البقرة[",
        "commentary_ar": "قال الزمخشري في الكشافِ : ( مُثَّلَتْ  َحالُ المُتَوَكِّلِ بِحالِ مَن أَرادَ أَنْ يَتَدَلَّى\nمِن شَاهِقٍ فَاحْتاط لِنَفْسِهِ بِأَنِ اسْتَمْسَكَ بِأَوْثَقِ عُرْوَةٍ مِن حَبْلٍ مَتِينٍ\nمَأْمُونِ انْقِطَاعُهُ ) .",
        "commentary_en": "Al-Zamakhshari said in al-Kashshaf: The state of the one who relies upon Allah is likened to the state of someone who wants to lower himself from a high cliff, so he takes precaution for himself by holding on to the firmest handhold of a strong rope whose breaking is not feared."
      }
    },
    {
      "qNum": 9,
      "question_ar": "إذا منع العبد حق الله وحق عباده، فإن الله يقسي - عليه قلوب عباده ويلقي\nعليه الكراهية بين الناس . اذكر جزءاً من آية يشير إلى هذا المعنى .",
      "question_en": "If a servant withholds Allah’s right and people’s rights, Allah hardens the hearts of His servants against him and casts dislike for him among people. Mention part of an ayah that points to this meaning.",
      "answer": {
        "surah": 2,
        "ayahs": [
          270
        ],
        "ayah_ar": ".. وَمَا أَنفَقْتُم مِّن نِّفَقَةٍ أَوْ نَذَرْتُم مِّن نَذْرٍ فَإِنَّ اللَّهَ يَعْلَمُهُ وَمَا لِلظَّالِمِينَ مِنْ\nأَنصَارٍ} [البقرة: 270].",
        "commentary_ar": "قال ابن عاشور: (وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ) هذا وعيد قوبل به الوعد الذي\nكني عنه بقوله (فَإِنَّ اللهَ يَعْلَمُهُ، والمراد بالظالمين المشركون علنا\nوالمنافقون، لأنّهم إن منعوا الصدقات الواجبة فقد ظلموا مصارفها في\nحقهم في المال وظلموا أنفسهم بإلقائها في تبعات المنع، وإن منعوا صدقة\nالتطوع فقد ظلموا أنفسهم بحرمانها من فضائل الصدقات وثوابها في\nالآخرة . والأنصار جمع نصير، ونفي الأنصار كناية عن نفي النصر والغوث\nفي الآخرة، وهو ظاهر، وفي الدنيا، لأنهم لما بخلوا بنصرهم الفقير بأموالهم\nفإن الله يُعدمهم النصير في المضائق ، ويقسي - عليهم قلوب عباده، ويلقي\nعليهم الكراهية من الناس)).\nوفي الحديث ( صنائع المعروف تقي مصارع السوء ).",
        "commentary_en": "Ibn ‘Ashur said: (وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ) is a threat that comes opposite the promise alluded to by His saying: (فَإِنَّ اللهَ يَعْلَمُهُ). What is meant by “the wrongdoers” are the open idolaters and the hypocrites—because if they withhold the obligatory charities, they have wronged the rightful recipients regarding their due share of wealth, and they have wronged themselves by placing themselves under the consequences of withholding. And if they withhold voluntary charity, they have wronged themselves by depriving themselves of the virtues of charity and its reward in the Hereafter. “Helpers” (أنصار) is the plural of “helper” (نصير). Negating helpers is a way of indicating the absence of victory and rescue in the Hereafter—this is clear—and also in this world, because when they were stingy in supporting the poor with their wealth, Allah deprives them of helpers in times of hardship, hardens the hearts of His servants against them, and casts dislike for them among people.\n\nAnd in the hadith: (صنائع المعروف تقي مصارع السوء)."
      }
    },
    {
      "qNum": 10,
      "question_ar": "من أنعم الله عليه بعلم أو مهارة يحتاجها الناس فينبغي ألا يمنعها عنهم،\nفهذا من تمام شكر النعمة . اذكر جزءاً من آية فيه إشارة إلى ذلك.",
      "question_en": "Whoever Allah blesses with knowledge or a skill people need should not withhold it from them—this is part of truly thanking Allah for the blessing. Mention part of an ayah that indicates this.",
      "answer": {
        "surah": 2,
        "ayahs": [
          282
        ],
        "ayah_ar": "﴿ وَلَا يَأْبَ كَاتِبٌ أَن يَكْتُبَ كَمَا عَلَّمَهُ اللَّهُ ﴾ [البقرة : 282]",
        "commentary_ar": "قال ابن كثير: (وَلَا يَأْبَ كَاتِبٌ أَن يَكْتُبَ كَمَا عَلَّمَهُ اللَّهُ ) أي : ولا يَمْتَنِعْ\nمن يعرف الكتابة إذا سُئِل أن يكتب للناس، ولا ضرورة عليه في ذلك، فكما\nعلمه الله ما لم يكن يعلم، فليتصدق على غيره ممن لا يحسن الكتابة\nوليكتب، كما جاء في الحديث : (إن من الصدقة أن تعين صانعا أو تصنع\nلأخرق ) . وفي الحديث الآخر : ( من كتم علما يعلمه ألجم يوم القيامة بلجام\nمن نار)).\nوهناك خلاف بين أهل العلم في وجوب هذه الكتابة على من تعلمها من\nعدم وجوبها . لكنها مشروعة محضوض عليها على كل حال .",
        "commentary_en": "Ibn Kathir said regarding: (وَلَا يَأْبَ كَاتِبٌ أَن يَكْتُبَ كَمَا عَلَّمَهُ اللَّهُ)\nMeaning: the one who knows how to write should not refuse when asked to write for people, when he is not harmed by doing so. Just as Allah taught him what he did not know, he should give charity to others who do not write well by writing for them—just as mentioned in the hadith: “From charity is that you help a craftsman, or you do something for one who cannot do it well.” And in another hadith: “Whoever conceals knowledge he has will be bridled on the Day of Resurrection with a bridle of fire.”\n\nThere is disagreement among the scholars about whether this writing is obligatory upon the one who learned it or not. But in any case, it is legislated and strongly encouraged."
      }
    },
    {
      "qNum": 11,
      "question_ar": "الصالحون يفرحون عند رؤية إنعام الله على غيرهم من الصالحين بما قد لا\nتتوفر أسبابه لهم هم، ويُطمعهم ذلك في عطاء الله أن يمن عليهم كما من\nعلى غيرهم. اذكر آية تشير إلى هذا المعنى.",
      "question_en": "Righteous people feel happy when they see Allah’s blessings upon other righteous people—even blessings whose causes may not be available to them—and that increases their hope in Allah’s gift that He may bless them as He blessed others. Mention an ayah that points to this meaning.",
      "answer": {
        "surah": 3,
        "ayahs": [
          37,
          38
        ],
        "ayah_ar": "كُلَّمَا دَخَلَ عَلَيْهَا زَكَرِيَّا الْمِحْرَابَ وَجَدَ عِندَهَا رِزْقًا قَالَ يَا مَرْيَمُ أَنَّى لَكِ هَذَا\nقَالَتْ هُوَ مِنْ عِندِ اللَّهِ إِنَّ اللَّهَ يَرْزُقُ مَن يَشَاءُ بِغَيْرِ حِسَابٍ هُنَالِكَ دَعَا\nزَكَرِيَّا رَبَّةٌ قَالَ رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ) [آل\n]38-37:عمران",
        "commentary_ar": "قال ابن كثير: ( لما رأى زكريا عليه السلام أن الله تعالى يرزق مريم، عليها\nالسلام، فاكهة الشتاء في الصيف، وفاكهة الصيف في الشتاء، طمع\nحينئذ في الولد، وإن كان شيخا كبيرا قد ضعف ووهن منه العظم، واشتعل\nرأسه شيبا، وإن كانت امرأته مع ذلك كبيرة وعاقراً، لكنه مع هذا كله سأل\nربه وناداه نداء خفيا ، وقال : رَبِّ هَبْ لِي مِن لَّدُنكَ) أي : من عندك ذُرِّيَّةً\nطيبة ) أي : ولدا صالحا إِنَّكَ سَمِيعُ الدُّعَاءِ)).",
        "commentary_en": "Ibn Kathir said: When Zakariyya—peace be upon him—saw that Allah Most High was providing Maryam—peace be upon her—with the fruit of winter in summer and the fruit of summer in winter, he then hoped for a child, even though he was an elderly man whose bones had weakened and whose head had become white with age, and even though his wife was also old and barren. Yet despite all that, he asked his Lord and called upon Him in a quiet supplication, saying: (رَبِّ هَبْ لِي مِن لَّدُنكَ) meaning: from You, (ذُرِّيَّةً طَيِّبَةً) meaning: a righteous child. (إِنَّكَ سَمِيعُ الدُّعَاءِ)."
      }
    },
    {
      "qNum": 12,
      "question_ar": "آية تعلمنا أن المؤمن مهما بذل في سبيل الله ولو قدم نفسه وماله وأُنْسَه ببلده\nوأهله، فإن غاية ما يصدر عنه هو التعويل على أن تشمله رحمة الله، ولا\nيقطع بأنه من أهلها . اذكر 4 كلمات تعلمنا هذا الأدب .",
      "question_en": "An ayah teaches us that no matter how much a believer gives for Allah’s sake—even his life, wealth, and the comfort of home and family—the most he can do is rely on the hope that Allah’s mercy will include him, and he must not declare with certainty that he is guaranteed it. Mention four words that teach this etiquette.",
      "answer": {
        "surah": 2,
        "ayahs": [
          218
        ],
        "ayah_ar": "(إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَاجَرُوا وَجَاهَدُوا فِي سَبِيلِ اللَّهِ أُولَبِكَ يَرْجُونَ رَحْمَتَ\nاللهِ وَاللَّهُ غَفُورٌ رَّحِيمٌ﴾ [البقرة : 218]",
        "commentary_ar": "فهؤلاء أتوا بالأعمال من التصديق بالله وبرسوله وبما جاء به وهجروا\nديارهم ليتحولوا عن المشركين ، وعن جوارهم وبلادهم وقاتلوا وحاربوا في\nسبيل الله ، ومع ذلك يطمعون أن يرحمهم الله فيدخلهم جنته بفضل\nرحمته إياهم، غير متكئين على أعمالهم التي أتوا بها .\nوفي هذا إشارة إلى أن العبد ولو أتى من الأعمال بما أتى به لا ينبغي له أن\nيعتمد أو يعول عليها ، بل يرجو رحمة ربه ، ويرجو قبول أعماله ومغفرة\nذنوبه ، وستر عيوبه ( مستفاد من تفسير الطبري والسعدي ) .",
        "commentary_en": "These people came with the deeds of affirming faith in Allah, His Messenger, and what he brought. They left their homes to separate from the polytheists, their neighbors, and their lands; and they fought and struggled in Allah’s path. Yet even then they only hope that Allah will have mercy on them and admit them into His Paradise by the فضل of His mercy upon them, not leaning upon the deeds they performed.\n\nIn this is an indication that a servant—no matter what deeds he brings—should not rely or depend upon them. Rather, he should hope for his Lord’s mercy, hope that his deeds will be accepted, hope for forgiveness of his sins, and the covering of his faults. (Derived from the tafsir of al-Tabari and al-Sa‘di.)"
      }
    },
    {
      "qNum": 13,
      "question_ar": "اذكر جزءاً من آية فيه عمل من الأعمال التي يظلك الله بها في ظله يوم لا ظل\nإلا ظله .",
      "question_en": "Mention part of an ayah that includes one of the actions by which Allah will shade a person in His shade on the Day when there is no shade except His shade.",
      "answer": {
        "surah": 2,
        "ayahs": [
          271
        ],
        "ayah_ar": "﴿ إِن تُبْدُوا الصَّدَقَاتِ فَنِعِمَّا هِيَ وَإِن تُخْفُوهَا وَتُؤْتُوهَا الْفُقَرَاءَ فَهُوَ خَيْرٌ لَّكُمْ\nوَيُكَفِّرُ عَنكُم مِّن سَيِّئَاتِكُمْ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ ﴾ [البقرة : 271 ]",
        "commentary_ar": "لها صلة بـ \"رجل تصدق بصدقة فأخفاها \" في حديث : (سبعةُ يُظِلُّهُم الله\nتعالى في ظله يوم لا ظل إلا ظله : إمامُ عَدْلٌ ، وشاب نشأ في عبادة الله ،\nورجل قلبه مُعَلَّق في المساجد، ورجلان تحابا في الله ؛ اجتمعا عليه ، وتفرقا\nعليه ، ورجل دعته امرأةٌ ذاتُ منصب وجمال ، فقال : إِنِّي أخاف الله ، ورجل\nتصدق بصدقة، فأخفاها حتى لا تعلم شماله ما تُنْفِقْ يمينه ، ورجلٌ ذَكَرَ\nالله خالياً ففاضت عيناه ).",
        "commentary_en": "It is connected to “a man who gave charity and concealed it” in the hadith: “Seven will Allah shade in His shade on the Day when there is no shade except His shade: a just leader; a young person who grew up in the worship of Allah; a man whose heart is attached to the mosques; two men who love each other for Allah—meeting upon that and separating upon that; a man whom a woman of status and beauty invites, and he says: ‘Indeed, I fear Allah’; a man who gives charity and hides it so that his left hand does not know what his right hand spends; and a man who remembers Allah in seclusion and his eyes overflow with tears.”"
      }
    },
    {
      "qNum": 14,
      "question_ar": "الله سبحانه لا يُنسب إليه الشر قولا ولا فعلا فهو يفعل الخير ولا يفعل الشر.\nفإذا وجد شر في مفعولاته فهو شر من ) وجه وخير من وجه آخر، والشر إنما هو\nفي المفعولات لا في الأفعال . لذلك لم ينسبه الله لنفسه. وقد ثبت عن النبي\n( والشر ليس إليك ) . اذكر كلمتين من آية فيهما هذا المعنى الجليل.",
      "question_en": "Allah سبحانه is not attributed with evil in speech or action. He does الخير and does not do الشر. If “evil” appears in what He decrees, then it is evil from one angle and good from another; the “evil” is in created outcomes, not in Allah’s فعل. That is why Allah does not attribute it to Himself. And it is established from the Prophet ﷺ: “And evil is not attributed to You.” Mention two words from an ayah that carry this great meaning.",
      "answer": {
        "surah": 3,
        "ayahs": [
          26
        ],
        "ayah_ar": "﴿ قُلِ اللَّهُمَّ مَالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَن تَشَاءُ وَتَنزِعُ الْمُلْكَ مِمَّن تَشَاءُ وَتُعِزُّ مَن\nتَشَاءُ وَتُذِلُّ مَن تَشَاءُ بِيَدِكَ الْخَيْرُ إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ﴾ [آل عمران : 26]",
        "commentary_ar": "(مستفاد من تفسير ابن عثيمين رحمه الله ) .",
        "commentary_en": "(Derived from the tafsir of Ibn ‘Uthaymin, رحمه الله.)"
      }
    }
  ]
}