{
  "juz": 7,
  "items": [
    {
      "qNum": 1,
      "question_ar": "القرآن لا يأتي بالأدلة الواضحة فحسب، بل يبني البنية العقلية الفكرية\nالفطرية السليمة التي تستفيد من الأدلة وتستطيع التفريق بين الحق\nوالباطل. اذكر آية تدل على هذا المعنى .",
      "question_en": "The Qur’an does not merely present clear evidences; rather, it builds a sound innate intellectual structure that benefits from proofs and can distinguish truth from falsehood. Mention a verse indicating this meaning.",
      "answer": {
        "surah": 6,
        "ayahs": [
          104
        ],
        "ayah_ar": "قَدْ جَاءَكُم بَصَابِرُ مِن رَّبِّكُمْ فَمَنْ أَبْصَرَ فَلِنَفْسِهِ، وَمَنْ عَمِيَ فَعَلَيْهَا وَمَا\nأَنَا عَلَيْكُم بِحَفِيظٌ [الأنعام: 104 ]",
        "ayah_en": "There have come to you insights from your Lord. So whoever sees, it is for his own self; and whoever is blind, it is against it. And I am not over you a guardian.",
        "commentary_ar": "قال ابن عاشور : ( وبصائر جمع بصيرة ، والبصيرة : العقل الذي تظهر به المعاني\nوالحقائق ، كما أن البصر إدراك العين الذي تتجلى به الأجسام، وأطلقت\nالبصائر على ما هو سبب فيها).\nوقال في موضع آخر: (وإنما جمع «البصائر» لأن القرآن أنواعاً من الهدى على\nحسب النواحي التي يهدي إليها، من تنوير العقل في إصلاح الاعتقاد، وتسديد\nالفهم في الدين، ووضع القوانين للمعاملات والمعاشرة بين الناس، والدلالة\nعلى طرق النجاح والنجاة في الدنيا، والتحذير من مهاوي الخسران ).",
        "commentary_en": "Ibn ‘Ashur said: “﴾وبصائر﴿ is the plural of ﴾بصيرة﴿, and ﴾البصيرة﴿ is the intellect by which meanings and realities become clear, just as physical sight is the eye’s perception by which bodies are seen. The word ﴾البصائر﴿ is used for that which is a cause and means to such insight.”\n\nHe also said elsewhere: “It was made plural because the Qur’an contains multiple kinds of guidance according to the different aspects it guides toward: illuminating the mind in rectifying belief, directing understanding in religion, laying down regulations for dealings and social interaction among people, indicating paths of success and salvation in worldly life, and warning against the pitfalls of ruin.”"
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 2,
      "question_ar": "كثير من الناس يشكر ربه فقط على النعم الدنيوية ويغض طرفه عن النعم\nالدينية. اذكر آية تدلل على أنه يتوجب على العباد شكر الله لما يمن عليهم\nمن معرفة الأحكام الشرعية وتبيينها.",
      "question_en": "Many people thank their Lord only for worldly blessings while overlooking religious blessings. Mention a verse showing that servants must thank Allah for granting them knowledge of Islamic rulings and clarifying them.",
      "answer": {
        "surah": 5,
        "ayahs": [
          89
        ],
        "ayah_ar": "لا يُؤَاخِذُكُمُ اللهُ بِاللَّغْوِ فِى أَيمَانِكُم وَلكِن يُؤَاخِذُكُم بِمَا عَقَدتُمُ الأَيْمَانَ\nفَكَفَّارَتُهُ إِطعامُ عَشَرَةِ مَساكِينَ مِن أَوسَطِ ما تُطعِمُونَ أَهْلِيكُم أَو كِسوَتُهُم أَو\nتَحْرِيرُ رَقَبَةٍ فَمَن لَم يَجِد فَصِيامُ ثَلاثَةِ أَيَّامٍ ذلِكَ كَفَّارَةُ أَيمَانِكُم إِذا حَلَفْتُم\nواحفظوا أيمانَكُم كَذلِكَ يُبَيِّنُ اللَّهُ لَكُمْ آيَاتِهِ لَعَلَّكُمْ تَشْكُرُونَ [المائدة: 89]",
        "ayah_en": "Allah does not hold you accountable for unintentional speech in your oaths, but He holds you accountable for what you have bound by oaths. So its expiation is feeding ten needy people from the average of what you feed your families, or clothing them, or freeing a slave. But whoever cannot find [the means]—then fasting three days. That is the expiation of your oaths when you swear. And guard your oaths. Thus Allah makes clear to you His verses that you may be grateful.",
        "commentary_ar": "فهذه نعمة يوضح الله عز وجل طريقة تكفير الأيمان، وهذه النعمة فيها\ntالتيسير على المسلمين ، يبينها الله للناس لعلهم يشكروه على هذه النعمة.",
        "commentary_en": "So this is a blessing: Allah, the Mighty and Majestic, clarifies the method of expiating oaths. This blessing contains ease and facilitation for the Muslims. He explains it to the people so that they may thank Him for this blessing."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 3,
      "question_ar": "المؤمن حريص على دخول إخوانه الجنة . قال الله وَمَا كَانَ اللَّهُ لِيُضيع\nإيمانَكُم إِنَّ اللَّهَ بِالنَّاسِ لَرَءُوفٌ رَحِيمٌ ﴾ [البقرة : 143] ردا على من سأل عن\nحال من مات وقبلته إلى بيت المقدس هناك آية أخرى في هذا الجزء فيها الرد\nعلى سؤال كهذا.",
      "question_en": "A believer is eager for his brothers to enter Paradise. Allah said: “And Allah would never let your faith be lost; indeed Allah is to the people Kind and Merciful” (2:143) in response to those who asked about those who died while facing Bayt al-Maqdis. Mention another verse in this Juz that answers a similar question.",
      "answer": {
        "surah": 5,
        "ayahs": [
          93
        ],
        "ayah_ar": "لَيسَ عَلَى الَّذِينَ آمَنوا وَعَمِلُوا الصَّالِحاتِ جُناح فيما طَعِمُوا إِذا مَا اتَّقُوا وَآمَنوا\nوَعَمِلُوا الصَّالِحاتِ ثُمَّ اتَّقَوا وَآمَنوا ثُمَّ اتَّقَوا وَأَحْسَنوا وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ\n[المائدة : 93]",
        "ayah_en": "There is no blame upon those who believe and do righteous deeds for what they consumed, so long as they feared Allah and believed and did righteous deeds, then feared Allah and believed, then feared Allah and did good. And Allah loves the doers of good.",
        "commentary_ar": "قال السعدي : (لما نَزَل تحريم الخمر والنهي الأكيد والتشديد فيه، تمنى\nأناس من المؤمنين أن يعلموا حال إخوانهم الذين ماتوا على الإسلام قبل\nتحريم الخمر وهم يشربونها . فأنزل الله هذه الآية ، وأخبر تعالى أنه لَيْسَ عَلَى\nالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جُنَاحٌ) أي : حرج وإثم فِيمَا طَعِمُوا من الخمر\nوالميسر قبل تحريمهما . ولما كان نفي الجناح يشمل المذكورات وغيرها، قيد\nذلك بقوله : (إِذَا مَا اتَّقَوْا وَآمَنُوا وَعَمِلُوا الصَّالِحَاتِ ) أي : بشرط أنهم تاركون\nللمعاصي، مؤمنون بالله إيمانا صحيحا، موجبا لهم عمل الصالحات، ثم\nاستمروا على ذلك. وإلا فقد يتصف العبد بذلك في وقت دون آخر. فلا يكفي\nحتى يكون كذلك حتى يأتيه أجله، ويدوم على إحسانه، فإن الله يحب\nالمحسنين في عبادة الخالق المحسنين في نفع العبيد، ويدخل في هذه الآية\nالكريمة، من طعم المحرم ، أو فعل غيره بعد التحريم ، ثم اعترف بذنبه وتاب\nإلى الله ، واتقى وآمن وعمل صالحا ، فإن الله يغفر له، ويرتفع عنه الإثم في\nذلك ) .",
        "commentary_en": "Al-Sa‘di said: “When the prohibition of wine was revealed, with the emphatic forbiddance and strong warning in it, some believers wished to know the state of their brothers who died upon Islam before wine was prohibited while they used to drink it. So Allah revealed this verse and informed that ﴾لَيْسَ عَلَى الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جُنَاحٌ﴿ — meaning there is no hardship or sin — concerning what they consumed of wine and gambling before the two were prohibited.\n\nAnd since negating blame could appear to include what is mentioned and other things as well, Allah restricted it with His statement: ﴾إِذَا مَا اتَّقَوْا وَآمَنُوا وَعَمِلُوا الصَّالِحَاتِ﴿ — meaning on the condition that they leave sins and believe in Allah with correct faith that necessitates righteous deeds, and then they continue upon that. Otherwise, a servant may have such qualities at one time but not another, so it is not sufficient unless he remains so until his term comes and persists in ihsān. Indeed, Allah loves the muḥsinīn: those who excel in worship of the Creator and those who excel in benefiting His servants.\n\nAnd this noble verse also includes the one who consumed something prohibited, or committed some other prohibition after it became forbidden, then acknowledged his sin, repented to Allah, feared Allah, believed, and did righteous deeds — Allah forgives him and the sin is lifted from him regarding that matter.”"
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 4,
      "question_ar": "كثير من الناس يغتر بسعة رحمة الله وهو مقصر في طاعة الله مسرف على\nنفسه ويقول رحمته سبحانه واسعة وسيغفر لنا جميعا اذكر آية من جزء\nاليوم يعلمنا فيها سبحانه أنه لا بد للمرء من جناحين يطير بهما الخوف\nوالرجاء.",
      "question_en": "Many people are deceived by the vastness of Allah’s mercy while neglecting obedience and wronging themselves, saying: “His mercy is vast and He will forgive us all.” Mention a verse from today’s Juz teaching that a person must fly with two wings: fear and hope.",
      "answer": {
        "surah": 5,
        "ayahs": [
          98
        ],
        "ayah_ar": "اعلموا أَنَّ اللَّهَ شَدِيدُ العِقابِ وَأَنَّ اللَّهَ غَفُورٌ رَحِيمٌ [المائدة: 98].",
        "ayah_en": "Know that Allah is severe in penalty, and that Allah is Forgiving and Merciful.",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 5,
      "question_ar": "اذكر آية توضح أن المشركين يجمعون بين الضلال والإضلال فلا هم ينتفعون\nالهدى ولا هم يريدون نفعه لغيرهم .",
      "question_en": "Mention a verse showing that the polytheists combine misguidance and leading others astray—neither benefiting from guidance themselves nor wanting it for others.",
      "answer": {
        "surah": 6,
        "ayahs": [
          26
        ],
        "ayah_ar": "وَهُمْ يَنْهَوْنَ عَنْهُ وَيَنْأَوْنَ عَنْهُ وَإِنْ يُهْلِكُونَ إِلا أَنْفُسَهُمْ وَمَا يَشْعُرُونَ\n[الأنعام: 26]",
        "ayah_en": "And they forbid [others] from it and keep away from it, and they destroy none but themselves, though they do not perceive.",
        "commentary_ar": "﴿وَهُمْ يَنْهَوْنَ عَنْهُ﴾ أي: ينهون الناس عن اتباع محمد صلى الله عليه وسلم\n﴿وَيَنْأَوْنَ عَنْهُ﴾ ، أي: يتباعدون عنه بأنفسهم.",
        "commentary_en": "﴾وَهُمْ يَنْهَوْنَ عَنْهُ﴿ means: they forbid people from following Muhammad صلى الله عليه وسلم.\n﴾وَيَنْأَوْنَ عَنْهُ﴿ means: they keep away from it themselves, distancing their own souls from it."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 6,
      "question_ar": "نذارة القرآن لجميع الناس لكن الله سبحانه خص نذارته للمؤمنين في بعض\nالآيات لأنهم المنتفعون على الحقيقة بالقرآن كما قال تعالى : (لِيُنذِرَ مَن كانَ\nحَيًّا وَيَحِقَّ القَولُ عَلَى الكافِرينَ) [يس : 70] . اذكر آية بنفس المعنى.",
      "question_en": "The Qur’an’s warning is for all people, but Allah specified warning believers in some verses because they are the true beneficiaries of the Qur’an, as in: “to warn whoever is alive…” (36:70). Mention a verse with the same meaning.",
      "answer": {
        "surah": 6,
        "ayahs": [
          51
        ],
        "ayah_ar": "وَأَنْذِرْ بِهِ الَّذِينَ يَخَافُونَ أَنْ يُحْشَرُوا إِلَى رَبِّهِمْ لَيْسَ لَهُمْ مِنْ دُونِهِ وَلِيٌّ وَلا شَفِيعٌ\nلَعَلَّهُمْ يَتَّقُونَ [الأنعام:51].",
        "ayah_en": "And warn by it those who fear that they will be gathered to their Lord—there will be for them besides Him no protector and no intercessor—so that they may become righteous.",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 7,
      "question_ar": "آية فيها تنبيه على أنه يحق الحمد لله عند هلاك الظلمة لأن هلاكهم صلاح\nللناس والصلاح أعظم النعم وشكر النعمة واجب. اذكر هذه الآية.",
      "question_en": "Mention a verse indicating that praise is due to Allah upon the destruction of oppressors, because their destruction brings reform for people, and reform is among the greatest blessings for which gratitude is obligatory.",
      "answer": {
        "surah": 6,
        "ayahs": [
          45
        ],
        "ayah_ar": "فَقُطِعَ دَابِرُ الْقَوْمِ الَّذِينَ ظَلَمُوا وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ [الأنعام: 45]",
        "ayah_en": "So the last remnant of the people who wronged was cut off. And praise is due to Allah, Lord of the worlds.",
        "commentary_ar": "قال ابن عاشور: ففي المراد منها اعتبارات ثلاثة :\nأحدها : أن تكون تَلْقِينًا للرسول ﷺ والمؤمنين أنْ يَحْمَدُوا الله على نصره رسله\nوأولياءهم وإهلاك الظالمين ، لأن ذلك النصر نعمة بإزالة فسادٍ كَانَ فِي الأَرْضِ،\nولأن في تذكير الله النّاس به إيماءً إلى ترقب الأسْوَةِ بِما حصل لمن قبلهم أن\nيَتَرَقَّبُوا نَصْرَ اللَّهِ كَمَا نَصَرَ المُؤْمِنِين من قَبْلِهِمْ ، فيكُونُ ﴿الْحَمْدُ لِلَّهِ﴾ مصدرًا\nبدلًا من فعلِهِ ، عدلَ عَنْ نَصْبِهِ وتَنْكِيرِهِ إِلى رَفْعِهِ وتعريفه للدلالة على معنى\nالدَّوامِ والثبات ، كَمَا تَقَدَّمَ فِي قَوْلِهِ تَعالى ﴿الْحَمْدُ لِلَّهِ﴾ فِي سُورَةِ الفَاتِحَةِ .\nثانيها : أن يكون ﴿الْحَمْدُ لِلَّهِ﴾ كِنايَةً عن كون ما ذُكِرَ قبله نعمة من نعمِ اللَّهِ -\nتعالى - لِأَنَّ مِن لَوازِمِ الحَمْدِ أَنْ يَكُونَ عَلى نعمة ، فَكَأَنَّهُ قِيلَ : فَقُطِعَ دَابِرُ القَوْمِ\nالَّذِينَ ظَلَمُوا . وَتِلْكَ نِعْمَةٌ مِن نِعَمِ اللَّهِ تَقْتَضِي حَمْدَهُ.\nثالثها : أن يكون إنْشَاءُ حَمْدِ لِلَّهِ - تعالى - مِن قِبَلِ جَلالِهِ مُسْتَعْمَلًا في التعجيب\nمن معاملة الله - تعالى - إياهم وتدريجهم في درجات الإمهال إلى أنْ حَقَّ\nعليهم العذاب.",
        "commentary_en": "Ibn ‘Ashur said: The intended meaning includes three considerations:\nFirst: that it teaches the Messenger ﷺ and the believers to praise Allah for supporting His messengers and allies and destroying the oppressors, because that victory is a blessing that removes corruption from the earth. Also, Allah’s reminding people of it points to awaiting the same “pattern” that occurred to those before — that they should anticipate Allah’s support just as He supported the believers before them. Thus ﴾الْحَمْدُ لِلَّهِ﴿ is used as a verbal noun standing in place of its verb, and it was shifted from being accusative/indefinite to nominative/definite to indicate permanence and constancy, as in ﴾الْحَمْدُ لِلَّهِ﴿ in Surah al-Fatihah.\nSecond: that ﴾الْحَمْدُ لِلَّهِ﴿ is an indirect indication that what preceded it is a blessing from Allah’s blessings, because praise necessarily corresponds to a blessing — as though it were said: the end of the wrongdoing people was cut off, and that is a blessing that calls for praise.\nThird: that the declaration of praise to Allah — from His own majestic speech — is used to express amazement at how Allah dealt with them, gradually granting them stages of respite until punishment became deserved upon them."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 8,
      "question_ar": "آية كريمة يستدل بها المعطلة ( الذين ينفون صفات الله تعالى ) على نفي\nرؤية الله ، لكن المتدبر والمتأمل سيجد أنّها تدحض قول المعطلة.",
      "question_en": "A noble verse is used by those who deny Allah’s attributes to negate seeing Allah, but the reflective reader finds that it refutes their claim. Mention this verse.",
      "answer": {
        "surah": 6,
        "ayahs": [
          103
        ],
        "ayah_ar": "وَلَا تُدْرِكُهُ الْأَبْصَارُ وَهُوَ يُدْرِكُ الْأَبْصَارَ وَهُوَ اللَّطِيفُ الْخَبِيرُ [الأنعام: 103]",
        "ayah_en": "Vision does not encompass Him, but He encompasses all vision; and He is the Subtle, the All-Aware.",
        "commentary_ar": "قال السعدي : ((لَا تُدْرِكُهُ الْأَبْصَارُ) لعظمته ، وجلاله وكماله ، أي : لا تحيط به\nالأبصار، وإن كانت تراه ، وتفرح بالنظر إلى وجهه الكريم، فنفي الإدراك لا\nينفي الرؤية، بل يثبتها بالمفهوم. فإنه إذا نفى الإدراك، الذي هو أخص\nأوصاف الرؤية ، دل على أن الرؤية ثابتة . فإنه لو أراد نفي الرؤية، لقال \"لا\nتراه الأبصار\" ونحو ذلك ، فعلم أنه ليس في الآية حجة لمذهب المعطلة، الذين\nينفون رؤية ربهم في الآخرة ، بل فيها ما يدل على نقيض قولهم \" . اهـ\nولمزيد من التوضيح نقول : إنَّ الله تعالى ذكر خروج بني إسرائيل من مصر،\nوذكر أن فرعون وجنوده طاردوهم حتى وصلوا إلى مكان رأى فيه كل من\nالفريقين الآخر: (فَلَمَّا تَرَاءَى الْجَمْعَانِ قَالَ أَصْحَابُ مُوسَى إِنَّا لَمُدْرَكُونَ)\nالشعراء : 61 ] فقال بنو إسرائيل : إنَّ فرعون وجنوده قد أحاطوا بنا إِنَّا\nلَمُدْرَكُونَ) فأجابهم موسى عليه السلام نافياً الإدراك والإحاطة : (قَالَ كَلَّا إِنَّ\nمَعِيَ رَبِّي سَيَهْدِينِ) [الشعراء: 62] ، مع أن رؤية كل فريق للآخر قد تحققت\nفَلَمَّا تَرَاءَى الْجَمْعَانِ أي رأى كل فريق الآخر، وبهذا يتبين أن الرؤية تختلف\nعن الإحاطة والإدراك، وأن الآية تنفي الإحاطة بالله ولا تنفي رؤيته، علماً أنَّ\nأدلة إثبات رؤية الله في الآخرة ثابتة بنصوص أخرى من القرآن، ونصوص\nمن السنّة قد بلغت حد التواتر، ووقع إجماع الصحابة والسلف وأهل السنة\nعلى إثبات الرؤية .",
        "commentary_en": "Al-Sa‘di said: ﴾لَا تُدْرِكُهُ الْأَبْصَارُ﴿ is due to His greatness, majesty, and perfection — meaning eyes do not encompass Him. That is, vision does not fully surround or grasp Him, even though it may see Him and rejoice in looking upon His Noble Face. Therefore, negating ﴾الإدراك﴿ does not negate seeing; rather, it affirms seeing by implication. If Allah negates idrāk — which is the most specific and complete aspect of seeing — that indicates that seeing itself is established. If He had intended to negate seeing entirely, He would have said “eyes do not see Him” and the like. Hence, this verse is not proof for the claim of those who deny seeing their Lord in the Hereafter; rather, it indicates the opposite.\n\nFor further clarification: Allah mentioned the departure of the Children of Israel from Egypt, and that Pharaoh and his soldiers pursued them until they reached a place where each group saw the other: (فَلَمَّا تَرَاءَى الْجَمْعَانِ قَالَ أَصْحَابُ مُوسَى إِنَّا لَمُدْرَكُونَ). The Children of Israel said Pharaoh and his soldiers had encompassed them: (إِنَّا لَمُدْرَكُونَ). Then Musa عليه السلام responded, negating idrāk and complete encompassing: (قَالَ كَلَّا إِنَّ مَعِيَ رَبِّي سَيَهْدِينِ), even though seeing between the two sides had already occurred — for (فَلَمَّا تَرَاءَى الْجَمْعَانِ) means each group saw the other. This shows that seeing is different from encompassing and idrāk, and that the verse negates encompassing Allah, not seeing Him. Also, the evidences affirming seeing Allah in the Hereafter are established by other Qur’anic texts and Sunnah texts that have reached the level of tawātur, and there is consensus of the Companions, the early generations, and Ahl al-Sunnah upon affirming the vision."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 9,
      "question_ar": "كلمة ذكرت في الجزء تُطَمْئِن المؤمن أنه إذا أخلص إيمانه لله تعالى، فإنه يحفه\nبالطمأنينة أمام المخوفات.",
      "question_en": "A word mentioned in this Juz reassures the believer that if he purifies his faith for Allah, Allah surrounds him with security in the face of fears.",
      "answer": {
        "surah": 6,
        "ayahs": [
          82
        ],
        "ayah_ar": ".. الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُم بِظُلْمٍ أُولَئِكَ لَهُمُ الْأَمْنُ وَهُم مُّهْتَدُونَ\n[الأنعام: 82]",
        "ayah_en": "Those who believe and do not mix their faith with wrongdoing—those will have security, and they are rightly guided.",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 10,
      "question_ar": "إذا أعرض الإنسان عن الحق أول مرة فإنه قد يعاقب بعدم الهداية بعد ذلك،\nاذكر موضعاً يدل على هذا المعنى .",
      "question_en": "If a person turns away from the truth the first time, he may later be punished by being deprived of guidance. Mention a place indicating this meaning.",
      "answer": {
        "surah": 6,
        "ayahs": [
          110
        ],
        "ayah_ar": "وَنُقَلِبُ أَفْبِدَتَهُمْ وَأَبْصَارَهُمْ كَمَا لَمْ يُؤْمِنُوا بِهِ أَوَّلَ مَرَّةٍ وَنَذَرُهُمْ فِي طُغْيَانِهِمْ\nيَعْمَهُونَ [الأنعام: 110 ]",
        "ayah_en": "And We turn away their hearts and their eyes just as they did not believe in it the first time, and We leave them in their transgression, wandering blindly.",
        "commentary_ar": "قال السعدي: ((وَنُقَلِبُ أَفْبِدَتَهُمْ وَأَبْصَارَهُمْ كَمَا لَمْ يُؤْمِنُوا بِهِ أَوَّلَ مَرَّةٍ وَنَذَرُهُمْ فِي\nطُغْيَانِهِمْ يَعْمَهُونَ) أي : ونعاقبهم، إذا لم يؤمنوا أول مرة يأتيهم فيها الداعي،\nوتقوم عليهم الحجة، بتقليب القلوب، والحيلولة بينهم وبين الإيمان، وعدم\nالتوفيق لسلوك الصراط المستقيم. وهذا من عدل الله، وحكمته بعباده،\nفإنهم الذين جنوا على أنفسهم، وفتح لهم الباب فلم يدخلوا، وبين لهم\nالطريق فلم يسلكوا ، فبعد ذلك إذا حرموا التوفيق ، كان مناسبا لأحوالهم).",
        "commentary_en": "Al-Sa‘di said: ﴾وَنُقَلِبُ أَفْبِدَتَهُمْ وَأَبْصَارَهُمْ كَمَا لَمْ يُؤْمِنُوا بِهِ أَوَّلَ مَرَّةٍ وَنَذَرُهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ﴿ means: We punish them when they do not believe the first time the caller comes to them and the proof is established against them — by turning their hearts away, placing a barrier between them and faith, and not granting them success to walk the straight path. This is from Allah’s justice and wisdom with His servants: they are the ones who harmed themselves; the door was opened for them but they did not enter, the path was made clear for them but they did not walk it. Therefore, when they are later deprived of success, that deprivation is fitting for their condition."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 11,
      "question_ar": "اذكر جزءاً من آية استدل به ابن عباس رضي الله عنهما في الرد على الخوارج\nفي قضية استدلالهم بآية (إِنِ الْحُكْمُ إِلاَّ لِلَّهِ) [يوسف: 40].",
      "question_en": "Mention part of a verse that Ibn ‘Abbas (may Allah be pleased with them both) used in replying to the Khawarij regarding their use of: “Judgment is only for Allah” (12:40).",
      "answer": {
        "surah": 5,
        "ayahs": [
          95
        ],
        "ayah_ar": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَقْتُلُوا الصَّيْدَ وَأَنتُمْ حُرُمٌ وَمَن قَتَلَهُ مِنكُم مُّتَعَمِّدًا فَجَزَاءً\nمِثْلُ مَا قَتَلَ مِنَ النَّعَمِ يَحْكُمُ بِهِ ذَوَا عَدْلٍ مِّنكُمْ هَدْيًا بَالِغَ الْكَعْبَةِ أَوْ كَفَّارَةٌ طَعَامُ\nمَسَاكِينَ أَوْ عَدْلُ ذَلِكَ صِيَامًا لِيَذُوقَ وَبَالَ أَمْرِهِ عَفَا اللَّهُ عَمَّا سَلَفَ وَمَنْ عَادَ\nفَيَنتَقِمُ اللَّهُ مِنْهُ وَاللَّهُ عَزِيزٌ ذُو انتِقَامٍ [المائدة: 95].",
        "ayah_en": "O you who believe, do not kill game while you are in a state of ihram. And whoever of you kills it intentionally—then the penalty is an equivalent from livestock, judged by two just men among you, as an offering delivered to the Ka‘bah; or an expiation: feeding the needy; or the equivalent of that in fasting, that he may taste the consequence of his deed. Allah has pardoned what is past; but whoever returns, Allah will take retribution from him. And Allah is Exalted in Might, Owner of Retribution.",
        "commentary_ar": "قال ابن عباس للخوارج : أما قولكم : حَكَمَ (أي عليٌّ ) الرجال في أمر الله ، فإني\nأقرأ عليكم في كتاب الله أن قد صير الله حكمه إلى الرجال في ثمن ربع درهم،\nفأمر الله تبارك وتعالى أن يحكموا فيه . أرأيت قول الله تبارك وتعالى : يَا أَيُّهَا\nالَّذِينَ آمَنُوا لَا تَقْتُلُوا الصَّيْدَ وَأَنتُمْ حُرُمٌ وَمَن قَتَلَهُ مِنكُم مُّتَعَمِّدًا فَجَزَاءً مِثْلُ مَا\nقَتَلَ مِنَ النَّعَمِ يَحْكُمُ بِهِ ذَوَا عَدْلٍ مِّنكُمْ) وكان من حكم الله أنه صيره إلى\nالرجال يحكمون فيه ، ولو شاء لحكم فيه ، فجاز من حكم الرجال، أنشدكم\nبالله أحكم الرجال في صلاح ذات البين وحقن دمائهم أفضل أو في أرنب ؟\nقالوا : بلى هذا أفضل .",
        "commentary_en": "Ibn ‘Abbas said to the Khawarij: “As for your statement that (Ali) appointed men as judges in the matter of Allah, then I recite to you from the Book of Allah that Allah has assigned His judgment to men even in something as small as the value of a quarter of a dirham, and Allah commanded that they judge in it. Have you not seen the statement of Allah: ﴾يَحْكُمُ بِهِ ذَوَا عَدْلٍ مِّنكُمْ﴿? From Allah’s own ruling, He entrusted it to men to judge in it — and had He willed, He could have judged it Himself. Since judgment by men is allowed, I ask you by Allah: Is the judgment of men in reconciling between people and protecting their blood better, or in [the case of] a rabbit?” They said: “Rather, this is better.”"
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 12,
      "question_ar": "يمتحن الله تبارك وتعالى عباده في مراقبتهم له. وكثر من الناس لا ينجح في\nهذا الاختبار فيعصي الله إذا توارى عن أعين الناس بنظرات حرام أو بغيرها.\nاذكر آية فيها اختبار من الله تعالى لعباده في مراقبتهم له سبحانه ؟",
      "question_en": "Allah tests His servants regarding their awareness of Him. Many people fail this test and disobey Allah when hidden from people’s eyes. Mention a verse that contains such a test from Allah for His servants.",
      "answer": {
        "surah": 5,
        "ayahs": [
          94
        ],
        "ayah_ar": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَيَبْلُوَنَّكُمُ اللَّهُ بِشَيْءٍ مِّنَ الصَّيْدِ تَنَالُهُ أَيْدِيكُمْ وَرِمَاحُكُمْ\nج\nلِيَعْلَمَ اللَّهُ مَن يَخَافُهُ بِالْغَيْبِ فَمَنِ اعْتَدَى بَعْدَ ذَلِكَ فَلَهُ عَذَابٌ أَلِيمٌ\n[المائدة: 94].",
        "ayah_en": "O you who believe, Allah will surely test you with something of the game that your hands and your spears can reach, so that Allah may make evident who fears Him unseen. But whoever transgresses after that—then for him is a painful punishment.",
        "commentary_ar": "قال ابن كثير: لِيَعْلَمَ اللَّهُ مَن يَخَافُهُ بِالْغَيْبِ يعني : أنه تعالى يبتليهم بالصيد\nيغشاهم في رحالهم، يتمكنون من أخذه بالأيدي والرماح سراً وجهراً ليظهر\nطاعة من يطيع منهم في سره وجهره، كما قال تعالى : (إِنَّ الَّذِينَ يَخْشَوْنَ رَبَّهُم\nبِالْغَيْبِ لَهُم مَّغْفِرَةٌ وَأَجْرُ كَبِيرُ [الملك: 12] . اهـ\nومن ذلك ما حدث لنبي الله يوسف - عليه السلام - ، إذ خشي ربه بالغيب\nوقال : مَعَاذَ اللَّهِ إِنَّهُ رَبِّي أَحْسَنَ مَثْوَايَ إِنَّهُ لَا يُفْلِحُ الظَّالِمُونَ﴾ [يوسف: 23]،\nفنجاه الله تبارك وتعالى وصرف عنه كيد امرأة العزيز وسائر النساء.",
        "commentary_en": "Ibn Kathir said: ﴾لِيَعْلَمَ اللَّهُ مَن يَخَافُهُ بِالْغَيْبِ﴿ means that Allah tests them with game that comes close to them in their dwellings, such that they are able to take it with their hands and spears, secretly and openly — so that the obedience of whoever obeys Him becomes evident both in private and in public; as Allah said: ﴾إِنَّ الَّذِينَ يَخْشَوْنَ رَبَّهُم بِالْغَيْبِ لَهُم مَّغْفِرَةٌ وَأَجْرٌ كَبِيرُ﴿.\n\nAnd from that meaning is what occurred with the Prophet of Allah Yusuf عليه السلام: he feared his Lord in the unseen and said: ﴾مَعَاذَ اللَّهِ إِنَّهُ رَبِّي أَحْسَنَ مَثْوَايَ إِنَّهُ لَا يُفْلِحُ الظَّالِمُونَ﴿, so Allah saved him and turned away from him the plot of the wife of al-‘Aziz and the other women."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 13,
      "question_ar": "لا بد للمسلم أن يطير بجناحي الخوف والرجاء، فلا يقتصر على الخوف فقط\nفيقنط، ولا على الرجاء فقط فيسرف على نفسه . اذكر آية تذكر من صفات\nالله عز وجل ما يُحدث لدى المؤمن الشعور بالخوف والرجاء.",
      "question_en": "A Muslim must fly with two wings: fear and hope—neither relying only on fear so as to despair, nor only on hope so as to become negligent. Mention a verse describing attributes of Allah that produce both fear and hope in the believer.",
      "answer": {
        "surah": 5,
        "ayahs": [
          98
        ],
        "ayah_ar": "اعْلَمُوا أَنَّ اللَّهَ شَدِيدُ الْعِقَابِ وَأَنَّ اللَّهَ غَفُورٌ رَّحِيمٌ [المائدة: 98].",
        "ayah_en": "Know that Allah is severe in punishment, and that Allah is Forgiving and Merciful.",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 14,
      "question_ar": "عذاب الكفار في النار رُتَب ودرجات ، فثمة فرق بين الكافر المفسد في الأرض\nالصَّاد عن سبيل الله ، والكافر غير الصَّاد، كما قال تعالى (الَّذِينَ كَفَرُوا وَصَدُّوا\nعَن سَبِيلِ اللَّهِ زِدْنَاهُمْ عَذَابًا فَوْقَ الْعَذَابِ بِمَا كَانُوا يُفْسِدُونَ) [النحل : 88] . اذكر\nآية توضح هذا المعنى، أن العذاب على حسب فعل الكافر.",
      "question_en": "The punishment of disbelievers in the Fire has levels and degrees. There is a difference between the disbeliever who spreads corruption and blocks others from Allah’s path and the disbeliever who does not. Mention a verse showing that punishment corresponds to the disbeliever’s actions.",
      "answer": {
        "surah": 5,
        "ayahs": [
          115
        ],
        "ayah_ar": "قَالَ اللَّهُ إِنِّي مُنَزِّلُهَا عَلَيْكُمْ فَمَن يَكْفُرْ بَعْدُ مِنكُمْ فَإِنِّي أُعَذِّبُهُ عَذَابًا لَّا أُعَذِّبُهُ\nأَحَدًا مِّنَ الْعَالَمِينَ [المائدة 115 ]",
        "ayah_en": "Allah said, “Indeed, I will send it down to you, but whoever disbelieves afterward among you—then indeed I will punish him with a punishment by which I have not punished anyone among the worlds.”",
        "commentary_ar": "فمن أراه الله براهين فوق ما أرى غيره ثم كفر كان عذابه أشد.\nقال ابن كثير: (أي : فمن كذب بها من أمتك يا عيسى وعاندها فَإِنِّي أُعَذِّبُهُ\nعَذَابًا لَّا أُعَذِّبُهُ أَحَدًا مِّنَ الْعَالَمِينَ ) أي : من عالمي زمانكم، كقوله : (وَيَوْمَ تَقُومُ\nالسَّاعَةُ أَدْخِلُوا آلَ فِرْعَوْنَ أَشَدَّ الْعَذَابِ﴾ [غافر : 46]، وكقوله : (إِنَّ الْمُنَافِقِينَ فِي\nالدَّرْكِ الْأَسْفَلِ مِنَ النَّارِ وَلَن تَجِدَ لَهُمْ نَصِيرًا) [النساء : 145]).",
        "commentary_en": "So whoever Allah showed signs and evidences beyond what He showed others, then disbelieved—his punishment will be more severe.\n\nIbn Kathir said: “Meaning: whoever among your people, O ‘Isa, denies it and stubbornly rejects it, then ﴾فَإِنِّي أُعَذِّبُهُ عَذَابًا لَّا أُعَذِّبُهُ أَحَدًا مِّنَ الْعَالَمِينَ﴿ — meaning from the people of your time — as in His statement: ﴾وَيَوْمَ تَقُومُ السَّاعَةُ أَدْخِلُوا آلَ فِرْعَوْنَ أَشَدَّ الْعَذَابِ﴿, and His statement: ﴾إِنَّ الْمُنَافِقِينَ فِي الدَّرْكِ الْأَسْفَلِ مِنَ النَّارِ وَلَن تَجِدَ لَهُمْ نَصِيرًا﴿.”"
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 15,
      "question_ar": "يشيع في كلام الكفار عن النبي ﷺ : \" نبي العرب \" ، وقد يذكرون هذا المصطلح\nفي معرض كلام فيه مديح له ﷺ ، فيتناقله المسلمون على سبيل الحفاوة\nوالاعتزاز بهذا المديح . فنقول : عدا عن أن نبينا ﷺ مستغن عن مدح من كفر\nبه ، فإن هذا الوصف \"نبي العرب \" فيه حصر بجهل أو بقصد للرسالة في قوم\nمعينين ، وهذا باطل . اذكر جزءاً من آية يوضح أن القرآن نزل لكل الخلق\nولكافة العصور، وليس لطائفة معينة كما يزعم ويدعي البعض.",
      "question_en": "Disbelievers sometimes refer to the Prophet ﷺ as “the Prophet of the Arabs,” and some Muslims repeat this thinking it is praise. But the Prophet ﷺ is not in need of the praise of those who disbelieved in him, and this description falsely restricts the message to a specific people. Mention part of a verse showing the Qur’an was revealed for all people and all times, not for a specific group.",
      "answer": {
        "surah": 6,
        "ayahs": [
          19
        ],
        "ayah_ar": "قُلْ أَيُّ شَيْءٍ أَكْبَرُ شَهَادَةً قُلِ اللَّهُ شَهِيدٌ بَيْنِي وَبَيْنَكُمْ وَأُوحِيَ إِلَيَّ هَذَا الْقُرْآنُ\nلأُنذِرَكُم بِهِ وَمَن بَلَغَ أَبِنَّكُمْ لَتَشْهَدُونَ أَنَّ مَعَ اللَّهِ آلِهَةً أُخْرَىٰ قُل لَّا أَشْهَدُ قُلْ\nإِنَّمَا هُوَ إِلَهُ وَاحِدٌ وَإِنَّنِي بَرِيءٌ مِّمَّا تُشْرِكُونَ [الأنعام: 19]",
        "ayah_en": "Say, “What thing is greatest in testimony?” Say, “Allah is witness between me and you. And this Qur’an has been revealed to me that I may warn you by it and whoever it reaches. Do you indeed testify that with Allah there are other gods?” Say, “I do not testify.” Say, “He is only one God, and indeed I am free of what you associate.”",
        "commentary_ar": "قال ابن عاشور : ( وَمَن بَلَغَ عَطْفٌ عَلى ضَمِيرِ المُخاطَبِينَ، أَيْ وَلِأُنْذِرَ بِهِ مَن\nبَلَغَهُ القُرْآنُ وَسَمِعَهُ وَلَوْ لَمْ أُشافِهْهُ بِالدَّعْوَةِ ، وعُمُومُ \" من \" وصِلَتِها (أي :\nبلغ ) يَشْمَلُ كُلَّ مَن يَبْلُغُهُ القُرْآنُ فِي جَمِيعِ العُصُورِ).\nيضاف إلى ذلك آيات أخرى واضحة في هذا المعنى كقوله تعالى :\nتَبَارَكَ الَّذِي نَزَّلَ الْفُرْقَانَ عَلَى عَبْدِهِ لِيَكُونَ لِلْعَالَمِينَ نَذِيرًا) [الفرقان: 1]\nوقوله تعالى: (وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِلْعَالَمِينَ) [الأنبياء: 107]",
        "commentary_en": "Ibn ‘Ashur said: “﴾وَمَن بَلَغَ﴿ is connected to the pronoun of the addressed people, meaning: ‘and that I may warn by it whoever the Qur’an reaches and whoever hears it, even if I do not directly address him with the call.’ And the generality of ‘whoever’ and its connection (i.e., ‘reaches’) includes everyone to whom the Qur’an reaches in all eras.”\n\nIn addition to that, there are other clear verses with this meaning, such as His statement: (تَبَارَكَ الَّذِي نَزَّلَ الْفُرْقَانَ عَلَى عَبْدِهِ لِيَكُونَ لِلْعَالَمِينَ نَذِيرًا) and His statement: (وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِلْعَالَمِينَ)."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 16,
      "question_ar": "آية فيها تَسْلِيَةٌ لِلرَّسُولِ عَلَيْهِ الصَّلاةُ والسَّلامُ ( يعني إذهاب لحزنه ) ، وأنَّ ما\nأرادُوا بِهِ نِكَايَتَهُ إِنَّما ينقلب عليهم، فيظنون أنهم يضرون النبي وفي الحقيقة\nإنما يعود الدمار عليهم هم.",
      "question_en": "Mention a verse that consoles the Messenger ﷺ (i.e., removes his grief), showing that what they intend as harm against him will in fact turn back upon them—they think they are harming him, but the destruction returns upon themselves.",
      "answer": {
        "surah": 6,
        "ayahs": [
          26
        ],
        "ayah_ar": " وَهُمْ يَنْهَوْنَ عَنْهُ وَيَنْأَوْنَ عَنْهُ وَإِن يُهْلِكُونَ إِلَّا أَنفُسَهُمْ وَمَا يَشْعُرُونَ\n[الأنعام: 26]",
        "ayah_en": "And they forbid [others] from it and keep away from it, and they destroy none but themselves, while they do not perceive.",
        "commentary_ar": "",
        "commentary_en": ""
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 17,
      "question_ar": "اذكر آية من شبهت الكفار بالأموات، وذلك لموت قلوبهم.",
      "question_en": "Mention a verse that likens the disbelievers to the dead because of the death of their hearts.",
      "answer": {
        "surah": 6,
        "ayahs": [
          36
        ],
        "ayah_ar": "إِنَّمَا يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ وَالْمَوْتَى يَبْعَثُهُمُ اللَّهُ ثُمَّ إِلَيْهِ يُرْجَعُونَ [الأنعام\n[36",
        "ayah_en": "Only those who hear will respond; and the dead—Allah will resurrect them; then to Him they will be returned.",
        "commentary_ar": "قال ابن كثير: (وَقَوْلُهُ : إِنَّمَا يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ أَيْ : إِنَّمَا يَسْتَجِيبُ\nلِدُعَائِكَ يَا مُحَمَّدُ مَنْ يَسْمَعُ الْكَلَامَ وَيَعِيهِ وَيَفْهَمُهُ ، كَقَوْلِهِ: ( لِيُنذِرَ مَن كَانَ\nحَيًّا وَيَحِقَّ الْقَوْلُ عَلَى الْكَافِرِينَ) [يس: 70] ، وَقَوْلُهُ وَالْمَوْتَى يَبْعَثُهُمُ اللَّهُ يَعْنِي :\nبِذَلِكَ الْكَفَّارَ؛ لِأَنَّهُمْ مَوْتَى الْقُلُوبِ ، فَشَبَّهَهُمُ اللَّهُ بِأَمْوَاتِ الْأَجْسَادِ فَقَالَ:\nوَالْمَوْتَى يَبْعَثُهُمُ اللَّهُ ثُمَّ إِلَيْهِ يُرْجَعُونَ) وَهَذَا مِنْ بَابِ التَّهَكُمِ بِهِمْ، وَالِازْدِرَاءِ\nعَلَيْهِمْ )) .\nوهذا المعنى موجود أيضاً في آيةً في الجزء الثامن، وهي :\nأَوَمَن كَانَ مَيْتًا فَأَحْيَيْنَاهُ وَجَعَلْنَا لَهُ نُورًا يَمْشِي بِهِ فِي النَّاسِ كَمَن مَّثَلُهُ فِي الظُّلُمَاتِ\nلَيْسَ بِخَارِجِ مِنْهَا كَذَلِكَ زُيِّنَ لِلْكَافِرِينَ مَا كَانُوا يَعْمَلُونَ﴾ [الأنعام : 122].",
        "commentary_en": "Ibn Kathir said: “His statement: ﴾إِنَّمَا يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ﴿ means: only the one who hears the speech, comprehends it, and understands it will respond to your call, O Muhammad — as in His statement: (لِيُنذِرَ مَن كَانَ حَيًّا وَيَحِقَّ الْقَوْلُ عَلَى الْكَافِرِينَ). And His statement: وَالْمَوْتَى يَبْعَثُهُمُ اللَّهُ refers to the disbelievers, because they are dead in their hearts. So Allah likened them to the dead bodies and said: وَالْمَوْتَى يَبْعَثُهُمُ اللَّهُ ثُمَّ إِلَيْهِ يُرْجَعُونَ. This is by way of ridicule and belittlement of them.”\n\nAnd this meaning is also found in a verse in the eighth Juz, namely:\nأَوَمَن كَانَ مَيْتًا فَأَحْيَيْنَاهُ وَجَعَلْنَا لَهُ نُورًا يَمْشِي بِهِ فِي النَّاسِ كَمَن مَّثَلُهُ فِي الظُّلُمَاتِ لَيْسَ بِخَارِجِ مِنْهَا كَذَلِكَ زُيِّنَ لِلْكَافِرِينَ مَا كَانُوا يَعْمَلُونَ﴿."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 18,
      "question_ar": "آيتان من سورة الأنعام فسرهما النبي ﷺ بآيتين من سورة لقمان . فما هما ؟",
      "question_en": "Two verses from Surah al-An‘am were explained by the Prophet ﷺ using two verses from Surah Luqman. What are they?",
      "answer": {
        "surah": 6,
        "ayahs": [
          59,
          82
        ],
        "ayah_ar": "وَعِندَهُ مَفَاتِحُ الْغَيْبِ لَا يَعْلَمُهَا إِلَّا هُوَ وَيَعْلَمُ مَا فِي الْبَرِّ وَالْبَحْرِ وَمَا تَسْقُطُ مِن\nوَرَقَةٍ إِلَّا يَعْلَمُهَا وَلَا حَبَّةٍ فِي ظُلُمَاتِ الْأَرْضِ وَلَا رَطْبٍ وَلَا يَابِسٍ إِلَّا فِي كِتَابٍ\nمُّبِينٍ [الأنعام: 59]\nالَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُم بِظُلْمٍ أُولَئِكَ لَهُمُ الْأَمْنُ وَهُم\nمُّهْتَدُونَ [الأنعام: 82]",
        "ayah_en": "And with Him are the keys of the unseen; none knows them except Him. And He knows what is on the land and in the sea. Not a leaf falls but He knows it; nor a grain in the darknesses of the earth; nor anything fresh or dry—except that it is in a clear record. (6:59)\nThose who believe and do not mix their faith with wrongdoing—those will have security, and they are rightly guided. (6:82)",
        "commentary_ar": "وهي مفسرة بالآية 34 من سورة لقمان:\nقَالَ الْبُخَارِيُّ : حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ\nشِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ ، عَنْ أَبِيهِ ، أَنَّ رَسُولَ اللَّهِ ﷺ قَالَ: \"مَفَاتِحُ\nالْغَيْبِ خَمْسٌ لَا يَعْلَمُهَا إِلَّا اللَّهُ : إِنَّ اللَّهَ عِندَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ وَيَعْلَمُ\nمَا فِي الْأَرْحَامِ وَمَا تَدْرِي نَفْسٌ مَّاذَا تَكْسِبُ غَدًا وَمَا تَدْرِي نَفْسٌ بِأَيِّ أَرْضٍ\nتَمُوتُ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ [لقمان: 34].\nالآية الثانية : الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُم بِظُلْمٍ أُولَئِكَ لَهُمُ الْأَمْنُ وَهُم\nمُّهْتَدُونَ) [الأنعام: 82]\nوهي مفسرة بالآية 13 من سورة لقمان :\nفي مسند أحمد : لما نزلت هذه الآية : (الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُم بِظُلْمٍ)\nشق ذلك على الناس وقالوا : يا رسول الله ، فأينا لا يظلم نفسه ؟ قال : \"إنه\nليس الذي تعنون ! ألم تسمعوا ما قال العبد الصالح : يَا بُنَيَّ لَا تُشْرِكْ بِاللَّهِ\nإِنَّ الشَّرْكَ لَظُلْمٌ عَظِيمٌ﴾ [لقمان: 13] إنما هو الشرك \" وأصل الحديث في\nالبخاري.",
        "commentary_en": "It is explained by verse 34 of Surah Luqman.\n\nAl-Bukhari narrated: ‘Abd al-‘Aziz ibn ‘Abd Allah narrated to us; Ibrahim ibn Sa‘d narrated to us; from Ibn Shihab; from Salim ibn ‘Abd Allah; from his father; that the Messenger of Allah ﷺ said: “The keys of the unseen are five—none knows them except Allah: ﴾إِنَّ اللَّهَ عِندَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ وَيَعْلَمُ مَا فِي الْأَرْحَامِ وَمَا تَدْرِي نَفْسٌ مَّاذَا تَكْسِبُ غَدًا وَمَا تَدْرِي نَفْسٌ بِأَيِّ أَرْضٍ تَمُوتُ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ﴿.\n\nThe second verse is: ﴾الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُم بِظُلْمٍ أُولَئِكَ لَهُمُ الْأَمْنُ وَهُم مُّهْتَدُونَ﴿, and it is explained by verse 13 of Surah Luqman.\n\nIn Musnad Ahmad: when this verse was revealed: (الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُم بِظُلْمٍ), it was difficult for the people, and they said: “O Messenger of Allah, which of us does not wrong himself?” He said: “It is not what you are thinking. Have you not heard what the righteous servant said: ﴾يَا بُنَيَّ لَا تُشْرِكْ بِاللَّهِ إِنَّ الشَّرْكَ لَظُلْمٌ عَظِيمٌ﴿? It is only shirk.” And the أصل of the hadith is in al-Bukhari."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 19,
      "question_ar": "آية فيها دليل للقاعدة الشرعية ، وهي أن الوسائل تعتبر بالأمور التي توصل\nإليها، وأن وسائل المحرم ، وإن كانت جائزة في الأصل ، تكون محرمة إذا كانت\nتفضي إلى الشر.",
      "question_en": "Mention a verse that establishes the legal principle that means are judged according to their ends—so means leading to the prohibited, even if permissible in origin, become prohibited if they lead to evil.",
      "answer": {
        "surah": 6,
        "ayahs": [
          108
        ],
        "ayah_ar": "وَلَا تَسُبُّوا الَّذِينَ يَدْعُونَ مِن دُونِ اللَّهِ فَيَسُبُّوا اللَّهَ عَدْوًا بِغَيْرِ عِلْمٍ كَذَلِكَ زَيَّنَّا\nلِكُلِّ أُمَّةٍ عَمَلَهُمْ ثُمَّ إِلَى رَبِّهِم مَّرْجِعُهُمْ فَيُنَبِّئُهُم بِمَا كَانُوا يَعْمَلُونَ [الأنعام : 108]",
        "ayah_en": "And do not insult those they invoke besides Allah, lest they insult Allah in enmity without knowledge. Thus We have made pleasing to every nation their deeds; then to their Lord is their return, and He will inform them about what they used to do.",
        "commentary_ar": "قال السعدي : ينهى الله المؤمنين عن أمر كان جائزا ، بل مشروعا في الأصل،\nوهو سب آلهة المشركين ، التي اتخذت أوثانا وآلهة مع الله، والتي يتقرب إلى\nالله بإهانتها وسبها . ولكن لما كان هذا السب طريقا إلى سب المشركين لرب\nالعالمين، الذي يجب تنزيه جنابه العظيم عن كل عيب وآفة وسب وقدح، نهى\nالله عن سب آلهة المشركين ، لأنهم يحمون لدينهم، ويتعصبون له .... وفي\nهذه الآية الكريمة، دليل للقاعدة الشرعية وهو أن الوسائل تعتبر بالأمور التي\nتوصل إليها، وأن وسائل المحرم ، ولو كانت جائزة ، تكون محرمة إذا كانت\nتفضي إلى الشر.",
        "commentary_en": "Al-Sa‘di said: Allah forbids the believers from something that was permissible—rather, originally legislated—namely insulting the gods of the polytheists, which they took as idols and deities besides Allah, and by insulting them one would intend closeness to Allah by humiliating falsehood. But since this insult becomes a path leading the polytheists to insult the Lord of the worlds—whose majestic sanctity must be declared free from every defect, harm, insult, and slander—Allah forbade insulting their gods, because they become protective and fanatical for their religion.\n\nAnd in this noble verse is evidence for the legal principle: means are judged by what they lead to, and the means to something prohibited—even if permissible—becomes prohibited if it leads to evil."
      },
      "difficulty": "",
      "theme": ""
    }
  ]
}
