{
  "juz": 2,
  "items": [
    {
      "qNum": 1,
      "question_ar": "من مظاهر الحيود عن دين الله في الخصومات العشائرية : أنك تجد من إذا قتل منهم شخص حرصوا على أن يقتلوا من عشيرة القاتل شخصا أوجه أو عددًا أكبر من الأشخاص. أذكر آية تخاطب بها هؤلاء وتبين لهم أن الله ينهاهم عن ذلك .",
      "question_en": "One sign of deviating from Allah’s religion in tribal conflicts is when, if one of them is killed, they insist on killing someone “more notable” from the killer’s tribe—or killing a greater number of people. Mention a verse that addresses such people and shows that Allah forbids this.",
      "answer": {
        "surah": "البقرة",
        "ayah": "178",
        "ayah_ar": "يا أَيُّهَا الَّذِينَ آمَنوا كُتِبَ عَلَيْكُمُ القِصاصُ فِي القَتْلَى الْحُرُّ بِالْحَرِّ وَالْعَبْدُ بِالعَبدِ وَالأُنثى بِالأُنثى فَمَن عُفِيَ لَهُ مِن أَخيهِ شَيْءٌ فَاتِّباعُ بِالْمَعْرُوفِ وَأَداءُ إِلَيْهِ بِإِحْسَانٍ ذلِكَ تَخفيفٌ مِن رَبِّكُم وَرَحْمَةٌ فَمَنِ اعْتَدى بَعدَ ذلِكَ فَلَهُ عَذَابٌ أَلِيمٌ",
        "ayah_en": "O you who believe, legal retribution has been prescribed for you regarding those killed: the free for the free, the slave for the slave, and the female for the female. But if the offender is pardoned by his brother in anything, then there should be a fair follow-up and payment with good conduct. This is a relief from your Lord and a mercy; and whoever transgresses after that will have a painful punishment.",
        "commentary_ar": "قال القرطبي : أي أن الحر إذا قتل الحر، فدم القاتل كفء لدم القتيل، والقصاص منه دون غيره من الناس، فلا تجاوزوا بالقتل إلى غيره ممن لم يقتل فإنه حرام عليكم أن تقتلوا بقتيلكم غير قاتله ) .",
        "commentary_en": "Al-Qurtubi explains that when a free person kills a free person, retribution is taken from the killer himself—his life is equal to the victim’s—so you are not allowed to exceed that and kill someone else who did not commit the murder. It is forbidden to kill anyone other than the actual killer in retaliation."
      }
    },
    {
      "qNum": 2,
      "question_ar": "يكثر في الناس أنهم إذا تخاصموا فإنهم يتعامون عن أوامر الله تعالى في التعامل مع الخصومة ، مبررين لأنفسهم بأنهم غاضبون وأن الطرف الآخر يستحق هذا التعامل، وكأنه ليس مطلوبا منهم أن يلتزموا أمر الله إذا كانوا متكدرين ! اذكر آية مخيفة جعل الله فيها هذا السلوك استهانة بأمره ونهيه، لتنتقل المسألة من تعامل بين خصمين إلى تعامل مع الله سبحانه.",
      "question_en": "It is common that when people dispute, they ignore Allah’s commands on how to handle conflict—justifying it by anger, as if Allah’s command does not apply when they are upset. Mention a frightening verse where Allah describes such behavior as taking His commands lightly, making it an issue between a person and Allah, not merely between two disputants.",
      "answer": {
        "surah": "البقرة",
        "ayah": "231",
        "ayah_ar": "وَإِذا طَلَّقْتُمُ النِّسَاءَ فَبَلَعْنَ أَجَلَهُنَّ فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ أَو سَرِّحُوهُنَّ بِمَعْرُوفٍ ولا تُمسِكُوهُنَّ ضِرارًا لِتَعتَدوا وَمَن يَفعَل ذلِكَ فَقَد ظَلَمَ نَفْسَهُ وَلَا تَتَّخِذُوا آيَاتِ اللَّهِ هُزُوًا وَاذْكُرُوا نِعْمَتَ اللَّهِ عَلَيْكُم وَمَا أَنزَلَ عَلَيْكُم مِنَ الكِتَابِ وَالْحِكْمَةِ يَعِظُكُم بِهِ وَاتَّقُوا اللَّهَ وَاعْلَمُوا أَنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ",
        "ayah_en": "When you divorce women and they have reached the end of their waiting period, then either keep them in an acceptable manner or release them in an acceptable manner. Do not keep them to harm them and transgress. Whoever does that has wronged himself. And do not take the verses of Allah as a mockery. Remember Allah’s favor upon you and what He has sent down to you of the Book and wisdom by which He admonishes you. And fear Allah, and know that Allah is Knowing of all things.",
        "commentary_ar": "قال القرطبي : ( وروي عن عائشة أن الرجل كان يطلق امرأته ثم يقول : والله لا أورتك ولا أدعك . قالت : وكيف ذاك ؟ قال : إذا كدت تقضين عدتك راجعتك ) ، فنزلت: وَلا تَتَّخِذُوا آيَاتِ اللَّهِ هُزُوًا. قال علماؤنا : والأقوال كلها داخلة في معنى الآية ؛ لأنه يقال لمن سخر من آيات الله : اتخذها هزوا . ويقال ذلك لمن كفر بها ، ويقال ذلك لمن طرحها ولم يأخذ بها وعمل بغيرها، فعلى هذا تدخل هذه الأقوال في الآية. و آيَاتِ اللَّهِ) هي دلائله وأمره ونهيه .",
        "commentary_en": "Al-Qurtubi reports from ‘A’ishah that a man would divorce his wife and then say: “By Allah, I will neither provide for you properly nor release you,” meaning he would keep taking her back whenever her waiting period was about to end—just to harm her. So Allah revealed: “Do not take the verses of Allah as a mockery.” The scholars said this includes mocking Allah’s verses, disbelieving in them, or discarding them and acting contrary to them—because Allah’s “verses” include His proofs, commands, and prohibitions."
      }
    },
    {
      "qNum": 3,
      "question_ar": "الأعياد في الإسلام مواسم شكر الله تعالى على الهداية والتوفيق للطاعات، وليس كما يريد المفسدون أن يجعلوها مواسم معصية وغفلة . اذكر جزءا من آية يدل على الجملة الأولى.",
      "question_en": "In Islam, ‘Eid seasons are occasions of thanking Allah for guidance and success in obedience—not seasons of sin and heedlessness. Mention part of a verse that indicates this first meaning.",
      "answer": {
        "surah": "البقرة",
        "ayah": "185",
        "ayah_ar": "شَهرُ رَمَضانَ الَّذى أُنزِلَ فِيهِ القُرآنُ هُدًى لِلنَّاسِ وَبَيِّنَاتٍ مِنَ الهُدى وَالْفُرْقَانِ فَمَن شَهِدَ مِنكُمُ الشَّهْرَ فَلْيَصُمهُ وَمَن كانَ مَرِيضًا أَو عَلَى سَفَرٍ فَعِدَّةٌ مِن أَيَّامٍ أُخَرَ يُرِيدُ اللهُ بِكُمُ اليُسرَ وَلا يُرِيدُ بِكُمُ العُسْرَ وَلِتُكْمِلُوا العِدَّةَ وَلِتُكَبِّرُوا اللَّهَ عَلَى ما هَدَاكُم وَلَعَلَّكُمْ تَشْكُرُونَ",
        "ayah_en": "The month of Ramadan is that in which the Qur’an was revealed as guidance for the people and clear proofs of guidance and the Criterion. So whoever witnesses the month should fast it; and whoever is ill or on a journey—then an equal number of other days. Allah intends ease for you and does not intend hardship for you, and [He intends] that you complete the period and that you glorify Allah for having guided you, and so that you may be grateful.",
        "commentary_ar": "فالله - عزّ وجلّ - شرع لنا أن نعظمه بذكره بعد الانتهاء من صيام شهر رمضان ، شكرًا له على ما أنعم علينا من الهداية في هذا الشهر، وأوضح لنا أن هذا التكبير هو السبيل إلى شكره (ولعلكم تشكرون) أي (كي تشكروني ) . فكان مجيء عيد الفطر مناسبة لشكر الله تعالى بإكثار التكبير حتى الوصول إلى مصلى العيد، كما هو الحال في عيد الأضحى المبارك الذي شرع الله فيه التكبير والتحميد والثناء عليه شكرًا له على توفيقه للطاعة والعمل الصالح كما قال تعالى (وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللهَ عَلَى مَا هَدَاكُمْ وَلَعَلَّكُمْ تَشْكُرُونَ).",
        "commentary_en": "Allah legislated that we glorify Him with remembrance after completing the fast of Ramadan, as gratitude for the guidance He granted in that month. He clarified that this takbīr is a path to gratitude: “so that you may be grateful,” meaning: so that you would thank Him. Thus ‘Eid al-Fitr becomes an occasion of thanking Allah by increasing takbīr until reaching the ‘Eid prayer—just as in ‘Eid al-Adha, where takbīr, praise, and glorification are legislated as gratitude for being enabled to obey Allah."
      }
    },
    {
      "qNum": 4,
      "question_ar": "راعي الإسلام الحاجات الفطرية للمرأة كما راعاها للرجل. والزواج من مقاصده تحقيق السكن والاستقرار النفسي - لكليهما، وليس كما يدعي مروجو النزعة النسوية التي تصف الإسلام بأنه دين ذكوري . اذكر جزءا من آية يوضح هذا المعنى.",
      "question_en": "Islam cares for the natural needs of women just as it cares for those of men. One aim of marriage is tranquility and emotional stability for both—contrary to claims that Islam is a ‘male-centered’ religion. Mention part of a verse that shows this meaning.",
      "answer": {
        "surah": "البقرة",
        "ayah": "187",
        "ayah_ar": "هُنَّ لِبَاسٌ لَكُمْ وَأَنْتُمْ لِبَاسٌ لَهُنَّ",
        "ayah_en": "They are a garment for you, and you are a garment for them.",
        "commentary_ar": "فأوضح الله تعالى أن الرجال لباس لزوجاتهم، كما أن زوجاتهم لباس لهم، واللباس هنا بمعنى السكن كما قال ابن عباس ومجاهد وغيرهما.",
        "commentary_en": "Allah clarified that husbands are a “garment” for their wives and wives are a “garment” for their husbands. Here, “garment” carries the meaning of closeness, protection, and tranquility—i.e., a source of comfort and settledness—as stated by Ibn ‘Abbas, Mujāhid, and others."
      }
    },
    {
      "qNum": 5,
      "question_ar": "إذا لم يهتم المسلمون بأمر الجهاد فإن ذلك مدعاة لدمارهم وضياع شأنهم. اذكر آية تبين هذا المعنى.",
      "question_en": "If Muslims neglect jihad, it becomes a cause of their ruin and the loss of their standing. Mention a verse that indicates this meaning.",
      "answer": {
        "surah": "البقرة",
        "ayah": "195",
        "ayah_ar": "وأنفقوا في سَبيلِ اللهِ وَلا تُلقوا بِأَيديكُم إِلَى التَّهْلُكَةِ وَأَحْسِنُوا إِنَّ اللَّهَ يُحِبُّ المحسنين",
        "ayah_en": "Spend in the way of Allah and do not throw yourselves into destruction with your own hands. And do good; indeed, Allah loves the doers of good.",
        "commentary_ar": "وَأَنفقوا في سبيل الله فكل خير فهو في سبيل الله ، ولكن من أوجه التفاسير في الآية هنا أن المقصود به هو الجهاد في سبيل الله ، وَلا تُلقوا بأيديكُم إِلَى التهلكة بتخلفكم عن الإنفاق في الجهاد . فعبر سبحانه عن أن ترك الإنفاق في سبيل الله مدعاة للهلاك . (مستفاد من تفسير ابن كثير)\nوفي سبب نزول الآية ، قال أبو أيوب الأنصاري : نزلت فينا معشر الأنصار وذلك أن الله تعالى لما أعز دينه ونصر رسوله ، قلنا فيما بيننا إنا قد تركنا أهلنا وأموالنا حتى فشا الإسلام ونصر الله نبيه فلو رجعنا إلى أهلينا وأموالنا فأقمنا فيها فأصلحنا ما ضاع منها فأنزل الله تعالى : (وَأَنفِقُوا فِي سَبِيلِ اللَّهِ وَلا تُلقوا بِأَيديكُم إِلَى التَّهْلُكَةِ).\nفالتهلكة الإقامة في الأهل والمال وترك الجهاد، فما زال أبو أيوب يجاهد في سبيل الله حتى كان آخر غزوة غزاها بقسطنطينية في زمن معاوية - رضي الله عنهما - ، فتوفي هناك ودفن في أصل سور القسطنطينية. والحديث صححه الألباني وغيره.",
        "commentary_en": "“Spend in the way of Allah” includes every good cause, but one interpretation here is that it refers specifically to spending for jihad. “Do not throw yourselves into destruction” is explained as: do not abandon spending for jihad, because that leads to ruin. This is mentioned in explanations such as Ibn Kathir.\nAbu Ayyub al-Ansari said the verse was revealed about the Ansar: after Allah strengthened Islam, they considered returning to their families and wealth to repair what they had lost—so Allah revealed this warning. Destruction, then, is staying with one’s wealth and family while abandoning jihad. Abu Ayyub continued striving until he died on a campaign near Constantinople."
      }
    },
    {
      "qNum": 6,
      "question_ar": "عندما يهون حق الله على الناس، فقد تجدهم يتعاطفون مع من يَصُدُّ عن سبيل الله ويُضلّل الناس في دينهم كبعض دعاة الإلحاد، بحجة أن هذا الملحد \"إنساني\" لم يزهق روحاً، بل وربما دعم بعض قضايا المسلمين . وقد تجد من يقول : ( هذا الملحد لم يقتل نملة ) . اذكر أربع كلمات من آية تبين أن جرمه أشد من جرم إزهاق الأرواح .",
      "question_en": "When Allah’s right becomes insignificant to people, they may sympathize with those who block others from Allah’s path and mislead them—such as some promoters of atheism—claiming they are ‘humane’ because they have not taken a life, and might even support some Muslim causes. Mention four words from a verse showing that such wrongdoing can be worse than killing.",
      "answer": {
        "surah": "البقرة",
        "ayah": "191",
        "ayah_ar": "﴿وَاقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ وَأَخْرِجُوهُم مِّنْ حَيْثُ أَخْرَجُوكُمْ وَالْفِتْنَةُ أَشَدُّ مِنَ الْقَتْلِ وَلَا تُقَاتِلُوهُمْ عِندَ الْمَسْجِدِ الْحَرَامِ حَتَّى يُقَاتِلُوكُمْ فِيهِ فَإِن قَاتَلُوكُمْ فَاقْتُلُوهُمْ كَذَلِكَ جَزَاءُ الْكَافِرِينَ﴾",
        "ayah_en": "Fight them wherever you encounter them and drive them out from where they drove you out. And fitnah is more severe than killing. And do not fight them at al-Masjid al-Haram unless they fight you there; but if they fight you, then fight them—such is the recompense of the disbelievers.",
        "commentary_ar": "قال القرطبي : قوله تعالى : ﴿وَالْفِتْنَةُ أَشَدُّ مِنَ الْقَتْل) ، أي: الفتنة التي حملوكم عليها وراموا رجوعكم بها إلى الكفر أشد من القتل.\nوقال مجاهد : أي من أن يقتل المؤمن، فالقتل أخف عليه من الفتنة ).",
        "commentary_en": "Al-Qurtubi explains: “Fitnah is more severe than killing” meaning the fitnah they tried to impose—pressuring you toward disbelief—is worse than killing. Mujahid said: it is worse than killing a believer; being killed is lighter upon him than being forced into disbelief."
      }
    },
    {
      "qNum": 7,
      "question_ar": "الاستثناء المنقطع يكون فيه المستثنى من غير جنس المستثنى منه ، أو يكون بمعنى ( ولكن ) . اذكر آية يؤدي عدم إدراك أن الاستثناء فيها منقطع إلى خلل في فهم حدود العلاقة بين الجنسين.",
      "question_en": "A disconnected exception (الاستثناء المنقطع) is when what comes after “except” is not of the same kind as what came before it, or it carries the meaning of “but rather.” Mention a verse where failing to recognize that the exception is disconnected leads to misunderstanding the boundaries of interaction between men and women.",
      "answer": {
        "surah": "البقرة",
        "ayah": "235",
        "ayah_ar": "وَلا جُناحَ عَلَيْكُم فيما عَرَّضْتُم بِهِ مِن خِطْبَةِ النِّسَاءِ أَو أَكَنَنتُم فِي أَنفُسِكُم عَلِمَ اللَّهُ أَنَّكُم سَتَذْكُرُونَهُنَّ وَلكِن لا تُواعِدُوهُنَّ سِرًّا إِلَّا أَن تَقُولُوا قَولًا مَعْرُوفًا ولا تعزموا عُقدَةَ النِّكَاحِ حَتَّى يَبْلُغَ الكِتابُ أَجَلَهُ وَاعْلَمُوا أَنَّ اللَّهَ يَعْلَمُ ما في أَنفُسِكُم فَاحْذَرُوهُ وَاعْلَمُوا أَنَّ اللَّهَ غَفُورٌ حَلِيمٌ",
        "ayah_en": "There is no blame upon you for hinting at a proposal to women or keeping it within yourselves. Allah knows that you will mention them, but do not make secret promises with them—except that you speak an acceptable word. And do not resolve the marriage contract until the prescribed term is reached. Know that Allah knows what is within yourselves, so beware of Him; and know that Allah is Forgiving and Forbearing.",
        "commentary_ar": "قال القرطبي : قوله - تعالى -: ﴿إِلَّا أَنْ تَقُولُوا قَوْلًا مَعْرُوفاً استثناء منقطع بمعنى لَكِنْ ) . يعني لا تواعدوهن سرًا، لكن لكم أن تقولوا لهن قولا معروفا، وهو التعريض بالخطبة دون تصريح . وليس المقصود إباحة المواعدة سرا من أجل هذا القول المعروف.\nوللتفريق بين الاستثناء المتصل والاستثناء المنقطع ، فإن المستثنى إذا كان من جنس المستثنى منه فإن أهل العلم يسمونه متصلا ، وإذا كان من غير جنسه فإنه يسمى منقطعًا ، كما إذا قيل : قام القوم إلا زيدًا ، فهذا متصل ؛ لأن زيد (المستثنى ) من جنس المستثنى منه وهو القوم، لكن إذا قيل : قام القوم إلا أسدًا ، فهذا يسمونه منقطعا ؛ لأن الأسد ليس من جنس القوم المستثنى منه ) .",
        "commentary_en": "Al-Qurtubi explains that “except that you speak an acceptable word” is a disconnected exception meaning “but rather.” The meaning is: do not make secret promises with them—rather, you may speak an appropriate, respectful statement, such as indirect hints of proposal without explicit promises. It does not mean secret promises become permissible.\nScholars distinguish connected and disconnected exceptions: if what is excluded is from the same category as what preceded it, it is connected; if not, it is disconnected."
      }
    },
    {
      "qNum": 8,
      "question_ar": "يدرك المؤمن أن الصبر في الشدائد والمواقف الصعبة لا ينبع من ثنايا نفسه الضعيفة، لذلك فهو يستمده دوما من الله تعالى .",
      "question_en": "A believer realizes that patience during hardship and difficult situations does not come from within his weak self; rather, he continually seeks it from Allah.",
      "answer": {
        "surah": "البقرة",
        "ayah": "250",
        "ayah_ar": "وَلَمَّا بَرَزُوا لِجَالُوتَ وَجُنُودِهِ، قَالُوا رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
        "ayah_en": "When they went forth against Jalut and his soldiers, they said: Our Lord, pour upon us patience, make our feet firm, and grant us victory over the disbelieving people.",
        "commentary_ar": "",
        "commentary_en": ""
      }
    },
    {
      "qNum": 9,
      "question_ar": "أصحاب الهوى لا يسكتهم البرهان والدليل، بل يستمرون في الجدل والعناد وليس على المؤمن في هذه الحالة أن يجادلهم. اذكر آية فيها استثناء منقطع يحمل هذا المعنى ( ملاحظة : الاستثناء المنقطع هو حين يكون ما بعد حرف \"إلا\" (المستثنى ) من غير جنس ما قبله (المستثنى منه )) .",
      "question_en": "People who follow desires are not silenced by proof; they continue arguing and stubbornly resisting. In that case, a believer is not required to keep debating them. Mention a verse with a disconnected exception that carries this meaning.",
      "answer": {
        "surah": "البقرة",
        "ayah": "150",
        "ayah_ar": "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ وَحَيْثُ مَا كُنتُمْ فَوَلُّوا وُجُوهَكُمْ شَطْرَهُ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَيْكُمْ حُجَّةٌ إِلَّا الَّذِينَ ظَلَمُوا مِنْهُمْ فَلَا تَخْشَوْهُمْ وَاخْشَوْنِي وَلِأُتِمَّ نِعْمَتِي عَلَيْكُمْ وَلَعَلَّكُمْ تَهْتَدُونَ",
        "ayah_en": "From wherever you go out, turn your face toward al-Masjid al-Haram; and wherever you are, turn your faces toward it, so that people will have no argument against you—except those among them who do wrong. So do not fear them, but fear Me; and so that I may complete My favor upon you, and that you may be guided.",
        "commentary_ar": "قال السعدي (بتصرف ) : ( ﴿إِلَّا الَّذِينَ ظَلَمُوا مِنْهُمْ﴾ أي: من احتج منهم بحجة هو ظالم فيها وليس لها مستند إلا اتباع الهوى والظلم فهذا لا سبيل إلى إقناعه والاحتجاج عليه، وكذلك لا معنى لجعل الشبهة التي يوردونها على سبيل الاحتجاج شيئاً يُؤْبَه له ، ولا يلقى له بال. فلهذا قال تعالى : (فَلَا تَخْشَوْهُمْ) لأن حجتهم باطلة ، والباطل - كاسمه . مخذول ، مخذول صاحبه . وهذا بخلاف صاحب الحق ، فإن للحق صولة وعزاً يوجب خشية صاحب الحق .",
        "commentary_en": "As-Sa‘di explains (paraphrased): “Except those who do wrong among them” refers to people who argue with claims that are unjust and have no real basis—only following desires and wrongdoing. There is no benefit in trying to satisfy such objections; they are not worth giving weight to. Hence Allah says: “So do not fear them,” because their argument is false, and falsehood is ultimately defeated along with its followers. This differs from the people of truth, whose truth has strength and dignity."
      }
    },
    {
      "qNum": 10,
      "question_ar": "اذكر كلمة من هذا الجزء تبين أن أثر الدين يظهر على صاحبه .",
      "question_en": "Mention one word in this Juz that shows the effect of religion appears upon a person.",
      "answer": {
        "surah": "البقرة",
        "ayah": "138",
        "ayah_ar": "صِبْغَةَ اللهِ وَمَنْ أَحْسَنُ مِنَ اللهِ صِبْغَةً وَنَحْنُ لَهُ عَابِدُونَ",
        "ayah_en": "The dye of Allah—and who is better than Allah in dye? And we are worshippers devoted to Him.",
        "commentary_ar": "قال البغوي : (قوله تعالى : ( صِبْغَةَ اللهِ ) قال ابن عباس في رواية الكلبي وقتادة والحسن : \"دين الله \" ، وإنما سماه صبغة لأنه يظهر أثر الدين على المتدين كما يظهر أثر الصبغ على الثوب ).",
        "commentary_en": "Al-Baghawi explains that Ibn ‘Abbas (in a narration), Qatadah, and al-Hasan said “the dye of Allah” means Allah’s religion. It is called “dye” because the effect of religion shows upon the religious person just as dye shows upon a garment."
      }
    },
    {
      "qNum": 11,
      "question_ar": "على المسلم أن يؤدي الأشياء من أيسر وجه ولا يكلف نفسه مشقة لم يشرعها الله له . اذكر آية تدل على ذلك.",
      "question_en": "A Muslim should do things through the easiest valid way and not burden himself with hardship Allah did not legislate. Mention a verse that indicates this.",
      "answer": {
        "surah": "البقرة",
        "ayah": "189",
        "ayah_ar": "يَسْأَلُونَكَ عَنِ الْأَهِلَّةِ قُلْ هِيَ مَوَاقِيتُ لِلنَّاسِ وَالْحَقِّ وَلَيْسَ الْبِرُّ بِأَن تَأْتُوا الْبُيُوتَ مِن ظُهُورِهَا وَلَكِنَّ الْبِرَّ مَنِ اتَّقَى وَأْتُوا الْبُيُوتَ مِنْ أَبْوَابِهَا وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ",
        "ayah_en": "They ask you about the new moons. Say: They are timings for people and for the pilgrimage. And righteousness is not that you enter houses from their backs, but righteousness is in one who fears Allah. So enter houses from their doors, and fear Allah so that you may succeed.",
        "commentary_ar": "قال السعدي : (وَلَيْسَ الْبِرُّ بِأَنْ تَأْتُوا الْبُيُوتَ مِنْ ظُهُورِهَا) وهذا كما كان الأنصار وغيرهم من العرب، إذا أحرموا ، لم يدخلوا البيوت من أبوابها ، تعبدا بذلك، وظنا أنه بر. فأخبر الله أنه ليس ببر لأن الله تعالى لم يشرعه لهم ... ويستفاد من إشارة الآية أنه ينبغي في كل أمر من الأمور، أن يأتيه الإنسان من الطريق السهل القريب، الذي قد جعل له موصلاً. فالأمر بالمعروف والناهي عن المنكر ينبغي أن ينظر في حالة المأمور، ويستعمل معه الرفق والسياسة، التي بها يحصل المقصود أو بعضه ، والمتعلم والمعلم ينبغي أن يسلك أقرب طريق وأسهله ، يحصل به مقصوده ) . اهـ\nوقد روى البخاري ومسلم عن أمنا عائشة : ( ما خُيَّرَ رَسُولُ اللَّهِ ﷺ بَيْنَ أَمْرَيْنِ إِلَّا أَخَذَ أَيْسَرَهُمَا ، مَا لَمْ يَكُنْ إِثْماً).",
        "commentary_en": "As-Sa‘di explains that the Arabs—like the Ansar—would avoid entering houses from their doors when in ihram, thinking it was righteousness. Allah clarified it is not righteousness because He did not legislate it. From this, one learns a general principle: in all matters, a person should take the easy and direct path Allah has made a means to the goal. Those who command good and forbid evil should consider people’s circumstances and use gentleness and wise approach to reach the objective. Likewise, students and teachers should take the closest and easiest sound path to achieve their aim.\nAlso, it is authentically reported that the Prophet ﷺ, when given a choice between two matters, would choose the easier one as long as it was not sinful."
      }
    },
    {
      "qNum": 12,
      "question_ar": "حاجة الإنسان إلى مخافة الله أعظم من حاجته للمأكل والمشرب . اذكر أربع كلمات فيها هذا المعنى .",
      "question_en": "A person’s need to fear Allah is greater than his need for food and drink. Mention four words that carry this meaning.",
      "answer": {
        "surah": "البقرة",
        "ayah": "197",
        "ayah_ar": "الْحَجُّ أَشْهُرُ مَّعْلُومَاتٌ فَمَن فَرَضَ فِيهِنَّ الْحَجَّ فَلَا رَفَثَ وَلَا فُسُوقَ وَلَا جِدَالَ فِي الْحَجِّ وَمَا تَفْعَلُوا مِنْ خَيْرٍ يَعْلَمْهُ اللَّهُ وَتَزَوَّدُوا فَإِنَّ خَيْرَ الزَّادِ التَّقْوَىٰ وَاتَّقُونِ يَا أُولِي الْأَلْبَابِ",
        "ayah_en": "Hajj is [during] well-known months, so whoever undertakes Hajj therein—then there is no sexual talk, no disobedience, and no arguing during Hajj. Whatever good you do, Allah knows it. And take provisions—but indeed the best provision is mindfulness of Allah. So fear Me, O people of understanding.",
        "commentary_ar": "عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عنهما قال : كانَ أَهْلُ اليَمَنِ يَحُجُّونَ وَلَا يَتَزَوَّدُونَ، ويقولُونَ : نَحْنُ المُتَوَكِّلُونَ، فَإِذَا قَدِمُوا مَكَّةَ سَأَلُوا النَّاسَ (أي : طلبوا منهم ما يعتاشون به ) ، فَأَنْزَلَ اللَّهُ تَعَالَى : (وَتَزَوَّدُوا فَإِنَّ خَيْرَ الزَّادِ التَّقْوَى) رواه البخاري.\nوهذا كَمَا قَالَ تعالى : (يَا بَنِي آدَمَ قَدْ أَنزَلْنَا عَلَيْكُمْ لِبَاسًا يُوَارِي سَوْآتِكُمْ وَرِيشًا وَلِبَاسُ التَّقْوَى ذَلِكَ خَيْرٌ ذَلِكَ مِنْ آيَاتِ اللَّهِ لَعَلَّهُمْ يَذَّكَّرُونَ) [الأعراف : 26].\nجاء في تفسير ابن كثير: ( لَمَّا ذَكَرَ اللَّبَاسَ الْحِسيَّ نَبِّهِ مُرْشِداً إِلَى اللَّبَاسِ الْمَعْنَوِيِّ ، وَهُوَ الْخُشُوعُ ، وَالطَّاعَةُ وَالتَّقْوَى، وَذَكَرَ أَنَّهُ خَيْرُ مِنْ هَذَا، وَأَنْفَعُ ).",
        "commentary_en": "Ibn ‘Abbas reported that the people of Yemen would go for Hajj without provisions, saying: “We rely on Allah.” When they arrived in Makkah, they would ask people for sustenance, so Allah revealed: “And take provisions, for indeed the best provision is taqwa.” (Bukhari).\nThis aligns with Allah’s statement: “...and the garment of taqwa—that is best” (Al-A‘raf: 26). Ibn Kathir explains that after mentioning physical clothing, Allah directs to the greater, inner ‘clothing’: humility, obedience, and taqwa—showing it is better and more beneficial."
      }
    },
    {
      "qNum": 13,
      "question_ar": "من أساليب أهل الباطل .. تصيد بعض أخطاء المؤمنين وتضخيمها وتسليط أضواء الإعلام عليها، وفي هذه الحالة يجب على أصحاب الحق أولاً الاعتراف بالخطأ وعدم تبريره ومن ثم رد الضربة لأهل الباطل، ومقارنة جرائمهم النكراء بهذا الخطأ ليتبين حجم إجرامهم وعدم إنصافهم في تصيد أخطاء المؤمنين . اذكر آية ورد فيها توجيه بهذا التصرف.",
      "question_en": "One tactic of falsehood is to hunt for believers’ mistakes, exaggerate them, and spotlight them. In such a case, people of truth should first admit the mistake and not justify it, then respond by exposing the criminals’ far greater wrongs so their injustice becomes clear. Mention a verse that guides this approach.",
      "answer": {
        "surah": "البقرة",
        "ayah": "217",
        "ayah_ar": "يَسْأَلُونَكَ عَنِ الشَّهْرِ الْحَرَامِ قِتَالٍ فِيهِ قُلْ قِتَالُ فِيهِ كَبِيرٌ وَصَدُّ عَن سَبِيلِ اللَّهِ وَكُفْرُ بِهِ وَالْمَسْجِدِ الْحَرَامِ وَإِخْرَاجُ أَهْلِهِ مِنْهُ أَكْبَرُ عِندَ اللَّهِ وَالْفِتْنَةُ أَكْبَرُ مِنَ الْقَتْلِ",
        "ayah_en": "They ask you about fighting in the sacred month. Say: Fighting in it is a great sin; but blocking people from the path of Allah, disbelief in Him, and preventing access to al-Masjid al-Haram, and expelling its people from it—these are greater in Allah’s sight. And fitnah is greater than killing.",
        "commentary_ar": "الآية متعلقة بحادثة قتل سرية من الصحابة لأحد المشركين، وتبين أن القتل كان في الأشهر الحرم ، فأشاعت قريش بين العرب أن محمداً يستحل الأشهر الحرم، وأخذوا يوجهون له الأسئلة تعريضا بالأمر حول حكم القتال في الأشهر الحرم، فنزلت الآية لتوجه النبي ﷺ لكيفية التصرف وهي :\nأولاً الاعتراف بالخطأ (قُلْ قِتَالُ فِيهِ كَبِيرٌ) ، ومن ثم عدم الانسياق وراء التبرير والدفاع والوقوف في موقف ضعف . بل رد الضربة لأهل الباطل، ومقارنة هذا الخطأ بجرائمهم النكراء ليتبين حجم إجرامهم وعدم إنصافهم في تصيد أخطاء المؤمنين (وَصَدُّ عَن سَبِيلِ اللَّهِ وَكُفْرُ بِهِ وَالْمَسْجِدِ الْحَرَامِ وَإِخْرَاجُ أَهْلِهِ مِنْهُ أَكْبَرُ عِندَ اللَّهِ وَالْفِتْنَةُ أَكْبَرُ مِنَ الْقَتْلِ).",
        "commentary_en": "The verse relates to an incident where a Muslim expedition killed a polytheist during the sacred months. Quraysh spread the claim that Muhammad ﷺ was violating the sacred months, and they questioned him to embarrass him. The verse teaches the correct response: first, acknowledge the wrongdoing without excuses—“Fighting in it is a great sin”—then do not remain on the defensive; instead, expose how their crimes are far greater, such as blocking Allah’s path, disbelief, preventing the Sacred Mosque, expelling its people, and spreading fitnah—matters greater in Allah’s sight."
      }
    },
    {
      "qNum": 14,
      "question_ar": "قال تعالى : (كَذَلِكَ مَا أَتَى الَّذِينَ مِن قَبْلِهِم مِّن رَّسُولٍ إِلَّا قَالُوا سَاحِرُ أَوْ مَجْنُونٌ ) أَتَوَاصَوْا بِهِ بَلْ هُمْ قَوْمٌ طَاغُونَ) [الذاريات 52 - 53 ] فأهل الباطل لما طغوا واتبعوا الباطل فإنهم يقولون نفس الأقوال وكأنهم أوصى بعضهم بعضاً بذلك . اذكر جزءا من آية يفيد نفس المعنى.",
      "question_en": "Allah says that previous deniers spoke the same accusations against messengers—as if they advised one another—because they were a transgressing people. Mention part of a verse from this Juz that conveys the same meaning.",
      "answer": {
        "surah": "البقرة",
        "ayah": "118",
        "ayah_ar": "﴿ وَقَالَ الَّذِينَ لَا يَعْلَمُونَ لَوْلَا يُكَلِّمُنَا اللَّهُ أَوْ تَأْتِينَا آيَةٌ كَذَلِكَ قَالَ الَّذِينَ مِن قَبْلِهِم مِّثْلَ قَوْلِهِمْ تَشَابَهَتْ قُلُوبُهُمْ قَدْ بَيَّنَا الْآيَاتِ لِقَوْمٍ يُوقِنُونَ)",
        "ayah_en": "Those who do not know said: Why does Allah not speak to us, or why does a sign not come to us? So said those before them the same as their statement. Their hearts resemble one another. We have made the signs clear for a people who are certain.",
        "commentary_ar": "قال ابن كثير: وقوله : (تَشَابَهَتْ قُلُوبُهُمْ ) أي : أشبهت قلوب مشركي العرب قلوب من تقدمهم في الكفر والعناد والعتو.\nوقال السعدي: (تشابهت قلوبهم وأعمالهم بالكفر والطغيان، فتشابهت أقوالهم الناشئة عن طغيانهم).",
        "commentary_en": "Ibn Kathir explains: “Their hearts resemble one another” means the hearts of the Arab polytheists resembled those before them in disbelief, stubbornness, and arrogance. As-Sa‘di adds that since their hearts and deeds resemble one another in disbelief and transgression, their statements likewise resemble one another and arise from the same arrogance."
      }
    },
    {
      "qNum": 15,
      "question_ar": "اذكر ثلاث كلمات من آية تخاطب بها من تراه يكثر من الحركة في صلاته لتفهمه أنه بذلك يخالف أمر الله .",
      "question_en": "Mention three words from a verse you can use to address someone who moves excessively during prayer, making them realize they are opposing Allah’s command.",
      "answer": {
        "surah": "البقرة",
        "ayah": "238",
        "ayah_ar": "﴿حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَى وَقُومُوا لِلَّهِ قَانِتِينَ ﴾",
        "ayah_en": "Guard strictly the prayers—especially the middle prayer—and stand before Allah in devout obedience.",
        "commentary_ar": "عن زيد بن أرقم قال : كنا نتكلم في الصلاة يكلم أحدنا أخاه في حاجته حتى نزلت هذه الآية (حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَى وَقُومُوا لِلَّهِ قَانِتِينَ) فَأُمِرِنَا بالسكوت . (صحيح البخاري).",
        "commentary_en": "Zayd ibn Arqam said: We used to speak during prayer, each of us speaking to his brother about his needs, until this verse was revealed: “...and stand before Allah in devout obedience,” so we were commanded to remain silent. (Sahih al-Bukhari)."
      }
    },
    {
      "qNum": 16,
      "question_ar": "اذكر 4 كلمات من آية تبين أنه لا يستحيل عقلا أن يكلف الله الناس بالأمور الشاقة لكنه ترك ذلك رحمةً منه سبحانه.",
      "question_en": "Mention four words from a verse showing that it is not impossible for Allah to impose hardship upon people, but He did not do so out of mercy.",
      "answer": {
        "surah": "البقرة",
        "ayah": "220",
        "ayah_ar": "وَيَسْأَلُونَكَ عَنِ الْيَتَامَى قُلْ إِصْلَاحُ لَهُمْ خَيْرٌ وَإِن تُخَالِطُوهُمْ فَإِخْوَانُكُمْ وَاللَّهُ يَعْلَمُ الْمُفْسِدَ مِنَ الْمُصْلِحِ وَلَوْ شَاءَ اللهُ لَأَعْنَتَكُمْ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ",
        "ayah_en": "They ask you about orphans. Say: Improving their condition is best. And if you mix with them, they are your brothers. Allah knows the corrupter from the reformer. And if Allah had willed, He could have put you in hardship. Indeed Allah is Mighty and Wise.",
        "commentary_ar": "وسبب نزولها أنه لما نزلت (إِنَّ الَّذِينَ يَأْكُلُونَ أَمْوَالَ الْيَتَامَى ظُلْمًا إِنَّمَا يَأْكُلُونَ فِي بُطُونِهِمْ نَارًا وَسَيَصْلَوْنَ سَعِيرًا) [النساء : 10 ] انطلق من كان عنده يتيم فعزل طعامه من طعامه وشرابه من شرابه ، بحيث إذا تبقى من طعام اليتيم شيء لم يقربه الصحابي خوفاً من أن يكون بذلك يأكل مال اليتيم، فيترك الطعام حتى يأكله اليتيم أو يفسد الطعام. واشتد عليهم ما اتخذوه من إجراءات.\nفذكروا ذلك لرسول الله ، فأنزل الله : (وَيَسْأَلُونَكَ عَنِ الْيَتَامَى قُلْ إِصْلَاحُ لَّهُمْ خَيْرٌ وَإِن تُخَالِطُوهُمْ فَإِخْوَانُكُمْ) أي : وإن خلطتم طعامكم بطعامهم وشرابكم بشرابهم، فلا بأس عليكم ; لأنهم إخوانكم في الدين.\nوقوله : (وَلَوْ شَاءَ اللهُ لَأَعْنَتَكُمْ) أي : ولو شاء لضيق عليكم وأحرجكم ولكنه وسع عليكم، وخفف عنكم، وأباح لكم مخالطتهم بالتي هي أحسن . ( من تفسير الطبري باختصار وتصرف ).\nفلا يمتنع أن يكلف الله الناس بما فيه مشقة . وقد وقع بالفعل أن كلف الله عباده بما تظهر منه مشقة ثم رفعه رحمهة بهم، حيث كلفهم بتقديم صدقة بين يدي نجواهم للرسول : (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نَاجَيْتُمُ الرَّسُولَ فَقَدِمُوا بَيْنَ يَدَى نَجْوَاكُمْ صَدَقَةً) [المجادلة : 12 ] ، وكلفهم بمصابرة العدو: (وَإِن يَكُن مِّنكُم مِائَةً يَغْلِبُوا أَلْفًا مِنَ الَّذِينَ كَفَرُوا) [الأنفال : 65]، لكنه سبحانه رفع هذه التكاليف في الآيات التي بعدها رحمةً منه وفضلاً.",
        "commentary_en": "The cause behind this verse is that when the warning verse about consuming orphans’ wealth unjustly was revealed (An-Nisa’: 10), those who had orphans under their care began separating the orphan’s food and drink completely. If anything remained from the orphan’s meal, the guardian would avoid it out of fear of wrongdoing—so food would sometimes be left until the orphan ate it or it spoiled. This became very difficult for them.\nThey mentioned this to the Messenger ﷺ, so Allah revealed: “They ask you about orphans… improving their condition is best. And if you mix with them, they are your brothers…” meaning mixing food and drink is permitted when done with sincere care. Allah knows the corrupter from the reformer.\n“And if Allah had willed, He could have put you in hardship” means Allah could have tightened matters upon you, but He expanded and eased them. It is not impossible that Allah imposes difficult duties, and in fact some were imposed then lifted as mercy—such as the command to give charity before private consultation (Al-Mujadilah: 12) and the initial command regarding facing the enemy (Al-Anfal: 65), which were later lightened."
      }
    },
    {
      "qNum": 17,
      "question_ar": "يدرك المؤمنون أن الصبر لا ينبع من حنايا النفس بل ينزل من عند الله تعالى . اذكر أربع كلمات تدل على هذا المعنى.",
      "question_en": "Believers realize that patience does not come from within the self, but is granted from Allah. Mention four words that indicate this meaning.",
      "answer": {
        "surah": "البقرة",
        "ayah": "250",
        "ayah_ar": "﴿وَلَمَّا بَرَزُوا لِجَالُوتَ وَجُنُودِهِ قَالُوا رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ)",
        "ayah_en": "When they went forth against Jalut and his soldiers, they said: Our Lord, pour upon us patience, make our feet firm, and grant us victory over the disbelieving people.",
        "commentary_ar": "",
        "commentary_en": ""
      }
    }
  ]
}