{
  "juz": 22,
  "items": [
    {
      "qNum": 1,
      "question_ar": "يجب على المسلمين الحفاظ على الدعوة والتذكير الدائم بالله وشرعه لإيقاظ الناس من غفلتهم، فكل أمة ينقطع عنها الإنذار لا بد وأن تقع في عتمة الضلال . اذكر آية تدل على ذلك.",
      "question_en": "Muslims must maintain da‘wah and continual reminders of Allah and His law to awaken people from heedlessness; any nation cut off from warning will inevitably fall into darkness of misguidance. Mention a verse indicating this.",
      "answer": {
        "surah": 36,
        "ayahs": [
          6
        ],
        "ayah_ar": "﴿لِتُنذِرَ قَوْمًا مَا أُنذِرَ آبَاؤُهُمْ فَهُمْ غَافِلُونَ﴾ [يس: 6]",
        "ayah_en": "“So that you may warn a people whose forefathers were not warned, so they are heedless.” (Yā-Sīn 36:6)",
        "commentary_ar": "دلّت الآية على أن انقطاع الإنذار يورث الغفلة رسوخًا وثباتًا، فتتراكم الضلالات جيلاً بعد جيل.",
        "commentary_en": "The verse shows that when warning is absent, heedlessness becomes a settled trait, and misguidance accumulates generation after generation."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 2,
      "question_ar": "اذكر آية تدلل على وظيفة هامة لزوجات النبي صلى الله عليه وسلم.",
      "question_en": "Mention a verse that indicates an important duty of the Prophet’s wives (peace be upon him).",
      "answer": {
        "surah": 33,
        "ayahs": [
          34
        ],
        "ayah_ar": "﴿وَاذْكُرْنَ مَا يُتْلَىٰ فِي بُيُوتِكُنَّ مِنْ آيَاتِ اللَّهِ وَالْحِكْمَةِ ۚ إِنَّ اللَّهَ كَانَ لَطِيفًا خَبِيرًا﴾ [الأحزاب: 34]",
        "ayah_en": "“And remember what is recited in your homes of the verses of Allah and wisdom. Indeed Allah is Subtle, All-Aware.” (Al-Aḥzāb 33:34)",
        "commentary_ar": "فيها تذكيرٌ لزوجات النبي ﷺ بحفظ ما يُتلى في بيوتهن ونقله، فهنّ في موضع تعليمٍ وتبليغٍ لما سمعن وشاهدن.",
        "commentary_en": "It reminds the Prophet’s wives to preserve and convey what is recited in their homes—placing them in a role of teaching and transmitting what they heard and witnessed."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 3,
      "question_ar": "اذكر آية تدلل على صدق رسول الله صلى الله عليه وسلم في أنه أتى بالقرآن وحياً من الله ، إذ يظهر فيها عتاب للنبي صلى الله عليه وسلم مما يؤكد أن القرآن الكريم هو خطاب رب العبد.",
      "question_en": "Mention a verse that demonstrates the Prophet’s truthfulness that the Qur’an is revelation from Allah—because it contains a reproach directed to the Prophet (peace be upon him), confirming it is the speech of the Lord to His servant.",
      "answer": {
        "surah": 33,
        "ayahs": [
          37
        ],
        "ayah_ar": "﴿وَإِذْ تَقُولُ لِلَّذِي أَنْعَمَ اللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ أَمْسِكْ عَلَيْكَ زَوْجَكَ وَاتَّقِ اللَّهَ وَتُخْفِي فِي نَفْسِكَ مَا اللَّهُ مُبْدِيهِ وَتَخْشَى النَّاسَ وَاللَّهُ أَحَقُّ أَنْ تَخْشَاهُ ۚ فَلَمَّا قَضَى زَيْدٌ مِنْهَا وَطَرًا زَوَّجْنَاكَهَا لِكَيْ لَا يَكُونَ عَلَى الْمُؤْمِنِينَ حَرَجٌ فِي أَزْوَاجِ أَدْعِيَائِهِمْ إِذَا قَضَوْا مِنْهُنَّ وَطَرًا ۚ وَكَانَ أَمْرُ اللَّهِ مَفْعُولًا﴾ [الأحزاب: 37]",
        "ayah_en": "“And [remember] when you said to the one whom Allah had favored and you had favored, ‘Keep your wife and fear Allah,’ while you concealed within yourself what Allah was to disclose, and you feared the people, whereas Allah has more right that you fear Him. Then when Zayd had no longer any need for her, We married her to you, so that there would be no blame upon the believers concerning the wives of their adopted sons when they have no longer any need of them. And Allah’s command is ever carried out.” (Al-Aḥzāb 33:37)",
        "commentary_ar": "اشتمال الآية على العتاب والبيان لما أُخفي في النفس دليلٌ على أن القرآن وحيٌ من الله لا كلامُ بشرٍ يتصرف به النبي ﷺ.",
        "commentary_en": "The verse’s reproach and disclosure of what was concealed is a clear sign it is revelation from Allah—not human speech that the Prophet could craft or manipulate."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 4,
      "question_ar": "يظن البعض أن توسيع رزقه في الدنيا هو دليل على رضا الله تعالى عنه وقربه منه . وقد نفى القرآن الكريم مرارا صحة هذا الظن، وبين أن توسيع الرزق في الدنيا ليس دليلا على رضا الله ، اذكر آية تدل على ذلك.",
      "question_en": "Some think expanded worldly provision proves Allah’s pleasure and closeness; the Qur’an repeatedly negates this and shows worldly expansion is not proof of Allah’s approval. Mention a verse indicating that.",
      "answer": {
        "surah": 34,
        "ayahs": [
          37
        ],
        "ayah_ar": "﴿وَمَا أَمْوَالُكُمْ وَلَا أَوْلَادُكُمْ بِالَّتِي تُقَرِّبُكُمْ عِنْدَنَا زُلْفَىٰ إِلَّا مَنْ آمَنَ وَعَمِلَ صَالِحًا فَأُولَٰئِكَ لَهُمْ جَزَاءُ الضِّعْفِ بِمَا عَمِلُوا وَهُمْ فِي الْغُرُفَاتِ آمِنُونَ﴾ [سبأ: 37]",
        "ayah_en": "“And it is not your wealth or your children that bring you nearer to Us in closeness, but whoever believes and does righteousness—those will have a multiplied reward for what they did, and they will be secure in lofty chambers.” (Saba’ 34:37)",
        "commentary_ar": "صرّحت الآية بأن المال والولد ليسا معيار القرب من الله، وإنما القرب بالإيمان والعمل الصالح.",
        "commentary_en": "The verse explicitly states that wealth and children are not the measure of nearness to Allah; rather, nearness is by faith and righteous deeds."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 5,
      "question_ar": "يحسن في محاولة إقناع من هم على باطل ألا تكتفي بدعوتهم وهم في جمع، إذ يغوي بعضهم بعضا ويزايد بعضهم على بعض في القناعة بالباطل وعدم التأثر بالحق . اذكر آية تدل على هذا المعنى.",
      "question_en": "When trying to convince people upon falsehood, it is better not to limit your call to addressing them only in groups—since they incite each other and compete in stubbornness. Mention a verse indicating this meaning.",
      "answer": {
        "surah": 34,
        "ayahs": [
          46
        ],
        "ayah_ar": "﴿قُلْ إِنَّمَا أَعِظُكُمْ بِوَاحِدَةٍ أَنْ تَقُومُوا لِلَّهِ مَثْنَىٰ وَفُرَادَىٰ ثُمَّ تَتَفَكَّرُوا ۚ مَا بِصَاحِبِكُمْ مِنْ جِنَّةٍ ۚ إِنْ هُوَ إِلَّا نَذِيرٌ لَكُمْ بَيْنَ يَدَيْ عَذَابٍ شَدِيدٍ﴾ [سبأ: 46]",
        "ayah_en": "“Say, ‘I only advise you of one thing: that you stand for Allah—two by two and singly—then reflect. Your companion is not possessed; he is only a warner to you before a severe punishment.’” (Saba’ 34:46)",
        "commentary_ar": "إرشادهم إلى القيام مثنى وفرادى يُضعِف أثر التواطؤ الجماعي والمزايدة في الباطل، ويُقرّبهم من التفكر الهادئ.",
        "commentary_en": "Directing them to reflect in pairs and individually reduces group pressure and mutual incitement, making calm, honest reflection more likely."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 6,
      "question_ar": "يتعذر بعض الشباب والفتيات في عدم انضباطهم في التعامل بأن \"النوايا حسنة والقصد شريف\" . اذكر آية تجعل وجوب انضباطهم من باب الأولى والأحرى.",
      "question_en": "Some youth excuse lack of proper conduct by saying “the intentions are good.” Mention a verse that makes the obligation of disciplined conduct even more necessary and obvious.",
      "answer": {
        "surah": 33,
        "ayahs": [
          53
        ],
        "ayah_ar": "﴿يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلَّا أَنْ يُؤْذَنَ لَكُمْ إِلَىٰ طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ وَلَٰكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا فَإِذَا طَعِمْتُمْ فَانْتَشِرُوا وَلَا مُسْتَأْنِسِينَ لِحَدِيثٍ ۚ إِنَّ ذَٰلِكُمْ كَانَ يُؤْذِي النَّبِيَّ فَيَسْتَحْيِي مِنْكُمْ ۖ وَاللَّهُ لَا يَسْتَحْيِي مِنَ الْحَقِّ ۚ وَإِذَا سَأَلْتُمُوهُنَّ مَتَاعًا فَاسْأَلُوهُنَّ مِنْ وَرَاءِ حِجَابٍ ۚ ذَٰلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ ۚ وَمَا كَانَ لَكُمْ أَنْ تُؤْذُوا رَسُولَ اللَّهِ وَلَا أَنْ تَنْكِحُوا أَزْوَاجَهُ مِنْ بَعْدِهِ أَبَدًا ۚ إِنَّ ذَٰلِكُمْ كَانَ عِنْدَ اللَّهِ عَظِيمًا﴾ [الأحزاب: 53]",
        "ayah_en": "“O you who believe, do not enter the houses of the Prophet unless permission is given to you for a meal, without waiting for its preparation. But when you are invited, enter; and when you have eaten, disperse and do not linger for conversation. Indeed that was hurting the Prophet, and he is shy of [dismissing] you; but Allah is not shy of the truth. And when you ask [his wives] for something, ask them from behind a veil; that is purer for your hearts and their hearts. And it is not for you to harm the Messenger of Allah, nor to marry his wives after him, ever. Indeed, that is—before Allah—enormous.” (Al-Aḥzāb 33:53)",
        "commentary_ar": "إذا كان الله أمر بالانضباط والستر حتى بين أطهر الرجال (الصحابة) وأطهر النساء (أمهات المؤمنين)، فغيرهم من باب الأولى أحرى بالالتزام؛ لأن المقصود طهارة القلوب وسد الذرائع.",
        "commentary_en": "If disciplined boundaries were commanded even between the purest men (the Companions) and the purest women (the Mothers of the Believers), then others are even more obligated to observe proper conduct—because the aim is purity of hearts and blocking pathways to harm."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 7,
      "question_ar": "كم من ظالم كان يرتع في الملذات غافلا متنعما كأن الدنيا دائمة له. وفي لحظة حرم من كل شيء : من شهوة الجنس الآخر، المال، الثياب والمراكب الفاخرة الطرب ، لذيذ الطعام والشراب. وهذا كله انقطع منه بلا عودة إليه أبدا. اذكر آية تصور هذا الحال.",
      "question_en": "How many wrongdoers indulge in pleasures as if the world will last—then in one moment they are cut off from everything they desire forever. Mention a verse depicting this state.",
      "answer": {
        "surah": 34,
        "ayahs": [
          54
        ],
        "ayah_ar": "﴿وَحِيلَ بَيْنَهُمْ وَبَيْنَ مَا يَشْتَهُونَ كَمَا فُعِلَ بِأَشْيَاعِهِمْ مِنْ قَبْلُ ۚ إِنَّهُمْ كَانُوا فِي شَكٍّ مُرِيبٍ﴾ [سبأ: 54]",
        "ayah_en": "“And a barrier will be placed between them and what they desire, as was done with their counterparts before. Indeed, they were in troubling doubt.” (Saba’ 34:54)",
        "commentary_ar": "تصويرٌ بليغ لانقطاع الشهوات واللذات دفعةً واحدة بلا رجعة، عقوبةً على الشك والريبة.",
        "commentary_en": "A vivid depiction of desires being cut off all at once with no return—punishment tied to their doubt and suspicion."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 8,
      "question_ar": "التفكر في خلق الله عبادة مهجورة من الكثيرين . اذكر ست كلمات تبين أنه كلما تفكر الإنسان في خلق الله زاد معرفةً بالله سبحانه وخوفاً منه.",
      "question_en": "Reflecting on Allah’s creation is a neglected worship for many. Mention six words showing that the more one reflects on creation, the more one knows Allah and fears Him.",
      "answer": {
        "surah": 35,
        "ayahs": [
          28
        ],
        "ayah_ar": "﴿إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ﴾ [فاطر: 28]",
        "ayah_en": "“Only those of His servants who have knowledge truly fear Allah.” (Fāṭir 35:28)",
        "commentary_ar": "جاءت الجملة عقب ذكر آيات كونية، فدلّ السياق على أن العلم النافع المتولد من التفكر يزيد الخشية.",
        "commentary_en": "The statement comes after mentioning cosmic signs, indicating that beneficial knowledge born from reflection increases true fear of Allah."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 9,
      "question_ar": "آية عبرت بفعل يدل على أن أهل العلم النافع يوقنون بصحة الوحي كما يوقنون بالمحسوسات . اذكر الكلمة الدالة على ذلك في الآية.",
      "question_en": "A verse uses a verb indicating that people of beneficial knowledge are as certain of revelation as they are of visible, tangible realities. Mention the word indicating this in the verse.",
      "answer": {
        "surah": 34,
        "ayahs": [
          6
        ],
        "ayah_ar": "﴿وَيَرَى الَّذِينَ أُوتُوا الْعِلْمَ الَّذِي أُنزِلَ إِلَيْكَ مِنْ رَبِّكَ هُوَ الْحَقَّ وَيَهْدِي إِلَىٰ صِرَاطِ الْعَزِيزِ الْحَمِيدِ﴾ [سبأ: 6]",
        "ayah_en": "“And those who have been given knowledge see that what has been sent down to you from your Lord is the truth, and it guides to the path of the Mighty, the Praiseworthy.” (Saba’ 34:6)",
        "commentary_ar": "الكلمة الدالة هي: «وَيَرَى»، إذ عُبِّر بها للتنبيه على اليقين كيقين المرئيات.",
        "commentary_en": "The indicative word is **“see”** (وَيَرَى), used to signal a certainty like the certainty of things seen with one’s eyes."
      },
      "difficulty": "",
      "theme": ""
    },
    {
      "qNum": 10,
      "question_ar": "اذكر آية فيها إشارة إلى أن أجساد الأنبياء لا يعتريها بالموت ما يعتري أجساد غيرهم من البشر.",
      "question_en": "Mention a verse that hints that the bodies of the prophets are not affected by death the way other human bodies are.",
      "answer": {
        "surah": 34,
        "ayahs": [
          14
        ],
        "ayah_ar": "﴿فَلَمَّا قَضَيْنَا عَلَيْهِ الْمَوْتَ مَا دَلَّهُمْ عَلَىٰ مَوْتِهِ إِلَّا دَابَّةُ الْأَرْضِ تَأْكُلُ مِنسَأَتَهُ ۖ فَلَمَّا خَرَّ تَبَيَّنَتِ الْجِنُّ أَنْ لَوْ كَانُوا يَعْلَمُونَ الْغَيْبَ مَا لَبِثُوا فِي الْعَذَابِ الْمُهِينِ﴾ [سبأ: 14]",
        "ayah_en": "“And when We decreed death for him, nothing indicated his death to them except a creature of the earth eating his staff; then when he fell, the jinn realized that if they had known the unseen, they would not have remained in humiliating torment.” (Saba’ 34:14)",
        "commentary_ar": "الآية تذكر بقاء سليمان عليه السلام قائماً مدةً بعد موته حتى أكلت دابة الأرض منسأته؛ ويُستأنس بهذا مع النصوص الأخرى في خصوصية الأنبياء.",
        "commentary_en": "The verse describes Sulaymān (peace be upon him) remaining standing for a period after death until his staff was eaten—this is used as supporting context alongside other texts about prophetic distinction."
      },
      "difficulty": "",
      "theme": ""
    }
  ]
}
