{
    "juz": 13,
    "items": [
        {
            "qNum": 1,
            "question_ar": "اذكر عبارة دقيقة استخدمها القرآن تبين حذر يوسف من الكذب حتى وإن\nكان لإتمام خطة له منها مقصد نبيل .",
            "question_en": "Mention a precise expression the Qur’an used that shows Yusuf’s caution against speaking falsely, even while executing a plan with a noble aim.",
            "answer": {
                "surah": 12,
                "ayahs": [
                    79
                ],
                "ayah_ar": "﴿قَالَ مَعَاذَ اللَّهِ أَنْ نَأْخُذَ إِلَّا مَنْ وَجَدْنَا مَتَاعَنَا عِنْدَهُ إِنَّا إِذًا لَظَالِمُونَ﴾\n[79 :يوسف]",
                "ayah_en": "He said, “Allah forbid that we take anyone except the one with whom we found our possession. Indeed, we would then be wrongdoers.”",
                "commentary_ar": "فلم يقل \" إلا من سَرَقَ متاعنا \" تحرزا من الكذب.",
                "commentary_en": "He did not say ﴿إِلَّا مَنْ سَرَقَ مَتَاعَنَا﴾ (“except the one who stole our property”), but instead said ﴿إِلَّا مَنْ وَجَدْنَا مَتَاعَنَا عِنْدَهُ﴾ — out of caution to avoid lying."
            }
        },
        {
            "qNum": 2,
            "question_ar": "اذكر جزءا من آية يبين أن الله عز وجل إذا قدر أمرا يسر له أسبابا خفية لا\nتخطر بالبال.",
            "question_en": "Mention a portion of a verse showing that when Allah decrees a matter, He facilitates for it hidden means that may never occur to the mind.",
            "answer": {
                "surah": 12,
                "ayahs": [
                    100
                ],
                "ayah_ar": "﴿وَرَفَعَ أَبَوَيْهِ عَلَى الْعَرْشِ وَخَرُّوا لَهُ سُجَّدًا وَقَالَ يَا أَبَتِ هَذَا تَأْوِيلُ رُؤْيَايَ مِنْ قَبْلُ قَدْ\nجَعَلَهَا رَبِّي حَقًّا وَقَدْ أَحْسَنَ بِي إِذْ أَخْرَجَنِي مِنَ السِّجْنِ وَجَاءَ بِكُمْ مِنَ الْبَدْوِ مِنْ\nt\nبَعْدِ أَنْ نَزَغَ الشَّيْطَانُ بَيْنِي وَبَيْنَ إِخْوَتِي إِنَّ رَبِّي لَطِيفٌ لِمَا يَشَاءُ إِنَّهُ هُوَ الْعَلِيمُ\nالحكيم﴾ [يوسف: 100]",
                "ayah_en": "And he raised his parents upon the throne, and they fell down to him in prostration. And he said, “O my father, this is the interpretation of my vision of before. My Lord has made it true. And He was certainly good to me when He took me out of prison and brought you from the desert after Satan had stirred up [discord] between me and my brothers. Indeed, my Lord is Subtle in what He wills. Indeed, it is He who is the Knowing, the Wise.”",
                "commentary_ar": "ومن معاني اللطف التقدير في خفاء، كما حدث في قصة يوسف بداية من\nحسد إخوانه إلى أن صار عزيز مصر.",
                "commentary_en": "Among the meanings of ﴿لَطِيفٌ لِمَا يَشَاءُ﴾ is that Allah decrees and manages matters with hidden subtlety — arranging outcomes through causes that are concealed and unexpected. This is seen in Yusuf’s story: from the jealousy of his brothers, through what followed, until he became the ‘Aziz of Egypt."
            }
        },
        {
            "qNum": 3,
            "question_ar": "اذكر موطنين من مواطن أدب يوسف في التعبير مع إخوته.",
            "question_en": "Mention two places that show Yusuf’s refined etiquette in how he spoke with his brothers.",
            "answer": {
                "surah": 12,
                "ayahs": [
                    100,
                    89
                ],
                "ayah_ar": "﴿وَرَفَعَ أَبَوَيْهِ عَلَى الْعَرْشِ وَخَرُّوا لَهُ سُجَّدًا وَقَالَ يَا أَبَتِ هَذَا تَأْوِيلُ رُؤْيَايَ مِنْ قَبْلُ قَدْ\ng\nجَعَلَهَا رَبِّي حَقًّا وَقَدْ أَحْسَنَ بِي إِذْ أَخْرَجَنِي مِنَ السِّجْنِ وَجَاءَ بِكُمْ مِنَ الْبَدْوِ مِنْ\nt\nبَعْدِ أَنْ نَزَغَ الشَّيْطَانُ بَيْنِي وَبَيْنَ إِخْوَتِي إِنَّ رَبِّي لَطِيفٌ لِمَا يَشَاءُ إِنَّهُ هُوَ الْعَلِيمُ\nالحكيم﴾ [يوسف: 100]\n﴿قَالَ هَلْ عَلِمْتُمْ مَا فَعَلْتُمْ بِيُوسُفَ وَأَخِيهِ إِذْ أَنْتُمْ جَاهِلُونَ﴾ [يوسف: 89]",
                "ayah_en": "And he raised his parents upon the throne, and they fell down to him in prostration. And he said, “O my father, this is the interpretation of my vision of before. My Lord has made it true. And He was certainly good to me when He took me out of prison and brought you from the desert after Satan had stirred up [discord] between me and my brothers. Indeed, my Lord is Subtle in what He wills. Indeed, it is He who is the Knowing, the Wise.”\nHe said, “Do you know what you did with Yusuf and his brother when you were ignorant?”",
                "commentary_ar": "قال السعدي في تفسيره : ( إِذْ أَنْتُمْ جَاهِلُونَ) وهذا نوع اعتذار لهم بجهلهم، أو\nتوبيخ لهم إذ فعلوا فعل الجاهلين ، مع أنه لا ينبغي ولا يليق منهم).",
                "commentary_en": "As-Sa‘di said regarding ﴿إِذْ أَنْتُمْ جَاهِلُونَ﴾: this carries a meaning of excusing them by attributing what happened to their ignorance, or it is a rebuke — because they committed the deed of the ignorant, while it was not fitting or appropriate for them."
            }
        },
        {
            "qNum": 4,
            "question_ar": "سلامة الدين نعمة يمتن الله بها على العبد وإن كانت من خلال مصيبة\nتصيب المرء في دنياه. اذكر آية تدل على ذلك.",
            "question_en": "Soundness of religion is a blessing Allah bestows upon a servant, even if it comes through a worldly hardship. Mention a verse indicating this.",
            "answer": {
                "surah": 12,
                "ayahs": [
                    34
                ],
                "ayah_ar": "فَاسْتَجَابَ لَهُ رَبُّهُ فَصَرَفَ عَنْهُ كَيْدَهُنَّ إِنَّهُ هُوَ السَّمِيعُ العليم) [يوسف: 34]\nفهذه نعمة أن من الله تعالى بها على يوسف أن صرف عنه كيد النساء وإن\nأدخله السجن.",
                "ayah_en": "So his Lord responded to him and turned away from him their plot. Indeed, He is the Hearing, the Knowing.",
                "commentary_ar": "",
                "commentary_en": "This is a blessing Allah granted Yusuf: He turned away the women’s plot from him, even though that deliverance came through the trial of imprisonment."
            }
        },
        {
            "qNum": 5,
            "question_ar": "كم كلمةً قالها يوسف في قضية خروجه من السجن، مقارنةً بكم كلمة قالها\nفي الدعوة إلى ربه سبحانه ؟",
            "question_en": "How many words did Yusuf say regarding his release from prison, compared to how many words he said in calling to his Lord?",
            "answer": {
                "surah": 12,
                "ayahs": [
                    37,
                    38,
                    39,
                    40,
                    41,
                    42
                ],
                "ayah_ar": "وَقَالَ لِلَّذِي ظَنَّ أَنَّهُ نَاجٍ مِّنْهُمَا اذْكُرْنِي عِندَ رَبِّكَ فَأَنسَاهُ الشَّيْطَانُ ذِكْرَ رَبِّهِ فَلَبِثَ\nt\nفِي السِّجْنِ بِضْعَ سِنِينَ) [يوسف: 42]\nقال لا يأتيكما طَعام تُرزَقانِهِ إِلَّا نَبَّأَتُكُما بِتَأْوِيلِهِ قَبْلَ أَن يَأْتِيَكُما ذَلِكُما مِمَّا\nعَلَّمَنِي رَبِّي إِنِّي تَرَكتُ مِلَّةَ قَومٍ لا يُؤْمِنونَ بِاللَّهِ وَهُم بِالْآخِرَةِ هُم كَافِرُونَ وَاتَّبَعْتُ\nt\nمِلَّةَ آبائى إبراهيم وإسحاقَ وَيَعقوبَ ما كانَ لَنا أَن نُشْرِكَ بِاللَّهِ مِن شَيْءٍ ذَلِكَ مِن\nفَضلِ اللَّهِ عَلَيْنَا وَعَلَى النَّاسِ وَلكِنَّ أَكْثَرَ النَّاسِ لا يَشكُرُونَ يا صاحبي\nt\nالسجن أرباب مُتَفَرِّقُونَ خَيْرٌ أَمِ اللَّهُ الواحِدُ القَهَّارُ ما تَعْبُدُونَ مِن دونِهِ إِلَّا\nأسماءً سَمَّيْتُموها أَنتُم وَآبَاؤُكُم ما أَنزَلَ اللهُ بِها مِن سُلطَانٍ إِنِ الْحُكْمُ إِلَّا لِلَّهِ أَمَرَ\nأَلَّا تَعبُدوا إِلَّا إِيَّاهُ ذلِكَ الدِّينُ القَيِّمُ وَلَكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ)\n]41-37 :يوسف[\n\nفقال فيما يتعلق بإثبات النبوة ثم الدعوة إلى التوحيد حوالي 100 كلمة ، بينما\nقال فيما يتعلق بخروجه من السجن ثلاث كلمات : اذْكُرْنِي عِندَ رَبِّكَ).\n\nفانظر يرحمك الله كيف حمل يوسف هم دعوته في السجن وكم جاهد من\nأجل تبليغها وقارن بين كلماته التي قالها من أجل دينه وكلماته التي قالها من\nأجل خروجه.",
                "ayah_en": "And he said to the one whom he thought would be saved of the two, “Mention me before your master.” But Satan made him forget the mention to his master, so he remained in prison for several years.\nHe said, “No food will come to you with which you are provided except that I will inform you of its interpretation before it comes to you. That is from what my Lord has taught me. Indeed, I have left the religion of a people who do not believe in Allah, and in the Hereafter they are disbelievers. And I have followed the religion of my fathers, Ibrahim, Ishaq, and Ya‘qub. It was not for us to associate anything with Allah. That is from the favor of Allah upon us and upon the people, but most of the people are not grateful. O my two companions of prison, are separate lords better or Allah, the One, the Prevailing? You worship not besides Him except names which you have named, you and your fathers, for which Allah has sent down no authority. الحكم is only for Allah. He has commanded that you worship none but Him. That is the straight religion, but most of the people do not know.”",
                "commentary_ar": "",
                "commentary_en": "He spoke about establishing the truth and calling to tawhid at length (about 100 words), while regarding his exit from prison he said only three words: ﴿اذْكُرْنِي عِندَ رَبِّكَ﴾. So look how Yusuf carried the burden of da‘wah even while imprisoned, and how much he strove to convey it — and compare the many words he used for his دين with the few words he used for his personal release."
            }
        },
        {
            "qNum": 6,
            "question_ar": "تكلمت باللهجة المحلية لتقرب مفهوماً إلى الناس وأنت تعلم أنهم ما كانوا\nليفهموه بغير هذا . فعاتبك صديقك أن هذا يخل بالحفاظ على اللغة\nالفصحى . اذكر جزءا من آية ترد بها عليه .",
            "question_en": "You spoke in a local dialect to clarify a concept to people, knowing they would not understand it otherwise. A friend criticized you, saying this harms preserving formal Arabic. Mention part of a verse you could reply with.",
            "answer": {
                "surah": 14,
                "ayahs": [
                    4
                ],
                "ayah_ar": "وَما أَرسلنا من رسولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُم فَيُضِلُّ اللَّهُ مَن يَشَاءُ وَيَهْدِى مَن\ny\nيَشَاءُ وَهُوَ العَزيز الحكيم [إبراهيم: 4].",
                "ayah_en": "And We did not send any messenger except in the language of his people so that he might make [the message] clear to them. Then Allah leaves astray whom He wills and guides whom He wills. And He is the Exalted in Might, the Wise.",
                "commentary_ar": "",
                "commentary_en": "The verse explicitly states the principle: ﴿إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ﴾ — conveying in a way people understand, so the meaning is made clear."
            }
        },
        {
            "qNum": 7,
            "question_ar": "من أساليب أهل الباطل أنهم يتكلمون عن مخالفة مقدساتهم كتهمة\nمُسَلَّمةٍ لا نقاش فيها ، تهربا من مساءلة صحة ما قدسوه. اذكر سبع كلمات\nمن آية تشير لهذا المعنى.",
            "question_en": "A tactic of people of falsehood is to speak of opposing what they sanctify as an unquestionable accusation, to evade examining whether what they sanctified is even true. Mention seven words from a verse indicating this meaning.",
            "answer": {
                "surah": 14,
                "ayahs": [
                    10
                ],
                "ayah_ar": "قالَت رُسُلُهُم أَفِي اللهِ شَكٍّ فاطِرِ السَّماواتِ وَالْأَرْضِ يَدْعُوكُم لِيَغْفِرَ لَكُم مِن\nذُنوبِكُم وَيُؤَخِّرَكُم إِلى أَجَلٍ مُسَمًّى قالوا إن أَنتُم إِلَّا بَشَرٌ مِثْلُنَا تُرِيدُونَ أَن\nتَصُدّونا عَمَّا كانَ يَعْبُدُ آباؤنا فأتونا بِسُلطانٍ مُبين) [إبراهيم: 10].",
                "ayah_en": "Their messengers said, “Is there any doubt about Allah, Creator of the heavens and the earth? He invites you so that He may forgive you of your sins and delay you for a specified term.” They said, “You are not but human beings like us. You want to avert us from what our fathers used to worship, so bring us a clear authority.”",
                "commentary_ar": "",
                "commentary_en": "They treated leaving their inherited ‘sanctities’ as a settled charge against the messengers: ﴿تُرِيدُونَ أَن تَصُدّونا عَمَّا كانَ يَعْبُدُ آباؤنا﴾ — as if that alone ends the discussion, instead of examining whether what their fathers worshiped was true."
            }
        },
        {
            "qNum": 8,
            "question_ar": "من ثمرات معرفة الحق واتباعه يقينك بأن الله إذ وفقك لذلك فإنه أراد بك\nخيراً فسيدبر لك ويُحسِن عاقِبَتَك متى لجأت إليه . اذكر جزءا من آية يدل على\nذلك .",
            "question_en": "One fruit of knowing the truth and following it is certainty that if Allah guided you to it, He intended good for you—so He will manage your affairs and grant you a good outcome whenever you turn to Him. Mention part of a verse indicating this.",
            "answer": {
                "surah": 14,
                "ayahs": [
                    12
                ],
                "ayah_ar": "وَمَا لَنا أَلَّا نَتَوَكَّلَ عَلَى اللَّهِ وَقَد هَدانا سُبُلَنا وَلَنَصْبِرَنَّ عَلَى مَا آذَيْتُمونا وَعَلَى اللَّهِ\nفَلْيَتَوَكَّلِ المُتَوَكِّلُونَ) [إبراهيم: 12].",
                "ayah_en": "And why should we not rely upon Allah while He has guided us to our ways? And we will surely be patient over whatever harm you cause us. And upon Allah let those who would rely, rely.",
                "commentary_ar": "",
                "commentary_en": "The verse links guidance to اعتماد القلب على الله: ﴿وَقَدْ هَدَانَا سُبُلَنَا﴾ then immediately affirms ﴿أَلَّا نَتَوَكَّلَ عَلَى اللَّهِ﴾ — meaning: since He guided us, we know He intended خيرًا for us, so we rely upon Him and await His good management and outcome."
            }
        },
        {
            "qNum": 9,
            "question_ar": "من حسن خلق يوسف عليه السلام أنه لم يسند الظلم لإخوته رغم وقوعه\nمنهم. اذكر خمس كلمات تبين ذلك .",
            "question_en": "From Yusuf’s good character is that he did not directly attribute the wrongdoing to his brothers despite it occurring from them. Mention five words that show this.",
            "answer": {
                "surah": 12,
                "ayahs": [
                    100
                ],
                "ayah_ar": "﴿وَرَفَعَ أَبَوَيْهِ عَلَى الْعَرْشِ وَخَرُّوا لَهُ سُجَّدًا وَقَالَ يَا أَبَتِ هَذَا تَأْوِيلُ رُؤْيَايَ مِنْ قَبْلُ قَدْ\ng\nجَعَلَهَا رَبِّي حَقًّا وَقَدْ أَحْسَنَ بِي إِذْ أَخْرَجَنِي مِنَ السِّجْنِ وَجَاءَ بِكُمْ مِنَ الْبَدْوِ مِنْ\nt\nبَعْدِ أَنْ نَزَغَ الشَّيْطَانُ بَيْنِي وَبَيْنَ إِخْوَتِي إِنَّ رَبِّي لَطِيفٌ لِمَا يَشَاءُ إِنَّهُ هُوَ الْعَلِيمُ\nالحكيم﴾ [يوسف: 100]",
                "ayah_en": "And he raised his parents upon the throne, and they fell down to him in prostration. And he said, “O my father, this is the interpretation of my vision of before. My Lord has made it true. And He was certainly good to me when He took me out of prison and brought you from the desert after Satan had stirred up [discord] between me and my brothers. Indeed, my Lord is Subtle in what He wills. Indeed, it is He who is the Knowing, the Wise.”",
                "commentary_ar": "قال السعدي هنا كلاما جميلاً يبين فيه لطف يوسف عليه السلام وأدبه\nوحسن خطابه في أربع لفتات :\n\nأ. أنه عليه السلام قال : ( وَقَدْ أَحْسَنَ بِي إِذْ أَخْرَجَنِي مِنَ السِّجْنِ)، ولم يقل : (إذ\nأخرجني من الجب الذي وضعني فيه إخوتي ) ، كأنه لا يذكر ذلك الذنب\nلإخوته.\n\nب. ثم قال عليه السلام : (وَجَاءَ بِكُم مِّنَ الْبَدْوِ ) ، ولم يقل : (وجاء بكم من الجوع\nوالتعب ) ، لئلا يظهر أنه يمتن عليهم بإنقاذهم من المجاعة.\n\nج. ولم يقل عليه السلام: \"أحسن بكم\" ، بل قال : أَحْسَنَ بِي)، فجعل الإحسان\nبإتيان أهله من البادية من إحسان الله إليه هو ، مع أن الله تعالى أحسن بذلك\nإليه وإليهم، لكن كأنه لم يُرد أن يظهر ضعفهم وحاجتهم في هذا المقام.\n\nد. ثم قال : مِن بَعْدِ أَن نَّزَغَ الشَّيْطَانُ بَيْنِي وَبَيْنَ إِخْوَتِي) فلم يقل \"نزغ الشيطان\nإخوتي \" أو \"أغوى الشيطان إخوتي \" . فالحمد لله الذي أخزى الشيطان ودحره\nوجمعنا بعد تلك الفرقة الشاقة.\n\nثم قال السعدي بعدها : ( فتبارك من يختص برحمته من يشاء من عباده،\nويهب لهم من لدنه رحمة إنه هو الوهاب).\n\nفانظر إلى هذا النظم القرآني البديع، وتذكر أن القرآن يحكي معنى قول يوسف\nعليه السلام، فهو لم يكن يتكلم العربية . فاجتمع في ذلك أن القرآن يصف\nالأنبياء بما فيهم من سمو خلق يناسب من يُبَلِّغ عن الله - بخلاف تحريفات\nأهل الكتاب التي تصفهم بما لا يليق - ، بالإضافة إلى التعبير عن هذا السمو\nبأحسن عبارة وأجمعها . فإذا تأملت هذا كله عرفت طرفاً من إعجاز القرآن.",
                "commentary_en": "As-Sa‘di mentioned a beautiful explanation showing Yusuf’s لطْف and أدب and good manner of speech in four points:\n\nA. Yusuf said: ﴿وَقَدْ أَحْسَنَ بِي إِذْ أَخْرَجَنِي مِنَ السِّجْنِ﴾, and he did not say: “when He took me out of the well that my brothers put me into,” as though he did not want to mention that sin against them.\n\nB. Then he said: ﴿وَجَاءَ بِكُمْ مِنَ الْبَدْوِ﴾, and he did not say: “He brought you from hunger and exhaustion,” so as not to make it seem like he was reminding them of being rescued from famine.\n\nC. He did not say “He was good to you,” but said: ﴿أَحْسَنَ بِي﴾ — making the coming of his family from the desert part of Allah’s kindness to him, even though Allah’s favor included them as well, as if Yusuf did not want to highlight their weakness and neediness in that setting.\n\nD. Then he said: ﴿مِن بَعْدِ أَنْ نَزَغَ الشَّيْطَانُ بَيْنِي وَبَيْنَ إِخْوَتِي﴾ — he did not say “Satan provoked my brothers” or “Satan misled my brothers.” So praise be to Allah who humiliated Satan, repelled him, and reunited them after that painful separation.\n\nThen As-Sa‘di said after this: “So blessed is the One who grants His mercy to whom He wills of His servants, and bestows from His presence a mercy — indeed He is the Bestower.”\n\nReflect on this magnificent Qur’anic expression, and remember that the Qur’an is conveying the meaning of Yusuf’s statement (and he was not speaking Arabic). In it, the Qur’an portrays the prophets with the lofty character befitting those who convey from Allah — unlike the distortions of some People of the Book — and it expresses that loftiness with the finest and most comprehensive wording. When you contemplate all of this, you recognize a portion of the Qur’an’s i‘jaz."
            }
        }
    ]
}