{
"juz": "bonus",
"items": [
{
"qNum": 1,
"question_ar": "الإنسان يشتد غضبه إذا أحس بأنه غُدر والله تعالى منزه عن ذلك لإحاطة\nعلمه بكل شيء، فلا يتصور أن يُغدر به تعالى ليكون هذا سببا في اشتداد غضبه\nمن أقوام، بل هو تعالى يعلم أصلا أن سيقع منهم ما وقع . هناك آيتان تذكران\nالقصة نفسها ، لكن قد يتوهم متوهم المعنى الذي ذكرنا فجاء في الأخرى عبارة\nمن 4 كلمات كأنها احتراز لهذا الظن في حق الله تعالى . ما هي هذه العبارة.",
"question_en": "A person’s anger intensifies when they feel betrayed, but Allah is far above that, since His knowledge encompasses everything—so it is not conceivable that He is “betrayed” in a way that would cause His anger to intensify. There are two verses that mention the same story, but to remove such a misconception, in the other verse there is a four-word phrase as a precaution against that misunderstanding regarding Allah. What is that phrase?",
"answer": {
"surah": 7,
"ayahs": [134, 135],
"ayah_ar": "(وَلَمَّا وَقَعَ عَلَيْهِمُ الرِّجْزُ قالوا يا موسى ادعُ لَنا\nالرِّجْزَ لَنُؤْمِنَنَّ لَكَ وَلَنُرْسِلَنَّ مَعَكَ بَنى إسرائيلَ فَلَمَّا كَشَفْنَا عَنْهُمُ الرِّجْزَ إِلَى أَجَلٍ\nهُم بالغوهُ إِذا هُم يَنكُثُونَ) [الأعراف: 134-135]",
"ayah_en": "And when the punishment fell upon them, they said, “O Moses, supplicate for us to your Lord by what He has عهد (promised) to you. If you remove from us the punishment, we will surely believe you and will surely send with you the Children of Israel.”\nBut when We removed from them the punishment until a term they were to reach, at once they broke their promise.",
"commentary_ar": "قال البغوي : ( يعني : إلى الغرق في اليم).",
"commentary_en": "Al-Baghawi said: “Meaning: until drowning in the sea.”"
}
},
{
"qNum": 2,
"question_ar": "طاغية احتقر عقول قومه واحتج عليهم بأفضليته على نبي بأمور ليست\nحججا في حقيقتها، ومع ذلك فقد تابعه قومه على ذلك . اذكر آية تدل على\nهذا المعنى.",
"question_en": "A tyrant belittled his people’s minds and argued for his superiority over a prophet using things that are not real proofs—yet his people still followed him. Mention a verse that indicates this meaning.",
"answer": {
"surah": 43,
"ayahs": [54],
"ayah_ar": "(فَاسْتَخَفَّ قَومَهُ فَأَطاعوهُ إِنَّهُم كانوا قوما فاسقينَ) [الزخرف: 54].",
"ayah_en": "So he deceived his people, and they obeyed him. Indeed, they were a defiantly disobedient people.",
"commentary_ar": "فإنك إذا قرأت الآيات قبل هذه الآية وجدت أن فرعون احتج بأمور ليست\nحججا في حقيقتها، وإنما احتقر عقول قومه فَاسْتَخَفَّ قَوْمَهُ ، ومع ذلك\nفأطاعوه. وهم إنما أطاعوه لأنهم كانوا فاسقين. ففسوقهم جعلهم قابلين\nلأن يُستخف بهم ، وهذا شأن الفاسق ؛ يعمى عن الحق ويسهل انقياده للباطل\nوأهواء النفوس.",
"commentary_en": "If you read the verses before this verse, you find that Pharaoh argued with things that are not real proofs; rather, he belittled his people’s minds—“So he deceived his people”—and yet they obeyed him. They only obeyed him because they were defiantly disobedient; their فسوق (rebelliousness) made them susceptible to being deceived. This is the nature of the defiant sinner: he becomes blind to the truth and is easily led by falsehood and the desires of the soul."
}
},
{
"qNum": 3,
"question_ar": "قد تدعوك نفسك لأن تفعل أمراً محرما من باب الشفقة على صديقك أو\nزميلك كأن تغششه في اختبار. اذكر آية تذكر بها نفسك أن الله يطالبك\nبالعدل الشرعي في كل مقام لأنك لن تكون أرحم من الله بهذا الذي أشفقت\nعليه .",
"question_en": "Your soul may urge you to do something forbidden out of “compassion” for a friend or classmate—like helping them cheat on an exam. Mention a verse to remind yourself that Allah demands lawful justice in every situation, because you will never be more merciful than Allah toward the one you feel sorry for.",
"answer": {
"surah": 4,
"ayahs": [135],
"ayah_ar": "(يا أَيُّهَا الَّذِينَ آمَنوا كونوا قَوَّامِينَ بِالقِسطِ شُهَداءَ لِلَّهِ وَلَو عَلَى أَنفُسِكُمْ أَوِ الوالِدَينِ\nوَالأَقْرَبِينَ إِن يَكُن غَنِيًّا أو فقيرًا فَاللَّهُ أولى بِهِما فَلا تَتَّبِعُوا الهَوى أَن تَعْدِلُوا وَإِن\nتلووا أَو تُعرِضُوا فَإِنَّ اللَّهَ كَانَ بِما تَعْمَلُونَ خَبِيرًا) [النساء: 135].",
"ayah_en": "O you who have believed, be persistently standing firm in justice, witnesses for Allah, even if it be against yourselves or parents and relatives. Whether one is rich or poor, Allah is more worthy of both. So do not follow desire, lest you not be just. And if you distort or refuse, then indeed Allah is ever, of what you do, Aware.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 4,
"question_ar": "ذكرنا أن الذي يضحي من أجل مبدأ يزداد تمسكاً به، وذلك عند قوله تعالى :\n(وَمَثَلُ الَّذِينَ يُنفِقُونَ أَمْوَالَهُمُ ابْتِغَاءَ مَرْضَاتِ اللَّهِ وَتَثْبِيتًا مِنْ أَنفُسِهِمْ... الآية\n[البقرة : 265] ، وذكرنا أن هذا ينطبق حتى على المبادئ الباطلة، مما يصعب\nاستجابة أصحابها لدعوة الحق ، إذ أن أحدهم مربوط بما قدم في حياته من\nوقت وجهد ومال وتضحيات في سبيل مبدئه، ويصعب عليه جدا أن يتقبل\nفكرة أنه وهو الآن ابن أربعين أو خمسين أو ستين قد أضاع ماضيه كله في\nباطل لن يستفيد منه . اذكر آية تحل هذا الإشكال النفسي الذي يعيق كثيرين\nعن قبول الحق ، وتعطيهم دفعة هائلة لا يحسون معها بخسارة الماضي وكل ما\nفيه، بل يدركون أنهم إن قبلوا الحق استفادوا من هذا الماضي.",
"question_en": "We mentioned that someone who sacrifices for a principle becomes more attached to it, as in Allah’s statement: (And the example of those who spend their wealth seeking Allah’s pleasure and to تثبيتًا من أنفسهم...) [Al-Baqarah: 265]. This applies even to false principles, making it hard for their followers to accept the truth, since they are tied to what they invested of time, effort, money, and sacrifices. It becomes very hard for a 40-, 50-, or 60-year-old to accept that their entire past was wasted on falsehood. Mention a verse that resolves this psychological barrier and gives them a powerful push so they do not feel they lost the past—rather, they realize that if they accept the truth, they benefit from that past.",
"answer": {
"surah": 25,
"ayahs": [70],
"ayah_ar": "إِلَّا مَن تَابَ وَآمَنَ وَعَمِلَ عَمَلًا صَالِحًا فَأُولبِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِم حَسَنَاتٍ وَكَانَ\nاللهُ غَفُورًا رَحِيمًا [الفرقان : 70].",
"ayah_en": "Except for those who repent, believe, and do righteous deeds—for them Allah will replace their evil deeds with good. And Allah is Ever-Forgiving, Most Merciful.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 5,
"question_ar": "هناك مشهد مؤثر يعرفه الآباء . الطفل الصغير قد يعصي والده فيعاقبه الأب،\nفيجلس الابن في زاوية بالبيت حزينا صامتا لا يعرف كيف يسترضي أباه .\nالأب برحمته وإشفاقه لا يحب أن يرى ولده على هذا الحال، فيدفع الأم لتقول\nللولد تعال واعتذر لأبيك وقل له أنك آسف ولن تعيد هذا الخطأ وأنك تريد\nمنه المسامحة . فانظر إلى رحمة الأب الذي هو بنفسه يلقن ولده ماذا يقول\nليعتذر حتى لا تستمر الجفوة. ولله المثل الأعلى . الله تعالى أرحم بنا من آبائنا\nوأمهاتنا . اذكر آية تذكرك بهذا المشهد تظهر فيها رحمة الله تعالى.",
"question_en": "There is a moving scene that parents know well: a small child disobeys his father and is punished; the child then sits sadly and silently, not knowing how to appease his father. Out of mercy, the father does not like to see his child like that, so he has the mother tell the child what to say to apologize. Look at the father’s mercy—he himself teaches his child what to say so the distance does not continue. And Allah’s is the highest example; Allah is more merciful to us than our fathers and mothers. Mention a verse that reminds you of this scene and shows Allah’s mercy.",
"answer": {
"surah": 2,
"ayahs": [37],
"ayah_ar": "فَتَلَقَّى آدَمُ مِن رَبِّهِ كَلِمَاتٍ فَتابَ عَلَيْهِ إِنَّهُ هُوَ التَّوَّابُ الرَّحِيمُ﴾ [البقرة : 37].",
"ayah_en": "Then Adam received from his Lord words, so He accepted his repentance. Indeed, He is the Accepting of repentance, the Merciful.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 6,
"question_ar": "أوامر الله ورسوله تحيينا. فعلينا الاستجابة الفورية دون تراخ ولا تردد. اذكر\nآية تدل على هذا.",
"question_en": "Allah and His Messenger’s commands give us life, so we must respond immediately without delay or hesitation. Mention a verse that indicates this.",
"answer": {
"surah": 8,
"ayahs": [24],
"ayah_ar": "يَا أَيُّهَا الَّذِينَ آمَنُوا استجيبوا لِلَّهِ وَلِلرَّسولِ إِذا دَعاكُم لِما يُحييكُم وَاعْلَمُوا أَنَّ اللَّهَ\nيَحُولُ بَينَ المَرْءِ وَقَلْبِهِ وَأَنَّهُ إِلَيْهِ تُحْشَرُونَ) [الأنفال : 24].",
"ayah_en": "O you who have believed, respond to Allah and to the Messenger when he calls you to that which gives you life. And know that Allah intervenes between a person and his heart, and that to Him you will be gathered.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 7,
"question_ar": "اذكر آية تشير إلى أن ممن كان قبلنا مَن نَفَّرَ الناس عن الإقبال على الله بالطمع\nبما في أيديهم متخذين الدين مطية لذلك.",
"question_en": "Mention a verse indicating that among those before us were people who repelled others from turning to Allah, out of greed for what people had—using religion as a means for that.",
"answer": {
"surah": 9,
"ayahs": [34],
"ayah_ar": "يا أَيُّهَا الَّذِينَ آمَنوا إِنَّ كَثِيرًا مِنَ الأَحبارِ وَالرُّهْبانِ لَيَأْكُلُونَ أَمْوالَ النَّاسِ بِالباطل\nوَيَصُدُونَ عَن سَبِيلِ اللَّهِ وَالَّذِينَ يَكْذِرُونَ الذَّهَبَ وَالْفِضَّةَ وَلَا يُنفِقُونَها فِي سَبِيلِ\nاللَّهِ فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ) [التوبة: 34].",
"ayah_en": "O you who have believed, indeed many of the rabbis and monks consume the wealth of people unjustly and avert them from the way of Allah. And those who hoard gold and silver and do not spend it in the way of Allah—give them tidings of a painful punishment.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 8,
"question_ar": "اذكر ثلاث مواضع من القرآن يذكر فيها الله تعالى صفات كثيرة حميدة\nللمؤمنين، لكن عندما يتكلم عن الجزاء يختار صفة الصبر تحديدا بما يُشعر بأن\nمدار الأمر على الصبر.",
"question_en": "Mention three places in the Qur’an where Allah mentions many praiseworthy traits of the believers, but when speaking about their reward He specifically selects the trait of patience—suggesting that the matter pivots on patience.",
"answer": {
"surah": null,
"ayahs": [75, 12, 24],
"ayah_ar": "أُوليكَ يُجْزَونَ الغُرفَةَ بِما صَبَرُوا وَيُلَقَّونَ فيها تَحِيَّةً وَسَلَامًا) [الفرقان: 75]\nوَجَزاهُم بِمَا صَبَرُوا جَنَّةً وَحَرِيرًا) [الإنسان : 12]\nسَلامٌ عَلَيْكُم بِما صَبَرتُم فَنِعْمَ عُقْبَى الدار) [الرعد: 24].",
"ayah_en": "Those will be awarded the highest chambers for what they patiently endured, and they will be received therein with greetings and peace. (Al-Furqan: 75)\nAnd He will reward them for what they patiently endured with a garden and silk. (Al-Insan: 12)\n“Peace be upon you for what you patiently endured—so excellent is the final home.” (Ar-Ra‘d: 24)",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 9,
"question_ar": "اذكر آيتين يجعل الله فيهما القدوة للمؤمنين على مر السنين اثنتين من\nالنساء.",
"question_en": "Mention two verses in which Allah sets as an enduring example for believers, across the years, two women.",
"answer": {
"surah": 66,
"ayahs": [11, 12],
"ayah_ar": ".. وَضَرَبَ اللَّهُ مَثَلًا لِلَّذِينَ آمَنُوا امْرَأَتَ فِرعَونَ إِذ قالَت رَبِّ ابْنِ لِي عِندَكَ بَيْتًا فِي\nالْجَنَّةِ وَنَجِّنِي مِن فِرْعَونَ وَعَمَلِهِ وَنَجِّنِى مِنَ القَومِ الظَّالِمِينَ وَمَرِيَمَ ابْنَتَ عِمرانَ\nالَّتِي أَحْصَنَت فَرجَها فَنَفَخنا فيهِ مِن روحِنا وَصَدَّقَت بِكَلِمَاتِ رَبِّهَا وَكُتُبِهِ وَكَانَت\nمِنَ القانتين) [التحريم : 11 - 12 ]",
"ayah_en": "And Allah presents an example for those who believed: the wife of Pharaoh, when she said, “My Lord, build for me near You a house in Paradise and save me from Pharaoh and his deeds and save me from the wrongdoing people.”\nAnd [the example of] Mary, the daughter of ‘Imran, who guarded her chastity, so We breathed into her from Our spirit; and she believed in the words of her Lord and His scriptures and was of the devoutly obedient.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 10,
"question_ar": "اذكر آيتين من موضعين مختلفين يعين إدراك أن استثناء هما منقطع على\nنفي أن يكون النبي صلى الله طالبا من الناس بدعوته أي وجه من وجوه\nالانتفاع الدنيوية.",
"question_en": "Mention two verses from two different passages that help one realize that their exception is disconnected (استثناء منقطع), negating the idea that the Prophet ﷺ sought any worldly benefit from people for his call.",
"answer": {
"surah": null,
"ayahs": [57, 23],
"ayah_ar": "قُل ما أَسْأَلُكُم عَلَيْهِ مِن أَجْرٍ إِلَّا مَن شَاءَ أَن يَتَّخِذَ إِلَى رَبِّهِ سَبِيلًا﴾ [الفرقان: 57 ]\nذلِكَ الَّذِي يُبَشِّرُ اللَّهُ عِبادَهُ الَّذِينَ آمَنوا وَعَمِلُوا الصَّالِحاتِ قُل لا أَسْأَلُكُم عَلَيْهِ\nأَجْرًا إِلَّا المَوَدَّةَ فِي القُربى وَمَن يَقْتَرِف حَسَنَةً نَزِدْ لَهُ فِيهَا حُسنًا إِنَّ اللَّهَ غَفُورٌ شَكُورُ)\n[الشورى : 23]",
"ayah_en": "Say, “I do not ask you for any reward for it except that whoever wills may take to his Lord a way.” (Al-Furqan: 57)\nThat is what Allah gives good tidings of to His servants who believe and do righteous deeds. Say, “I do not ask you for any reward for it except love due to kinship.” And whoever earns a good deed—We increase for him in it good. Indeed, Allah is Forgiving, Appreciative. (Ash-Shura: 23)",
"commentary_ar": "فتقدير الكلام : لا أسألكم على دعوتي أجراً وإنما من شاء أن يتخذ إلى ربه سبيلا\nبطاعته فليفعل . وذكر بعض المفسرين أيضاً تقديراً آخر معناه : لا أسألكم\nعلى دعوتي أجراً. إنما إن اتخذتم سبيل الإسلام والطاعات فهذا أجري لما أناله\nمن الله تعالى ثواباً على ذلك.\nوكذلك قوله تعالى في الآية الثانية : {قُل لَّا أَسْأَلُكُمْ عَلَيْهِ أَجْرًا إِلَّا الْمَوَدَّةَ فِي\nالْقُرْبَى}.\nوهنا قد يفهم البعض أن النبي صلى الله عليه وسلم لا يطلب من قومه أجراً\nعلى دعوته إلا أن يودوه ، وليس كذلك ، فلو طلب منهم مودة لأجل الدعوة فهو\nقد طلب إذن نوعا من أنواع الأجر. إنما معنى الآية : لا أسألكم على التبليغ أجراً\nالبتة، وإنما أسألكم المودة لأجل القربى التي بيني وبينكم، فمودتكم لي لقرابتي\nمما تقتضيه مروءتكم. فهذا أيضاً استثناء منقطع ، وحتى طلبه منهم أن يودوه\nكان لصالح دعوته عليه الصلاة والسلام، قال ابن عاشور في التحرير\nوالتنوير) : ( وإنما سألهم المودة لأن معاملتهم إياه معاملة المودة معينة على\nنشر دعوة الإسلام ، إذ تلين بتلك المعاملة شكيمتهم فيتركون مقاومته فيتمكن\nمن تبليغ دعوة الإسلام على وجه أكمل فصارت هذه المودة غرضاً دينياً لا نفع\nفيه لنفس النبيء صلى الله عليه وسلم)).",
"commentary_en": "So the intended meaning is: “I do not ask you for any wage for my call; rather, whoever wishes may take a path to his Lord through obedience.” Some exegetes also mentioned another estimation meaning: “I do not ask you for any wage for my call; rather, if you take the path of Islam and acts of obedience, then that is my wage in what I will receive from Allah in reward for that.”\nLikewise, Allah’s statement in the second verse: {Say: I do not ask you any wage for it except love due to kinship.}\nHere, some may think the Prophet ﷺ asks his people for a wage for his call—namely, that they love him—but that is not the case. If he were asking them for affection for the sake of the call, that would indeed be a kind of wage. Rather, the meaning is: “I ask you no wage whatsoever for conveying; I only ask you for affection because of the kinship between me and you.” Their affection for him due to his kinship is what their chivalry and honorable conduct would require. This too is a disconnected exception. Even asking them to show him affection was for the benefit of his call, peace and blessings be upon him. Ibn ‘Ashur said in At-Tahrir wa At-Tanwir: he only asked for affection because treating him with affection helps spread the call of Islam; their hostility softens, they cease resisting him, and he becomes able to convey the call more perfectly—so this affection becomes a religious aim with no personal worldly benefit for the Prophet ﷺ."
}
},
{
"qNum": 11,
"question_ar": "آية يوجه فيها الخطاب لأهل الكتاب بما قد يوهمهم باستعطافهم، فتختم\nبكلمات تنكسهم وتقمع غرورهم . ما هي هذه الكلمات ؟",
"question_en": "A verse addresses the People of the Book in a way that might make them think they are being courted, but it ends with words that humble them and crush their arrogance. What are those words?",
"answer": {
"surah": 5,
"ayahs": [59],
"ayah_ar": "قُل يا أهل الكتاب هَل تَنقِمُونَ مِنَا إِلَّا أَنْ آمَنَا بِاللَّهِ وَمَا أُنزِلَ إِلَّيْنَا وَمَا أُنزِلَ مِن\nقَبْلُ وَأَنَّ أَكثَرَكُم فاسقونَ﴾ [المائدة: 59]",
"ayah_en": "Say, “O People of the Scripture, do you resent us except that we have believed in Allah and in what was revealed to us and what was revealed before—and that most of you are defiantly disobedient?”",
"commentary_ar": "فتنقمون صلاحنا المزامن لفسقكم فتحسدوننا ، وما هذا ذنبنا بل ذنبكم أنتم\nإذ فسقكم من فعلكم فعودوا باللائمة على أنفسكم وامقتوها بدل أن تنضحوا\nبالشر على من لا ذنب لهم في خذلانها . أتصور اليهود قبل الوصول إلى هذه\nالجملة ينتفخون ظانين أن المسلمين يستعطفونهم بذكر الإيمان بما أنزل من\nقبل، فجاء قول الله (وَأَنَّ أَكثَرَكُم فاسقونَ) لينكسهم ويقمع غرورهم\nوانتفاخهم .",
"commentary_en": "So you resent our righteousness while you persist in your rebelliousness, and thus you envy us. This is not our fault—it is your fault, since your defiantly disobedient conduct comes from your own actions. So turn the blame upon yourselves and despise your own wrongdoing, instead of spilling evil onto those who have no guilt in your failure. One can imagine the Jews swelling with pride before reaching this clause, thinking the Muslims are trying to win them over by mentioning belief in what was revealed before; then Allah’s words “and that most of you are defiantly disobedient” come to humble them and crush their arrogance and inflated pride."
}
},
{
"qNum": 12,
"question_ar": "فَكُبْكِبُوا فِيهَا هُمْ وَالْغَاوُونَ) [الشعراء : 94 ] لاحظ ! فكبكبوا ... والوقع الصوتي\nللكلمة (فَكُبْكِبُوا يشعرك بركام على بناية ، يُدفع به إلى الحافة ليقع في هاوية\nعلى دفعات ... فَكُبْكِبُوا فِيهَا هُمْ وَالْغَاوُونَ). اذكر آية أخرى تحمل معنى\nمشابها.",
"question_en": "“So they will be overturned into it—both they and the deviators.” [Ash-Shu‘ara: 94] Notice the sound of the word “فَكُبْكِبُوا” evokes something piled up and pushed off an edge into an abyss in repeated dumps. Mention another verse that carries a similar meaning.",
"answer": {
"surah": 8,
"ayahs": [37],
"ayah_ar": "اليَميزَ اللَّهُ الخَبيثَ مِنَ الطَّيِّبِ وَيَجْعَلَ الخَبيثَ بَعضَهُ عَلَى بَعْضٍ فَيَرَكُمَهُ جَمِيعًا\nفَيَجْعَلَهُ فِي جَهَنَّمَ أُولئِكَ هُمُ الخَاسِرُونَ) [الأنفال: 37].",
"ayah_en": "So that Allah may distinguish the evil from the good, and place the evil some of it upon others and heap it all together and put it into Hell. Those are the losers.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 13,
"question_ar": "اذكر آية يخبر الله فيها نبيا من أنبيائه في بداية بلاء بما يدل على أن بلاءه هذا\nسينتهي.",
"question_en": "Mention a verse in which Allah informs one of His prophets, at the beginning of a trial, with something indicating that the trial will end.",
"answer": {
"surah": 12,
"ayahs": [15],
"ayah_ar": "فَلَمَا ذَهَبُوا بِهِ وَأَجْمَعوا أَن يَجْعَلُوهُ فى غَيابَتِ الجُبِ وَأُوحَيْنَا إِلَيْهِ لَتُنَبِّئَنَّهُم بِأَمْرِهِم\nهذا وَهُم لا يَشْعُرُونَ) [يوسف: 15 ]",
"ayah_en": "So when they took him and agreed to put him into the depths of the well, We revealed to him: “You will surely inform them about this affair of theirs while they do not perceive.”",
"commentary_ar": "جاء في تفسير البغوي : (يعني : أوحينا إلى يوسف عليه السلام لتصدقن رؤياك\nولتخبرن إخوتك بصنيعهم هذا وهم لا يشعرون بوحي الله وإعلامه إياه ذلك،\nقاله مجاهد.\nوقيل : معناه : وهم لا يشعرون يوم تخبرهم أنك يوسف وذلك حين دخلوا عليه\nفعرفهم وهم له منكرون.",
"commentary_en": "Al-Baghawi said: “Meaning: We revealed to Yusuf عليه السلام: you will surely fulfill your dream, and you will surely inform your brothers about this deed of theirs, while they do not realize Allah’s revelation to him and His informing him of it—this was said by Mujahid.\nAnd it is also said: it means they do not realize on the day you tell them that you are Yusuf—when they entered upon him and he recognized them while they did not recognize him.”"
}
},
{
"qNum": 14,
"question_ar": "من الظالمين من لا يقتصر على تضييع حق الله في سياسة العباد، بل ويتاجر\nبالدين ويتخذه مطية لأهوائه الشخصية . هؤلاء يتظاهرون بتعظيم حق الله\nبأن يجعلوا 'شيئا' من الأمر له . وحقيقة الأمر أن هذا الذي جعلوه الله يؤول في\nالنهاية لأهوائهم، ولا يحفظون لله حقا ، بينما هم شحيحون جدا بمتاع الدنيا\nأن يصرفوا منه شيئا لتعظيم حرمات الله . اذكر آية تذكرك بحال هؤلاء، واذكر\nلفتة عجيبة في تركيب مطلعها يستغربها من هان حق الله عليهم ممن يرون\nجعل شيء من الأمر لله أحسن من لا شيء من باب (ولا البلاش) !",
"question_en": "Some wrongdoers do not merely neglect Allah’s right in managing people; they trade in religion and use it as a vehicle for personal desires. They pretend to honor Allah’s right by assigning “something” of the matter to Him, but in reality what they assign to Allah ends up serving their own desires, and they do not truly preserve Allah’s right—while they are extremely stingy with worldly goods when it comes to spending anything to honor Allah’s sanctities. Mention a verse that reminds you of their state, and mention the striking rhetorical point at the beginning of the verse that someone with a diminished regard for Allah’s right might find surprising—thinking that giving “something” to Allah is better than nothing ('ولا البلاش').",
"answer": {
"surah": 6,
"ayahs": [136],
"ayah_ar": "﴿وَجَعَلُوا لِلَّهِ مِمَّا ذَرَأَ مِنَ الحَرثِ وَالأنعامِ نَصِيبًا فقالوا هذا لِلَّهِ بِزَعمِهِم وهذا\nلِشُرَكَابِنا فَما كَانَ لِشُرَكَابِهِم فَلا يَصِلُ إِلَى اللهِ وَما كانَ لِلَّهِ فَهُوَ يَصِلُ إِلَى شُرَكَابِهِم\nساءَ ما يحكمونَ) [الأنعام: 136]",
"ayah_en": "And they assign to Allah, from what He has created of crops and livestock, a share and say, “This is for Allah,” by their claim, “and this is for our partners.” But what is for their partners does not reach Allah, while what is for Allah reaches their partners. Evil is what they judge.",
"commentary_ar": "كان المتوقع أن نقرأ ( وجعلوا لشركائهم مما ذرأ الله من الحرث والأنعام\nنصيباً ) ، بحيث يكون الإنكار على هذا الجعل للشركاء.\nلكن الآية عدلت عن هذا إلى وَجَعَلُوا لِلَّهِ ، مع أن القارئ قد يرى هذا الجعل الله\nمحموداً بذاته ، إذ أنهم جعلوا ' شيئا ما ' لله على الأقل !\nلكن هذا المطلع للآية يعلمنا أنه لا منة ولا فضل في جعل شيء لله ، وإنما الخلق\nوالأمر كله لله . فمن جعل شيئا منه لله فلا يقال : أحسن في هذه الحزئية، بل\nهو مذموم بالكلية.",
"commentary_en": "One might expect the wording to be: “And they assigned to their partners, from what Allah created of crops and livestock, a share,” so that the condemnation would be directed at assigning a share to the partners.\nBut the verse shifts instead to: “And they assign to Allah…” even though a reader might assume that assigning something to Allah is praiseworthy in itself—since they gave “something” to Allah at least!\nYet this opening teaches that there is no favor or merit in assigning “something” to Allah, for all creation and command belong entirely to Allah. Whoever assigns a portion of it to Allah is not to be praised for that “partial” act; rather, he is blameworthy altogether."
}
},
{
"qNum": 15,
"question_ar": "اذكر آية بمطلع مشابه للآية السابقة يُنكر على من جعل شيئا من الأمر لله .",
"question_en": "Mention a verse with an opening similar to the previous verse, condemning those who assign “a part” of the matter to Allah.",
"answer": {
"surah": 43,
"ayahs": [15],
"ayah_ar": "﴿وَجَعَلُوا لَهُ مِن عِبَادِهِ جُزءًا إِنَّ الإنسانَ لَكَفورٌ مُبِينٌ) [الزخرف : 15].",
"ayah_en": "And they have assigned to Him a portion of His servants. Indeed, man is clearly ungrateful.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 16,
"question_ar": "اذكر آية يستدل بها بعض العلماء على كروية الأرض.",
"question_en": "Mention a verse that some scholars use as evidence for the earth’s roundness.",
"answer": {
"surah": 39,
"ayahs": [5],
"ayah_ar": "﴿خَلَقَ السَّمَاوَاتِ وَالأَرْضَ بِالحَقِّ يُكَوِّرُ اللَّيْلَ عَلَى النَّهَارِ وَيُكَوِّرُ النَّهَارَ عَلَى اللَّيلِ\nوَسَخَّرَ الشَّمْسَ وَالقَمَرَ كُلٌّ يَجرى لِأَجَلٍ مُسَمًّى أَلَّا هُوَ الْعَزِيزُ الغَفَّارُ﴾ [الزمر: 5]",
"ayah_en": "He created the heavens and the earth in truth. He wraps the night over the day and wraps the day over the night, and He has subjected the sun and the moon—each running for a specified term. Unquestionably, He is the Exalted in Might, the Forgiving.",
"commentary_ar": "قال ابن تيمية - في مجموع الفتاوى - : ( فقد اتفق أهل التفسير واللغة على أن\n'الفلك' هو المستدير والمعرفة لمعاني كتاب الله إنما تؤخذ من هذين\nالطريقين: من أهل التفسير الموثوق بهم من السلف ومن اللغة: التي نزل\nالقرآن بها وهي لغة العرب. وقال تعالى: ﴿يُكَوِّرُ اللَّيْلَ عَلَى النَّهَارِ وَيُكَوِّرُ النَّهَارَ\nعَلَى اللَّيلِ قالوا: و 'التكوير' التدوير يقال: كورت العمامة وكورتها: إذا\nدورتها ) . إلى أن قال ابن تيمية: ( والحركة قائمة بالجسم المتحرك فإذا كان\nالزمان التابع للحركة التابعة للجسم موصوفا بالاستدارة كان الجسم أولى\nبالاستدارة). يعني: أن وصف الليل والنهار بالتكوير (الاستدارة) في الآية\nيقتضي أن تكون الأرض نفسها مستديرة.",
"commentary_en": "Ibn Taymiyyah said in Majmu‘ al-Fatawa: “The people of tafsir and the people of the Arabic language have agreed that ‘falak’ refers to that which is round; and knowledge of the meanings of Allah’s Book is taken from these two paths: trustworthy early exegetes, and the language in which the Qur’an was revealed—the Arabic language. Allah said: ‘He wraps the night over the day and wraps the day over the night.’ They said: ‘takwir’ means turning/rolling; it is said: I wrapped the turban—i.e., I wound it around.” Then Ibn Taymiyyah said: “Motion is an attribute of the moving body; so if the time that follows the motion that follows the body is described as being circular, then the body is more deserving of being circular.” Meaning: describing night and day as being “wrapped/rolled” (circularly) implies that the earth itself is round."
}
},
{
"qNum": 17,
"question_ar": "يظن البعض أن بإمكانه أن يعصي الله تعالى ثم يتوب إليه في الوقت الذي\nيريد ! وينسى قول الله تعالى ﴿وَاعْلَمُوا أَنَّ اللَّهَ يَحُولُ بَيْنَ الْمَرْءِ وَقَلْبِهِ﴾\n[الأنفال : 24] . اذكر محل الشاهد من آية يحمل نفس المعنى من أن المرء لا\nيستطيع أن يتوب ما لم يأذن الله له بهذه التوبة.",
"question_en": "Some think they can disobey Allah and then repent whenever they want, forgetting Allah’s statement: “And know that Allah intervenes between a person and his heart” [Al-Anfal: 24]. Mention the point of evidence from a verse carrying the same meaning: that a person cannot repent unless Allah permits them that repentance.",
"answer": {
"surah": 9,
"ayahs": [118],
"ayah_ar": "﴿وَعَلَى الثَّلَاثَةِ الَّذِينَ خُلِّفُوا حَتَّى إِذا ضَاقَت عَلَيْهِمُ الأَرضُ بِمَا رَحُبَت وَضَاقَتْ عَلَيْهِم\nأَنفُسُهُم وَظَنُّوا أَن لا مَلجَأَ مِنَ اللَّهِ إِلَّا إِلَيْهِ ثُمَّ تَابَ عَلَيْهِم لِيَتُوبُوا إِنَّ اللَّهَ هُوَ التَّوَّابُ\nالرَّحِيمُ﴾ [التوبة: 118].",
"ayah_en": "And [He also forgave] the three who were left behind—until, when the earth closed in on them in spite of its vastness and their souls closed in on them, and they were certain that there is no refuge from Allah except to Him—then He turned to them so that they might repent. Indeed, Allah is the Accepting of repentance, the Merciful.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 18,
"question_ar": "آيات أحكام كثيرة في سورة واحدة تنظم مسألة اجتماعية، ومع ذلك يتهاون\nكثير من المسلمين فيها بدوافع منها الفجور في الخصومة . يلاحظ أن الله تعالى\nتهدد بعد آيات الأحكام من يخالف أمره تهديدا شديدا، وقد يحسب قارئ\nالآيات أن هذا التهديد لا علاقة له بما سبق من آيات الأحكام، مع أن مخالفتها\nداخلة في هذا التهديد والوعيد دخولاً أولياً . اذكر آية الوعيد المقصودة.",
"question_en": "There are many legal rulings in one surah regulating a social matter, yet many Muslims are lax about them, driven by motives such as wickedness in disputes. After these legal verses, Allah issues a severe threat to those who disobey His command, and a reader may think this threat is unrelated to the legal rulings—though violating them is included in this threat foremost. Mention the intended verse of warning.",
"answer": {
"surah": 65,
"ayahs": [8, 9, 10],
"ayah_ar": "﴿وَكَأَيِّن مِن قَرْيَةٍ عَتَت عَن أَمْرِ رَبِّهَا وَرُسُلِهِ فَحاسَبناها حِسَابًا شَدِيدًا وَعَذَّبناها\nعَذَابًا نُكْرًا فَذاقَت وَبالَ أَمرِها وَكَانَ عَاقِبَةُ أَمرِها خُسْرًا أَعَدَّ اللَّهُ لَهُم عَذَابًا\nشَدِيدًا فَاتَّقُوا اللهَ يا أُولي الألبابِ الَّذينَ آمَنوا قَد أَنزَلَ اللَّهُ إِلَيْكُم ذِكرًا)\n]10-8 : الطلاق",
"ayah_en": "And how many a town rebelled against the command of its Lord and His messengers, so We took it to severe account and punished it with a terrible punishment.\nSo it tasted the consequence of its affair, and the outcome of its affair was loss.\nAllah has prepared for them a severe punishment; so fear Allah, O people of understanding who have believed. Allah has sent down to you a reminder.",
"commentary_ar": "قال ابن عاشور في التحرير والتنوير: (لَمّا شُرِعَت لِلمُسلِمِينَ أَحكامُ كَثِيرَة مِنَ\nالطلاق ولواحقه، وكانَت كُلُّها تَكَالِيفَ قَد تُعْجِمُ بَعضُ الْأَنفُسِ عَن إِيفَاءِ حَقٌّ\nالامتثال لها تَكاسُلًا أو تقصيرًا رَغَبَ في الامتثالِ لَها بِقَولِهِ وَمَن يَتَّقِ اللَّهَ يَجْعَلْ\nلَهُ مَخْرَجًا) [الطلاق : 2 ] ، وقولِهِ وَمَن يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مِن أَمْرِهِ يُسْرًا) [الطلاق: 4]،\nوقَولِهِ وَمَن يَتَّقِ اللَّهَ يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ ويُعْظِمْ لَهُ أَجْرًا) [الطلاق: 5 ] ، وقولِهِ\nسَيَجْعَلُ اللَّهُ بَعْدَ عُسْرِ يُسْرًا) [الطلاق : 7].\nوحَذَرَ اللَّهُ النَّاسَ فِي خِلَالِ ذَلِكَ مِن مُخالَفَتِها بِقَولِهِ وَتِلْكَ حُدُودُ اللَّهِ وَمَن\nيَتَعَدَّ حُدُودَ اللَّهِ فَقَدْ ظَلَمَ نَفْسَهُ ﴾ [الطلاق : 1 ] ، وقَولِهِ ذَلِكُم يُوعَظُ بِهِ مَن\nكانَ يُؤْمِنُ بِاللَّهِ وَاليَوْمِ الآخِرِ) [الطلاق: 2] أعقبها بِتَحْذِيرٍ عَظِيمٍ مِنَ الوُقوعِ فِي\nمُخالَفَةِ أَحكامِ اللَّهِ وَرُسُلِهِ لِقلَّةِ العناية بمراقبتهم ، لِأَنَّ الصَّغِيرَ يُثِيرُ الجَلِيلَ،\nفَذَكَّرَ المُسلِمِينَ (وَلَيسُوا مِمَّن يَعتُوا عَلى أمرِ رَبِّهِم بِمَا حَلَّ بِأَقوامٍ مِن عِقابِ\nعَظِيمٍ عَلَى قِلَّةِ اكتِراثِهِم بِأمرِ اللَّهِ وَرُسُلِهِ لِئَلَّا يَسلُكُوا سَبِيلَ التَّهَاوُنِ بِإِقَامَةِ\nالشَّرِيعَةِ ، فَيُلْقِي بِهِم ذَلِكَ فِي مَهْواةِ الضَّلَالِ)).",
"commentary_en": "Ibn ‘Ashur said in At-Tahrir wa At-Tanwir: when many rulings regarding divorce and its consequences were legislated for the Muslims—obligations that some souls may find difficult to fulfill due to laziness or shortcoming—Allah encouraged compliance through His statements: “And whoever fears Allah—He will make for him a way out” [At-Talaq: 2], “And whoever fears Allah—He will make for him ease in his affair” [At-Talaq: 4], “And whoever fears Allah—He will remove from him his misdeeds and magnify for him his reward” [At-Talaq: 5], and “Allah will bring about, after hardship, ease” [At-Talaq: 7].\nIn the midst of that, Allah warned people against violating those rulings with His statements: “And these are the limits of Allah; and whoever transgresses the limits of Allah has certainly wronged himself” [At-Talaq: 1], and “That is admonished thereby whoever believes in Allah and the Last Day” [At-Talaq: 2]. After these, He followed them with a tremendous warning against falling into مخالفة أحكام الله ورسله due to negligence in مراقبة (watchfulness), because small lapses can lead to major ones. He reminded the Muslims—though they are not among those who rebel against their Lord’s command—of what befell previous peoples of severe punishment due to their lack of concern for Allah’s command and His messengers, so that they do not take the path of laxity in establishing the Shari‘ah, which would plunge them into the abyss of misguidance."
}
},
{
"qNum": 19,
"question_ar": "في محاولات التوفيق بين الإسلام وخرافة التطور يستدل البعض بقول الله\nتعالى : ﴿ذَلِكَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْعَزِيزُ الرَّحِيمُ الَّذِي أَحْسَنَ كُلَّ شَيْءٍ خَلَقَهُ\nوَبَدَأَ خَلْقَ الْإِنسَانِ مِن طِينٍ ثُمَّ جَعَلَ نَسْلَهُ مِن سُلَالَةٍ مِّن مَّاءٍ مَّهِينٍ ثُمَّ سَوَّاهُ\nوَنَفَخَ فِيهِ مِن رُّوحِهِ) [السجدة : 6-9] ، ظانين أن (ثُمَّ) تعني دائما الترتيب مع\nالتراخي. بينما الحقيقة أنها قد تكون لمجرد ترتيب الذكر أو الترتيب الرتبي .\nاذكر آية تتحدث عن شعائر الحج و (ثُمَّ) فيها هي - بوضوح - ليست للترتيب.",
"question_en": "In attempts to reconcile Islam with the myth of evolution, some cite Allah’s statement: “...then (ثُمَّ) He made his progeny...” [As-Sajdah: 6–9], assuming that “ثُمَّ” always indicates chronological sequencing with delay. But in reality it may be for ordering the mention (ترتيب الذكر) or for rank/importance. Mention a verse about Hajj rites where “ثُمَّ” is clearly not for chronological ordering.",
"answer": {
"surah": 2,
"ayahs": [199],
"ayah_ar": "ثُمَّ أَفيضوا مِن حَيثُ أَفاضَ النَّاسُ وَاسْتَغْفِرُوا اللَّهَ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ)\n]199 :البقرة[",
"ayah_en": "Then depart from the place from where the people depart and seek Allah’s forgiveness. Indeed, Allah is Forgiving, Merciful.",
"commentary_ar": "على قول من قال أن الإفاضة هنا معناها الإفاضة من عرفات.",
"commentary_en": "According to the view that the “departure” (الإفاضة) here means departing from ‘Arafah."
}
},
{
"qNum": 20,
"question_ar": "اذكر آية تحذر من سن السنة السيئة بأن يكون الإنسان في طليعة من يعمل\nعملا محرما أو يرفض دعوة إلى حق.",
"question_en": "Mention a verse warning against initiating an evil practice—being among the first to commit something forbidden or to reject a call to truth.",
"answer": {
"surah": 2,
"ayahs": [41],
"ayah_ar": "وَآمِنوا بِما أَنزَلتُ مُصَدِّقًا لِما مَعَكُم وَلا تَكونوا أَوَّلَ كَافِرٍ بِهِ وَلَا تَشتَرُوا بِآياتى\nثَمَنًا قَلِيلًا وَإِيَّايَ فَاتَّقُونِ) [البقرة : 41].",
"ayah_en": "And believe in what I have sent down confirming what is with you, and do not be the first to disbelieve in it. And do not exchange My verses for a small price, and fear Me alone.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 21,
"question_ar": "سألتني ابنتي سارة رحمها الله : ما دام أمر الدجال معلوما بينه لنا نبينا فكيف\nيتبعه أناس من المسلمين عند خروجه ؟ فقلت لها : من عقوبة المعاصي نسيان\nالعلم النافع، واستحضرت قول ابن تيمية في مجموع الفتاوى :\n( من الذنوب ما يكون سببا لخفاء العلم النافع أو بعضه، بل يكون سببا\nلنسيان ما عَلِمَ ولاشتباه الحق بالباطل ) . اذكر آية تدل على ذلك.",
"question_en": "My daughter Sarah—may Allah have mercy on her—asked: since the matter of the Dajjal is known and explained by our Prophet, how will some Muslims follow him when he emerges? I answered: among the punishments of sins is forgetting beneficial knowledge, recalling Ibn Taymiyyah’s statement that some sins cause beneficial knowledge to become hidden or forgotten, and cause truth to be confused with falsehood. Mention a verse indicating that.",
"answer": {
"surah": 5,
"ayahs": [13],
"ayah_ar": "فَبِمَا نَقْضِهِم ميثاقَهُم لَعَنَاهُم وَجَعَلنا قُلوبَهُم قاسِيَةً يُحَرِّفُونَ الكَلِمَ عَن مَواضِعِهِ\nوَنَسُوا حَظًّا مِمَّا ذُكِّرُوا بِهِ وَلا تَزالُ تَطَّلِعُ عَلى خَابِنَةٍ مِنهُم إِلَّا قَلِيلًا مِنهُم فَاعْفُ\nعَنهُم وَاصْفَح إِنَّ اللَّهَ يُحِبُّ المُحْسِنِينَ) [المائدة : 13].",
"ayah_en": "So for their breaking of their covenant We cursed them and made their hearts hard. They distort words from their proper places, and they forgot a portion of what they were reminded of. And you will still observe treachery from them except a few of them; so pardon them and overlook. Indeed, Allah loves the doers of good.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 22,
"question_ar": "في قوله تعالى في سورة التوبة : أَنَّ اللَّهَ بَرِيءٌ مِّنَ الْمُشْرِكِينَ وَرَسُولُهُ)، معلوم أنها\nليست بالكسر ( ورسوله ) ، لكن لاحظ أنها ليست بالفتح أيضًا ( ورسوله ) .\nفهذا عطف جمل .. كلمة عبرت عن جملة .\nاذكر عطف جمل بحيث تعبر كلمة عن جملة بما يرفع استشكالا يرد في الذهن\nعن آية .",
"question_en": "In Allah’s statement in Surat At-Tawbah: “that Allah is free from the polytheists—and His Messenger,” it is known it is not read with kasrah, and notice it is not read with fatḥah either; this is coordination of clauses—one word standing for a whole clause. Mention an example of clause coordination where a single word represents a clause in a way that removes a potential confusion about the verse.",
"answer": {
"surah": 5,
"ayahs": [25],
"ayah_ar": "قالَ رَبِّ إِنِّي لا أَمْلِكُ إِلَّا نَفسي وَأَخى فَافْرُق بَينَنا وَبَينَ القوم الفاسقين)\n[المائدة : 25]",
"ayah_en": "He said, “My Lord, indeed I do not possess except myself and my brother, so separate between us and the defiantly disobedient people.”",
"commentary_ar": "قال القرطبي في تفسيره: (قَولُهُ تَعَالَى : قَالَ رَبِّ إِنِّي لَا أَمْلِكُ إِلَّا نَفْسِي وَأَخِي)\nلِأَنَّهُ كَانَ يُطِيعُهُ . وَقِيلَ المَعنَى : إِنِّي لَا أَمْلِكُ إِلَّا نَفْسِي، ثُمَّ ابْتَدَأَ فَقَالَ : (وَأَخِي أَي\nوَأَخِي أَيضًا لَا يَمْلِكُ إِلَّا نَفْسَهُ ، فَأَخِي عَلَى القَولِ الأَوَّلِ فِي مَوضِعِ نَصِبٍ عَطَفًا\nعَلَى نَفْسِي، وَعَلَى الثَّانِي فِي مَوضِعِ رَفع ، وَإِن شِئتَ عَطَمْتَ عَلَى اسْمِ إِنَّ وَهِيَ\nاليَاءُ، أَي إِنِّي وَأَخِي لَا نَمْلِكُ إِلَّا أَنفُسَنَا . وَإِن شِئتَ عَطَفَتَ عَلَى الْمُصْمَرِ فِي أَمْلِكُ\nكَأَنَّهُ قَالَ : لَا أَمْلِكُ أَنَا وَأَخِي إِلَّا أَنفُسَنَا).",
"commentary_en": "Al-Qurtubi said in his tafsir regarding Allah’s words: “He said: My Lord, indeed I do not possess except myself and my brother,” because his brother used to obey him. It is also said that the meaning is: “I do not possess except myself,” then he began a new clause and said: “and my brother,” i.e., “and my brother also does not possess except himself.” So “my brother” according to the first view is in the accusative as a conjunction to “myself,” and according to the second view it is in the nominative as the start of a new clause. If you wish, you may also conjoin it to the اسم إنّ (the “ياء”), i.e., “Indeed I and my brother do not possess except ourselves.” And if you wish, you may conjoin it to the implied subject in “I possess,” as though he said: “I do not possess—I and my brother—except ourselves.”"
}
},
{
"qNum": 23,
"question_ar": "إدمان المعاصي قد يجعل صاحبها يتجرأ على الكبائر علناً بلا حياء. اذكر آية\nتشير إلى هذا المعنى.",
"question_en": "Persisting in sins may cause a person to dare commit major sins openly without shame. Mention a verse indicating this meaning.",
"answer": {
"surah": 11,
"ayahs": [78],
"ayah_ar": "وَجَاءَهُ قَومُهُ يُهْرَعُونَ إِلَيْهِ وَمِن قَبْلُ كانوا يَعْمَلُونَ السَّيِّئَاتِ قَالَ يا قوم هؤلاء بناتى\nهُنَّ أَطْهَرُ لَكُم فَاتَّقُوا اللَّهَ وَلا تُخزون فى ضيفى أَلَيسَ مِنكُم رَجُلٌ رَشِيدٌ)\n]78 : هود[",
"ayah_en": "And his people came rushing to him—and before that they had been doing evil deeds. He said, “O my people, these are my daughters; they are purer for you. So fear Allah and do not disgrace me concerning my guests. Is there not among you a man of right judgment?”",
"commentary_ar": "قال السعدي : ( وَجاءَهُ قَومُهُ يُهْرَعُونَ إِلَيْهِ ) أي : يسرعون ويبادرون ، يريدون\nأضيافه بالفاحشة ، التي كانوا يعملونها).\nوقال بعض السلف : ( ومن عقوبة السيئة السيئة بعدها).",
"commentary_en": "As-Sa‘di said: “And his people came rushing to him,” meaning they hurried and hastened, intending obscene acts with his guests—acts they used to commit.\nAnd some of the Salaf said: “Among the punishments of a sin is another sin after it.”"
}
},
{
"qNum": 24,
"question_ar": "يحرص الناس على تحصيل أسباب السعادة المادية . لكن من عقوبة الله عز\nوجل للمعرضين عن طاعته والإخلاص له أنه قد يجعل سبب السعادة هو\nذاته سبب الشقاء لهم . اذكر آيتين متشابهتين من سورة واحدة تبين أن ما هو\nسبب سعادة عادة يجعله الله سبب شقاء لبعض الناس.",
"question_en": "People strive to obtain material causes of happiness. But among Allah’s punishments for those who turn away from obeying Him and being sincere to Him is that He may make the very cause of happiness become the cause of misery for them. Mention two similar verses from one surah showing that something usually a cause of happiness is made by Allah a cause of misery for some people.",
"answer": {
"surah": 9,
"ayahs": [55, 85],
"ayah_ar": "فَلا تُعجِبكَ أَمْوالُهُم وَلا أَولادُهُم إِنَّما يُرِيدُ اللهُ لِيُعَذِّبَهُم بِها فِي الحَيَاةِ الدُّنيا وَتَرْهَقَ\nأَنفُسُهُم وَهُم كَافِرُونَ) [التوبة : 55]\nوَلا تُعجِبكَ أَمْوالُهُم وَأَولادُهُم إِنَّما يُرِيدُ اللهُ أَن يُعَذِّبَهُم بِها فِي الدُّنيا وَتَرْهَقَ أَنفُسُهُم\nوَهُم كافِرونَ) [التوبة : 85].",
"ayah_en": "So do not let their wealth or their children impress you. Allah only intends to punish them through it in worldly life, and that their souls should depart while they are disbelievers. (At-Tawbah: 55)\nAnd do not let their wealth or their children impress you. Allah only intends to punish them through it in this world, and that their souls should depart while they are disbelievers. (At-Tawbah: 85)",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 25,
"question_ar": "علم الله عز وجل من عباد له شوقا إلى لقائه فصبرهم بآية . ما هي هذه الآية ؟",
"question_en": "Allah knew of some of His servants that they long to meet Him, so He comforted them with a verse. What is this verse?",
"answer": {
"surah": 29,
"ayahs": [5],
"ayah_ar": "مَن كان يرجو لقاءَ اللَّهِ فَإِنَّ أَجَلَ اللَّهِ لَآتٍ وَهُوَ السميع العليم) [العنكبوت : 5].",
"ayah_en": "Whoever hopes for the meeting with Allah—indeed, the appointed time of Allah is coming. And He is the Hearing, the Knowing.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 26,
"question_ar": "يعرض أهل الباطل الشبهات. فيأتي أهل العلم ليعالجوها ويردوها. فيرون\nتهافت ما يقف في طريق دينهم القويم ، بل وقد يظهر في ثنايا الرد على الشبهة\nجماليات للدين ما كانت ظاهرة لهم قبلها ، مما يزيد رسوخ اليقين في قلوب\nالمؤمنين . اذكر آية تذكرك بهذا المعنى .",
"question_en": "People of falsehood present doubts; then the people of knowledge come to address and refute them, and they see the flimsiness of what stands in the way of their straight religion. Indeed, within the refutation, beauties of the religion may appear that were not obvious before, increasing certainty in believers’ hearts. Mention a verse that reminds you of this meaning.",
"answer": {
"surah": 34,
"ayahs": [5, 6],
"ayah_ar": "وَالَّذِينَ سَعَوا فى آياتِنَا مُعاجِزِينَ أُولئِكَ لَهُم عَذابٌ مِن رِجْزٍ أَلِيمٌ * وَيَرَى الَّذِينَ\nأوتُوا العِلمَ الَّذِي أُنزِلَ إِلَيكَ مِن رَبِّكَ هُوَ الحَقَّ وَيَهدى إلى صراط العزيز الحميد)\n]6 : سبأ[",
"ayah_en": "But those who strive against Our verses, trying to thwart them—those will have a punishment of painful wrath.\nAnd those who have been given knowledge see that what has been revealed to you from your Lord is the truth, and it guides to the path of the Exalted in Might, the Praiseworthy.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 27,
"question_ar": "آيتان متتاليتان ذكر الله في أولاهما ثلاث صفات لأهل الكتاب واقتصر في\nالثانية على صفتين، وفي عدم ذكر الثالثة ملمح من ملامح عزة المسلم. ما هما\nهاتان الآيتان ؟",
"question_en": "Two consecutive verses: in the first, Allah mentions three traits of the People of the Book; in the second, He limits it to two traits. In omitting the third trait, there is a subtle indication of the Muslim’s dignity. What are those two verses?",
"answer": {
"surah": 5,
"ayahs": [62, 63],
"ayah_ar": "وَتَرى كَثِيرًا مِنهُم يُسارِعُونَ فِي الإِثْمِ وَالعُدوانِ وَأَكْلِهِمُ السُّحَتَ لَبِئْسَ ما كانوا\nيَعْمَلُونَ لَولا يَنهَاهُمُ الرَّبَانِيّونَ وَالأَحبارُ عَن قَولِهِمُ الإِثْمَ وَأَكْلِهِمُ السُّحْتَ لَبِئْسَ\nما كانوا يصنعون) [المائدة : 62-63]",
"ayah_en": "And you see many of them hastening into sin and aggression and the consumption of what is unlawful. How wretched is what they have been doing.\nWhy do the rabbis and scholars not forbid them from their sinful speech and their consuming of what is unlawful? How wretched is what they used to produce.",
"commentary_ar": "قال ابن عاشور (واقتصر في توبيخ الربانيين على ترك نهيهم عن قول الإثم\nوأكل السحت ، ولم يذكر العدوان إيماء إلى أن العدوان يزجرهم عنه المسلمون\nولا يلتجئون في زجرهم إلى غيرهم، لأن الاعتماد في النصرة على غير المجني عليه،\nضعف ).",
"commentary_en": "Ibn ‘Ashur said: He limited the reproach of the rabbis and scholars to their failure to forbid “sinful speech” and “consuming the unlawful,” and did not mention “aggression,” hinting that Muslims restrain them from aggression and do not need to seek others to restrain them—because relying for support upon someone other than the one wronged is weakness."
}
},
{
"qNum": 28,
"question_ar": "آية نظمها بديع ! ذكر الله فيها إحدى أفعال أهل الكتاب الماضية بصيغة\nتشعر بالتجدد لبيان شناعتها وليدل على مشاركة المخاطبين زمن النبي فيها\nوإن بعد العهد عنها. ومع ذلك ذكر الله كلمتين في وسط السياق بما يقطع\nأطماعهم أن يفعلوا مثلها مع النبي صلى الله عليه وسلم، ويسكن قلب النبي\nأنهم لن يفعلوا مثلها معك . ما هما الكلمتان ؟",
"question_en": "A verse with remarkable composition: Allah mentions one of the past deeds of the People of the Book in a form suggesting recurrence, to show its ugliness and that those addressed in the Prophet’s time share in it even if long ago. Yet in the middle of the context Allah mentions two words that cut off their hopes of doing the same to the Prophet ﷺ, and reassure the Prophet that they will not do it to him. What are those two words?",
"answer": {
"surah": 2,
"ayahs": [91],
"ayah_ar": "( وَإِذَا قِيلَ لَهُمْ آمِنُواْ بِمَا أَنزَلَ اللّهُ قَالُواْ نُؤْمِنُ بِمَا أُنزِلَ عَلَيْنَا وَيَكْفُرُونَ بِمَا وَرَاءَهُ\nوَهُوَ الْحَقُّ مُصَدِّقًا لِّمَا مَعَهُمْ قُلْ فَلِمَ تَقْتُلُونَ أَنبِيَاءَ اللّهِ مِن قَبْلُ إِن كُنتُم مُّؤْمِنِينَ )\n[البقرة : 91 ]",
"ayah_en": "And when it is said to them, “Believe in what Allah has revealed,” they say, “We believe in what was revealed to us,” and they disbelieve in what came after it, while it is the truth confirming what is with them. Say, “Then why did you kill the prophets of Allah before, if you were believers?”",
"commentary_ar": "ولقد كان التعبير بهذه الصيغة مع ذكر الأنبياء بلفظ عام مما يفتح بابا من\nالإيحاش لقلب النبي العربي الكريم وباباً من الإطماع لأعدائه في نجاح تدابيرهم\nومحاولاتهم لقتله . فانظر كيف أسعفنا بالاحتراس عن ذلك كله بقوله (من\nقبل ) فقطع بهذه الكلمة أطماعهم وثبت بها قلب حبيبه إذ كانت بمثابة وعده\nإياه بعصمته من الناس. (النبأ العظيم لعبد الله دراز)",
"commentary_en": "Expressing it in this way—mentioning “the prophets” in a general manner—could open a door of unease in the noble Arab Prophet’s heart, and a door of hope for his enemies that their schemes and attempts to kill him might succeed. So observe how Allah helped us by guarding against all of that with His words “من قبل” (“before”). With these two words He cut off their hopes and strengthened the heart of His beloved, as they were like a promise of protecting him from people. (An-Naba’ Al-‘Azim by ‘Abdullah Draz)"
}
},
{
"qNum": 29,
"question_ar": "قال ابن تيمية : ( كيف تطلب الدليل على من هو دليل كل شيء ؟!) وهو بذلك\nيشير إلى حقيقة أن دلالة الله على الأشياء والحقائق أقوى من دلالتها\nعليه . فإذا فقد الإنسان الإيمان بالله فإنه لا يعود بإمكانه الإيمان بأي شيء على\nأساس علمي ، وإذا أنكر وجود الله فإن عقله ينحرف عن كل حق . فالإيمان بالله\nمبدأ كل عقل سليم للوصول للحق في كل شيء . اذكر آية قد تكون هي الأدل\nعلى هذا المعنى.",
"question_en": "Ibn Taymiyyah said: “How can you seek proof for the One who is the proof for everything?” He points to the truth that Allah’s indication of things and realities is stronger than their indication of Him. If a person loses faith in Allah, they can no longer believe in anything on a sound basis; if they deny Allah’s existence, their mind deviates from every truth. Faith in Allah is the starting point of every sound mind for reaching the truth in everything. Mention a verse that may be the clearest for this meaning.",
"answer": {
"surah": 45,
"ayahs": [6],
"ayah_ar": "تِلْكَ آيَاتُ اللَّهِ نَتْلُوهَا عَلَيْكَ بِالْحَقِّ فَبِأَيِّ حَدِيثٍ بَعْدَ اللَّهِ وَآيَاتِهِ يُؤْمِنُونَ )\n[الجاثية : 6 ].",
"ayah_en": "These are the verses of Allah which We recite to you in truth. So in what statement after Allah and His verses will they believe?",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 30,
"question_ar": "تجد من العصاة من تذكره بنعم الله عليه فيقول : أنا أصلاً لا أريدها، ولو\nعشت في غيرها لكان أحب إلي !\nاذكر آية يمكن أن يفهم من سياقها أن قوماً جحدوا نعمة الله عليهم وطلبوا\nضدها رداً على أنبيائهم أو صالحيهم الذين كانوا يُذكرونهم بهذه النعمة\nليشكروها .",
"question_en": "You find some sinners who, when reminded of Allah’s blessings upon them, say: “I don’t even want them; if I lived without them it would be better for me!” Mention a verse whose context can be understood to show that a people denied Allah’s blessing upon them and asked for the opposite, in response to their prophets or righteous ones who reminded them of the blessing so they would be grateful.",
"answer": {
"surah": 34,
"ayahs": [19],
"ayah_ar": "( فَقَالُوا رَبَّنَا بَاعِدْ بَيْنَ أَسْفَارِنَا وَظَلَمُوا أَنفُسَهُمْ فَجَعَلْنَاهُمْ أَحَادِيثَ وَمَزَّقْنَاهُمْ كُلَّ\nمُمَزَّقٍ إِنَّ فِي ذَلِكَ لَآيَاتٍ لِّكُلِّ صَبَّارٍ شَكُورٍ [سبأ : 19]",
"ayah_en": "So they said, “Our Lord, lengthen the distances between our journeys,” and they wronged themselves. So We made them tales and scattered them in total dispersion. Indeed, in that are signs for every patient, grateful person.",
"commentary_ar": "فالآية الكريمة التي قبلها هي : (وَجَعَلْنَا بَيْنَهُمْ وَبَيْنَ الْقُرَى الَّتِي بَارَكْنَا فِيهَا قُرَّى\nظَاهِرَةً وَقَدَّرْنَا فِيهَا السَّيْرَ سِيرُوا فِيهَا لَيَالِيَ وَأَيَّامًا آمِنِينَ) [سبأ : 18]\nأي أن الله تعالى جعل بين أهل سبأ في اليمن وبين قرى الشام التي بارك فيها\nقرى متقاربة ، وقدر فيها السير بحيث يسيرون من قرية إلى قرية دون مشقة\nحتى يصلوا الشام ، وقال لهم : سيروا فيها ما شئتم من ليل أو نهار في أمن من\nالعدو والجوع والعطش . وكان هذا كله إنعاماً منه سبحانه عليهم.\nلكنهم بدلاً من شكر النعمة قالوا : فَقَالُوا رَبَّنَا بَاعِدْ بَيْنَ أَسْفَارِنَا). قال ابن\nعاشور: ( والأظهر عندي أن يكون هذا القول قالوه جوابا عن مواعظ أنبيائهم\nوالصالحين منهم حين ينهونهم عن الشرك . فَهُم يعظونهم بأن الله أنعم\nعليهم بتلك الرفاهية . فهم يجيبون بهذا القول إفحاما لدعاة الخير منهم)).\nواستدل على ذلك بأن الله تعالى قال في الآيات قبلها 'فأعرضوا ' . فإن\nالإعراض يقتضي دعوة لشيء. ويظهر أن الأنبياء أو الصالحين دعوهم\nفأعرضوا .\nوفي المختصر في التفسير: ( فبطروا نعمة الله عليهم بتقريب المسافات، وقالوا :\nربنا باعد بين أسفارنا بإزالة تلك القرى حتى نذوق تعب الأسفار، وتظهر مزية\nركائبنا ، وظلموا أنفسهم ببطرهم نعمة الله وإعراضهم عن شكره وحسدهم\nللفقراء منهم ( يعني إرادة التميز عن الفقراء منهم ، فصيرناهم أحاديث\nيتحدث بها من بعدهم ، وفرقناهم في البلاد كل تفريق ، بحيث لا يتواصلون فيما\nبينهم).",
"commentary_en": "The preceding verse is: “And We placed between them and the towns which We had blessed, towns within sight, and We measured the journey between them: ‘Travel through them by nights and days in safety.’” [Saba’: 18]\nMeaning: Allah placed between the people of Saba’ in Yemen and the towns of Sham which He blessed, close, visible towns, and made travel between them measured such that they could move from town to town without hardship until they reached Sham. He told them: travel through them as you wish by night or day, secure from enemies, hunger, and thirst. All of that was a blessing from Him upon them.\nBut instead of gratitude they said: “Our Lord, lengthen the distances between our journeys.” Ibn ‘Ashur said: “What seems most apparent to me is that they said this in response to the admonitions of their prophets and righteous ones among them when those warned them against shirk. They admonished them by reminding them that Allah had blessed them with that ease, and they replied with this statement as a way of silencing those callers to good.”\nHe reasoned this because Allah said in the earlier verses: “But they turned away,” and turning away implies that there was a call to something; it appears that prophets or righteous people called them, and they turned away.\nIn Al-Mukhtasar fi at-Tafsir: “They became ungrateful for Allah’s blessing of shortening distances, and they said: ‘Our Lord, lengthen the distances between our journeys,’ by removing those towns so we taste the hardship of travel and the advantage of our mounts becomes apparent. They wronged themselves by their ingratitude for Allah’s blessing, turning away from thanking Him, and envying the poor among them—meaning: wanting to distinguish themselves from the poor among them. So We made them stories told after them, and scattered them in every dispersion, such that they no longer remain connected with one another.”"
}
}
]
}