{
"juz": 26,
"items": [
{
"qNum": 1,
"question_ar": "اذكر آية قد يستدل بها المستدل خطأً على عدم وجود أية بقية من دعوة\nالرسل عليهم السلام لدى المشركين في عهد النبي .",
"question_en": "Mention a verse that someone might mistakenly use as evidence that there remained no trace of the messengers’ call among the polytheists in the Prophet’s time.",
"answer": {
"surah": 46,
"ayahs": [4],
"ayah_ar": "قُل أَرَأَيْتُم ما تدعونَ مِن دونِ اللهِ أَرونى ماذا خَلَقُوا مِنَ الْأَرْضِ أَمْ لَهُم شِرْكٌ فِي\nالسماوات ائتونى بِكِتابٍ مِن قَبلِ هذا أَو أَثارَةٍ مِن عِلمٍ إِن كُنتُم صَادِقِينَ)",
"ayah_en": "Say, “Have you considered what you invoke besides Allah? Show me what they have created of the earth. Or do they have any partnership in the heavens? Bring me a book from before this, or any remnant of knowledge, if you are truthful.”",
"commentary_ar": "قال السعدي:\n( قال تعالى : (وَلَقَدْ بَعَثْنَا فِي كُلِّ أُمَّةٍ رَسُولًا أَنِ اعْبُدُوا اللَّهَ وَاجْتَنِبُوا الطَّاغُوتَ)،\nوكل رسول قال لقومه : اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَهِ غَيْرُهُ، فَعُلِم أن جدال\nالمشركين في شركهم غير مستندين فيه على برهان ولا دليل وإنما اعتمدوا\nعلى ظنون كاذبة وآراء كاسدة وعقول فاسدة. يدلك على فسادها استقراء\nأحوالهم وتتبع علومهم وأعمالهم والنظر في حال من أفنوا أعمارهم بعبادته\nهل أفادهم شيئا في الدنيا أو في الآخرة ؟ )",
"commentary_en": "As-Sa‘di said:\nAllah said: “And We certainly sent into every nation a messenger: Worship Allah and avoid false gods,” and every messenger said to his people: Worship Allah; you have no deity other than Him. Thus it is known that the polytheists’ disputation about their shirk is not based on proof or evidence; rather, they relied on false assumptions, stale opinions, and corrupt minds. Its فساد (invalidity) is shown by examining their conditions, tracing their knowledge and deeds, and looking at the state of those who spent their lives worshiping it—did it benefit them in this world or in the Hereafter?"
}
},
{
"qNum": 2,
"question_ar": "ليس شرطا أن ينطبق النص في الكافرين أو المنافقين بكامل جزئياته على\nأحدنا حتى يشعر أنه يخاطبه. وبالتالي فإذا قرأ قارئ آيات تصف الكافرين أو\nالمنافقين وأحس بداية بانطباق الصفات عليه ثم جاءت صفة في الآيات لا\nتنطبق عليه فلا ينبغي أن يشعره ذلك أن الآيات لا تعنيه . بل له من الوعيد\nومن تحقق اسم النفاق فيه بقدر انطباق الآيات عليه ، وله من الإيمان بقدر\nمخالفتها لحاله . اذكر آية يمكن الاستدلال بها على مسلم متنعم بالرغم من\nذكر الكثير من المعاصي فيها، بل واستدل بها أحد الصحابة.",
"question_en": "It is not necessary for a passage about disbelievers or hypocrites to match someone in every detail for them to feel addressed by it. If a reader finds some traits in such verses applying to them, then later finds a trait that does not apply, they should not conclude the verses do not concern them. Rather, they receive warning and a share of hypocrisy to the extent those traits match, and a share of faith to the extent they differ. Mention a verse that can be used as evidence regarding a Muslim enjoying comforts despite many sins being mentioned in it—and a Companion used it as evidence.",
"answer": {
"surah": 46,
"ayahs": [20],
"ayah_ar": "وَيَومَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى النَّارِ أَذهَبْتُم طَيِّبَاتِكُم فِي حَياتِكُمُ الدُّنيا\nوَاسْتَمْتَعْتُم بِها فَاليَومَ تُجْزَونَ عَذابَ الهونِ بِما كنتم تستكبرونَ فِي الأَرْضِ بِغَيرِ\nالحَقِّ وَبِمَا كُنتُم تَفسُقُونَ)",
"ayah_en": "And the Day those who disbelieved are presented to the Fire: “You exhausted your good things in your worldly life and enjoyed them; so today you will be recompensed with the punishment of humiliation for what you used to be arrogant upon the earth without right and for what you used to commit of defiantly disobedient acts.”",
"commentary_ar": "في الحديث الذي رواه الحاكم وقال فيه الذهبي في التلخيص ( على شرط\nالبخاري ومسلم) أن سعدا رضي الله عنه استأذن على ابن عامر وتحته مرافق\nمن حرير فأمر بها فرفعت فدخل عليه وعليه مطرف خز فقال له : استأذنت\nعلي و تحتي مرافق من حرير فأمرت فرفعت فقال له : نعم الرجل أنت يا ابن\nعامر إن لم تكن ممن قال الله عز وجل : أَذهَبتُم طَيِّبَاتِكُم فِي حَياتِكُمُ\nالدنيا). والله لأن أضطجع على جمر الغضا أحب إلي من أن اضطجع عليها.",
"commentary_en": "In the hadith narrated by al-Hakim—about which adh-Dhahabi said in At-Talkhis: “upon the conditions of al-Bukhari and Muslim”—that Sa‘d (may Allah be pleased with him) sought permission to enter upon Ibn ‘Amir, and beneath him were silk cushions. He ordered them removed, then Sa‘d entered and Ibn ‘Amir was wearing a cloak of khazz. He said to him: I sought permission to enter while beneath me were silk cushions and I ordered them removed. Sa‘d replied: Yes, you are a good man, O Ibn ‘Amir—if you are not among those about whom Allah, Mighty and Majestic, said: “You exhausted your good things in your worldly life.” By Allah, to lie on burning coals is more beloved to me than to lie on them."
}
},
{
"qNum": 3,
"question_ar": "آية بمعنى قوله تعالى : (وَإِذَا قَرَأْتَ الْقُرْآنَ جَعَلْنَا بَيْنَكَ وَبَيْنَ الَّذِينَ لَا يُؤْمِنُونَ\nبِالْآخِرَةِ حِجَابًا مَّسْتُورًا وَجَعَلْنَا عَلَى قُلُوبِهِمْ أَكِنَّةً أَن يَفْقَهُوهُ وَفِي آذَانِهِمْ وَقْرًا\nوَإِذَا ذَكَرْتَ رَبَّكَ فِي الْقُرْآنِ وَحْدَهُ وَلَّوْا عَلَى أَدْبَارِهِمْ نُفُورًا ﴾ [الإسراء: 45 -\n.[46",
"question_en": "A verse with the meaning of Allah’s statement: “And when you recite the Qur’an, We place between you and those who do not believe in the Hereafter a concealed partition... and when you mention your Lord alone in the Qur’an, they turn back in aversion.” [Al-Isra’: 45–46].",
"answer": {
"surah": 47,
"ayahs": [16],
"ayah_ar": "وَمِنْهُم مَن يَسْتَمِعُ إِلَيْكَ حَتَّى إِذا خَرَجُوا مِن عِندِكَ قالوا لِلَّذِينَ أُوتُوا العِلم ماذا\nقالَ آنِفًا أُولئِكَ الَّذِينَ طَبَعَ اللهُ عَلى قُلُوبِهِم وَاتَّبَعُوا أَهْوَاءَهُم)",
"ayah_en": "And among them are those who listen to you, until when they depart from you, they say to those who were given knowledge, “What did he just say?” Those are the ones upon whose hearts Allah has set a seal, and they follow their desires.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 4,
"question_ar": "اذكر آيتين بمعنى قوله تعالى : (وَإِنْ أَطَعْتُمُوهُمْ إِنَّكُمْ لَمُشْرِكُونَ) [الأنعام: 121].",
"question_en": "Mention two verses with the meaning of Allah’s statement: “And if you obey them, indeed you would be polytheists.” [Al-An‘am: 121].",
"answer": {
"surah": 47,
"ayahs": [25, 26],
"ayah_ar": "إِنَّ الَّذِينَ ارتدوا عَلَى أَدْبَارِهِم مِن بَعدِ مَا تَبَيَّنَ لَهُمُ الهُدَى الشَّيْطَانُ سَوَّلَ لَهُم وَأَملى\nلَهُم\nذلِكَ بِأَنَّهُم قالوا لِلَّذِينَ كَرِهوا ما نَزَّلَ اللهُ سَنُطِيعُكُم فِي بَعْضِ الأَمْرِ وَاللَّهُ\nيَعْلَمُ إِسرارهم)",
"ayah_en": "Indeed, those who turned back on their heels after guidance had become clear to them—Satan enticed them and prolonged hope for them.\nThat is because they said to those who disliked what Allah sent down, “We will obey you in part of the matter,” and Allah knows their secrets.",
"commentary_ar": "جاء في التحرير والتنوير لابن عاشور - بتصرف - : ( فقوله : (وَإِنْ\nأَطَعْتُمُوهُمْ إِنَّكُمْ لَمُشْرِكُونَ) أي : إن أطعتموهم فيما يجادلونكم فيه، وهو\nالطعن في الإسلام، والشك في صحة أحكامه ، فإنكم صائرون إلى الشرك أو\nالتحقتم بالمشركين ) .\nونجد نفس المعنى هنا في سورة محمد ، حيث جاء في تفسير البغوي\nبتصرف - : ( ذلِكَ بِأَنَّهُم قالوا لِلَّذِينَ كَرهوا ما نَزَّلَ اللَّهُ سَنُطِيعُكُم فِي بَعْضِ\nالأمر يعني المنافقين أو اليهود قالوا للمشركين سنطيعكم في التعاون على\nعداوة النبي - صلى الله عليه وسلم - والقعود عن الجهاد)، فوصفهم الله\nبالردة إِنَّ الَّذِينَ ارتدوا عَلَى أَدْبَارِهِم)).",
"commentary_en": "In At-Tahrir wa At-Tanwir by Ibn ‘Ashur (paraphrased): His statement “And if you obey them, indeed you would be polytheists” means: if you obey them in what they dispute with you about—namely, attacking Islam and doubting the correctness of its rulings—then you will end up in shirk or you will have joined the polytheists.\nWe find the same meaning here in Surah Muhammad, as it appears in Tafsir al-Baghawi (paraphrased): “That is because they said to those who disliked what Allah sent down, ‘We will obey you in part of the matter,’ meaning the hypocrites or the Jews said to the polytheists: we will obey you in cooperating against the Prophet (peace be upon him) and sitting back from jihad.” So Allah described them as turning back: “Indeed, those who turned back on their heels...”"
}
},
{
"qNum": 5,
"question_ar": "يتعامل البعض مع سير الصحابة وكأنهم معصومون لا يخطئون. ومن يظن\nهذا الظن فإنه يسهل تشكيكه في الصحابة . اذكر آية تدل على أنه لولا لطف\nالله بالصحابة في التكاليف الشرعية لبدر منهم ما يفسد دينهم.",
"question_en": "Some people treat the biographies of the Companions as if they were infallible and never erred. Whoever assumes this becomes easily led to doubt them. Mention a verse indicating that were it not for Allah’s gentleness with the Companions in the legal obligations, something could have occurred from them that would corrupt their religion.",
"answer": {
"surah": 47,
"ayahs": [37],
"ayah_ar": "إن يَسأَلكُموها فَيُحفِكُم تَبخَلُوا وَيُخرِج أَضغانَكُم﴾",
"ayah_en": "If He were to ask you for it and press you, you would withhold, and He would bring out your resentments.",
"commentary_ar": "قال الطبري : ( إن يسألكموها): يقول جل ثناؤه : إن يسألكم ربكم أموالكم\nفَيُحْفِكُم ) يقول : فيجهدكم بالمسألة ، ويلح عليكم بطلبها منكم فيلحف،\nتبخلوا : يقول : تبخلوا بها وتمنعوها إياه، ضنا منكم بها، ولكنه علم ذلك\nمنكم، ومن ضيق أنفسكم فلم يسألكموها)).",
"commentary_en": "At-Tabari said: “If He were to ask you for it” means: if your Lord were to ask you for your wealth. “and press you” means: He would exert you by asking and insist upon you in requesting it, pressing you. “you would withhold” means: you would be miserly with it and prevent it from Him, out of stinginess. But He knew that about you and about the tightness of your souls, so He did not ask you for it."
}
},
{
"qNum": 6,
"question_ar": "عند الشدائد تتكشف الحقائق ، وتظهر مُخَبَّات النفوس، فيتهاوى أقوام\nاذكر آية تدل على هذا المعنى.",
"question_en": "In times of hardship, realities are uncovered and what is hidden within souls becomes apparent, causing some people to collapse. Mention a verse that indicates this meaning.",
"answer": {
"surah": 47,
"ayahs": [29],
"ayah_ar": "أَم حَسِبَ الَّذِينَ في قُلُوبِهِم مَرَضٌ أَن لَن يُخرِجَ اللهُ أَضغانَهُم)",
"ayah_en": "Or did those in whose hearts is a disease think that Allah would never bring out their resentments?",
"commentary_ar": "جاء في تفسير السعدي: (يقول تعالى: أَم حَسِبَ الَّذِينَ فِي قُلُوبِهِم مَرَضٌ من\nشبهة أو شهوة ، بحيث تخرج القلب عن حال صحته واعتداله ، أن الله لا يخرج\nما في قلوبهم من الأضغان والعداوة للإسلام وأهله ؟ هذا ظن لا يليق بحكمة\nالله ، فإنه لا بد أن يميز الصادق من الكاذب، وذلك بالابتلاء بالمحن، التي من\nثبت عليها ، ودام إيمانه فيها ، فهو المؤمن حقيقة ، ومن ردته على عقبيه فلم\nيصبر عليها، وحين أتاه الامتحان، جزع وضعف إيمانه، وخرج ما في قلبه من\nالضغن ، وتبين نفاقه ، هذا مقتضى - الحكمة الإلهية ، مع أنه تعالى قال: (وَلَوْ\nنَشَاءُ لَا رَيْنَاكَهُمْ فَلَعَرَفْتَهُمْ بِسِيمَاهُمْ)).",
"commentary_en": "In Tafsir as-Sa‘di: Allah says: Do those in whose hearts is a disease—of doubt or desire that removes the heart from its soundness and balance—think that Allah will not bring out what is in their hearts of malice and enmity toward Islam and its people? This is a thought unbefitting Allah’s wisdom. He must distinguish the truthful from the liar through trials; whoever remains firm and whose faith persists through them is truly a believer. But whoever is turned back on his heels and does not endure them—when the test comes, he panics, his faith weakens, what is in his heart of malice emerges, and his hypocrisy becomes clear. This is required by divine wisdom, even though He, Most High, said: “And if We willed, We would show them to you, and you would know them by their mark.”"
}
},
{
"qNum": 7,
"question_ar": "آية فيها ذكر من يتعظ من الخلق بفعل الله في الأقوام السابقة . أفاد حرف\n(أو) فيها تباين هؤلاء المتعظين على مرتبتين إحداهما خير من الأخرى وإن\nكانوا جميعا ممدوحين . اذكر هذه الآية .",
"question_en": "A verse mentions those among creation who take heed from Allah’s dealings with previous peoples. The particle “or” indicates that these heed-takers differ into two levels, one better than the other, though all are praised. Mention this verse.",
"answer": {
"surah": 50,
"ayahs": [37],
"ayah_ar": "إن في ذلِكَ لَذِكرى لِمَن كانَ لَهُ قَلبٌ أَو أَلْقَى السَّمْعَ وَهُوَ شَهِيدٌ)",
"ayah_en": "Indeed, in that is a reminder for whoever has a heart, or who listens while he is present [in mind].",
"commentary_ar": "قال ابن تيمية في الفتاوى : ( من يؤتى الحكمة وينتفع بالعلم على منزلتين : إما\nرجل رأى الحق بنفسه ، فقبله واتبعه، فذلك صاحب القلب، أو رجل لم\nيعقله بنفسه بل هو يحتاج إلى من يعلمه ويبينه له ويعظه ويؤدبه، فهذا\nأصغى فألقى السمع وهو شهيد ، أي وهو حاضر القلب ) ( ابن تيمية / مجموع\n)9/311 / الفتاوى",
"commentary_en": "Ibn Taymiyyah said in al-Fatawa: Whoever is given wisdom and benefits from knowledge is of two ranks: either a man who sees the truth himself, then accepts it and follows it—this is the صاحب القلب (one who “has a heart”); or a man who does not comprehend it on his own but needs someone to teach and clarify it to him and admonish and cultivate him—this is the one who listened attentively, “so he listens while he is present,” meaning with a present heart. (Ibn Taymiyyah, Majmu‘ al-Fatawa 9/311)"
}
},
{
  "qNum": 8,
  "question_ar": "كلمة دلت على خُلُق نبي كريم في تعامله مع ضيوفه، بحيث لم يشعرهم\nبالحرج حين أراد أن يضيفهم. ما هي هذه الكلمة ؟",
  "question_en": "A word that indicates the noble character of a Prophet in how he dealt with his guests, such that he did not make them feel awkward when he wished to host them. What is this word?",
  "answer": {
    "surah": 51,
    "ayahs": [26],
    "ayah_ar": "فَراغَ إِلى أَهْلِهِ فَجَاءَ بِعِجل سمين [الذاريات: 26]",
    "ayah_en": "So he slipped quietly to his family and brought a fat calf.",
    "commentary_ar": "قال ابن كثير: (وقوله : (فَراغَ إِلى أَهْلِهِ ) أي: انسَلَّ خُفِيَةً فِي سُرِعَة ، ... فَإِنَّهُ جَاءَ بطعامِهِ مِن حَيثُ لَا يَشعرونَ بِسُرعة ، وَلَم يَمتَنَّ عَلَيْهِم أَوَّلًا فَقَالَ : نَأْتِيكُم بطعام ؟ بل جاءَ بِهِ بِسرعةٍ وخفاء).",
    "commentary_en": "Ibn Kathir said: His statement (فَراغَ إِلى أَهْلِهِ) means he slipped away quietly and swiftly… He brought the food from where they did not notice, quickly, and he did not first burden them by saying, Shall we bring you food? Rather, he brought it quickly and discreetly."
  }
},
{
"qNum": 9,
"question_ar": "لو شاء الله لأهلك الكافرين المعادين لله ولرسوله وللمؤمنين بكلمة منه ، بل\nلما خلقهم أصلا ، لكنه سبحانه بين حكمته من وجودهم ومحاربتهم. اذكر\nآية توضح ذلك المعنى.",
"question_en": "If Allah willed, He could destroy the disbelievers who oppose Allah, His Messenger, and the believers with a single word—indeed, He could have not created them at all. Yet He has explained His wisdom in their existence and their fighting. Mention a verse that clarifies this meaning.",
"answer": {
"surah": 47,
"ayahs": [4],
"ayah_ar": "فَإِذَا لَقِيتُمُ الَّذِينَ كَفَرُوا فَضَربَ الرِّقَابِ حَتَّى إِذا أَثْخَنتُمُوهُم فَشُدُّوا الوَثَاقَ فَإِمَّا\nمَنَّا بَعدُ وَإِمَّا فِدَاءً حَتَّى تَضَعَ الحَربُ أَوزارها ذلِكَ وَلَو يَشَاءُ اللَّهُ لَا نَتَصَرَ مِنْهُم\nوَلكِن لِيَبْلُوَ بَعضَكُم بِبَعْضٍ وَالَّذِينَ قُتِلوا في سَبِيلِ اللَّهِ فَلَن يُضِلَّ أَعْمالَهُم)",
"ayah_en": "So when you meet those who disbelieve, strike the necks until, when you have thoroughly subdued them, bind firmly. Then either [set them free] as a favor afterward or ransom, until the war lays down its burdens. That [is the command]. And if Allah had willed, He could have taken vengeance upon them, but [He ordains fighting] so that He may test some of you by means of others. And those who are killed in the cause of Allah—He will never let their deeds be lost.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 10,
"question_ar": "قال الله تعالى : (أُولَبِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِةٌ قُل لَّا أَسْأَلُكُمْ عَلَيْهِ\nأَجْرًا إِنْ هُوَ إِلَّا ذِكْرَى لِلْعَالَمِينَ) [الأنعام : 90] ، فكل إنسان يحتاج إلى قدوة،\nحتى الرسول الكريم محمد ﷺ مأمور بالاقتداء . اذكر آية كريمة وافقت هذا\nالمعنى.",
"question_en": "Allah said: “Those are the ones whom Allah has guided, so by their guidance follow. Say: I ask of you no reward for it; it is only a reminder for the worlds.” [Al-An‘am: 90]. Every person needs a role model, and even the noble Messenger Muhammad ﷺ is commanded to follow. Mention a noble verse that agrees with this meaning.",
"answer": {
"surah": 46,
"ayahs": [35],
"ayah_ar": "فَاصْبِرْ كَمَا صَبَرَ أُولُو الْعَزْمِ مِنَ الرُّسُلِ)",
"ayah_en": "So be patient, as the messengers of firm resolve were patient.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 11,
"question_ar": "قد ترى أناساً يدعون الانفتاح وقبول الآخر والاختلاف، فإذا ذكرت حكماً\nشرعياً أمامهم فإنهم ينفرون بشدة ويكرهون ما تذكره لهم من شريعة الله.\nفهؤلاء لا ينفعهم عملهم عند الله مهما كان . اذكر آية كريمة تبين ذلك .",
"question_en": "You may see people who claim openness, accepting others, and difference of opinion—yet if you mention a religious ruling before them, they strongly recoil and hate what you remind them of from Allah’s law. Such people’s deeds will not benefit them with Allah, no matter what they are. Mention a verse that makes this clear.",
"answer": {
"surah": 47,
"ayahs": [9],
"ayah_ar": "﴿ذَلِكَ بِأَنَّهُمْ كَرِهُوا مَا أَنزَلَ اللَّهُ فَأَحْبَطَ أَعْمَالَهُمْ﴾",
"ayah_en": "That is because they disliked what Allah sent down, so He rendered their deeds worthless.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 12,
"question_ar": "روى مسلم في صحيحه أن النبي ﷺ قال : ( وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، لَا يَسْمَعُ\nبي أحد من هذه الأمة لا يَهُودِيُّ ، وَلَا نَصْرَانِيُّ ، ثُمَّ يَمُوتُ وَلَمْ يُؤْمِنْ بِالَّذِي أُرْسِلْتُ\nبِهِ إِلَّا كَانَ مِنْ أَصْحَابِ النار) . اذكر آية صريحة من تسع كلمات تؤكد كفر من\nلم يؤمن بمحمد رسولا.",
"question_en": "Muslim narrated in his Sahih that the Prophet ﷺ said: “By the One in whose hand is Muhammad’s soul, no one from this Ummah—Jew or Christian—hears of me and then dies without believing in what I was sent with, except that he will be among the people of the Fire.” Mention an explicit verse of nine words that confirms the disbelief of whoever does not believe in Muhammad as a messenger.",
"answer": {
"surah": 48,
"ayahs": [13],
"ayah_ar": "وَمَن لَّمْ يُؤْمِن بِاللَّهِ وَرَسُولِهِ فَإِنَّا أَعْتَدْنَا لِلْكَافِرِينَ سَعِيرًا)",
"ayah_en": "And whoever does not believe in Allah and His Messenger—then indeed We have prepared for the disbelievers a blazing fire.",
"commentary_ar": "",
"commentary_en": ""
}
},
{
"qNum": 13,
"question_ar": "آية يُفهم منها أن الإنجيل كان في مجمله كتاب مواعظ وترقيقات وتخفيفات\nأكثر من كونه كتاب تشريعات.",
"question_en": "A verse from which it is understood that the Gospel, in general, was more a book of admonitions, softening of hearts, and concessions than a book of detailed legislation.",
"answer": {
"surah": 46,
"ayahs": [30],
"ayah_ar": "قَالُوا يَا قَوْمَنَا إِنَّا سَمِعْنَا كِتَابًا أُنزِلَ مِن بَعْدِ مُوسَى مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ يَهْدِي إِلَى\nالْحَقِّ وَإِلَى طَرِيقٍ مُسْتَقِيمٍ)",
"ayah_en": "They said, “O our people, indeed we have heard a Book revealed after Moses, confirming what was before it, guiding to the truth and to a straight path.”",
"commentary_ar": "قال ابن كثير: ( وَلَمْ يَذْكُرُوا عِيسَى؛ لِأَنَّ عِيسَى عَلَيْهِ السَّلَامُ أُنْزِلَ عَلَيْهِ الْإِنْجِيلُ\nفِيهِ مَوَاعِظُ وَتَرْقِيقَاتُ وَقَلِيلٌ مِنَ التَّحْلِيلِ وَالتَّحْرِيمِ، وَهُوَ فِي الْحَقِيقَةِ\nكَالْمُتَمِّمِ لِشَرِيعَةِ التَّوْرَاةِ، فَالْعُمْدَةُ هُوَ التَّوْرَاةُ ؛ فَلِهَذَا قَالُوا: أُنْزِلَ مِنْ بَعْدِ\nمُوسَى . وَهَكَذَا قَالَ وَرَقَةُ بْنُ نَوْفَلٍ ، حِينَ أَخْبَرَهُ النَّبِيُّ ﷺ بِقِصَّةِ نِزُولِ جِبْرِيلَ\nعَلَيْهِ السَّلَامُ عَلَيْهِ أَوَّلَ مَرَّةٍ ، فَقَالَ : بَحْ بَحْ ، هَذَا النَّامُوسُ الَّذِي كَانَ يَأْتِي\nمُوسَى ، يَا لَيْتَنِي أَكُونُ فِيهَا جَذَعاً).",
"commentary_en": "Ibn Kathir said: They did not mention Jesus because Jesus (peace be upon him) was given the Gospel, which contains admonitions and softening reminders, and little of making things lawful and unlawful. In reality, it is like a complement to the law of the Torah; the main foundation is the Torah. For this reason they said: “revealed after Moses.” And likewise Waraqah ibn Nawfal said, when the Prophet ﷺ informed him of the story of Jibril’s first descent: “Ah! Ah! This is the Namus (bearer of revelation) who used to come to Moses. I wish I could be young in it.”"
}
},
{
  "qNum": 14,
  "question_ar": "أربع كلمات تصف الكفار بالاضطراب والتقلب في مواقفهم وأنهم ليس لهم\nوجهة ثابتة ولا يستقر رأيهم على شيء.",
  "question_en": "Four words describe the disbelievers as unsettled and wavering in their stances, having no fixed direction and no stable conclusion on anything.",
  "answer": {
    "surah": 50,
    "ayahs": [5],
    "ayah_ar": "بَلْ كَذَّبُوا بِالْحَقِّ لَمَّا جَاءَهُمْ فَهُمْ فِي أَمْرٍ مَّرِيجٍ) [ق: 5]",
    "ayah_en": "Rather, they denied the truth when it came to them, so they are in a confused, unsettled matter.",
    "commentary_ar": "قال ابن عاشور : ( والمريج : المضطرب المختلط، أي لا قرار في أنفسهم في هذا\nالتكذيب أي لا يستقرون على قول معين ) ، اضطربت فيه أحوالهم كلها من\nأقوالهم في وصف القرآن . فإنهم ابتدروا فنفوا عنه الصدق، فلم يتبينوا بأي\nأنواع الكلام الباطل يلحقونه، فقالوا : \"سحر مبين\" وقالوا: \"أساطير\nالأولين \" وقالوا : \" قول شاعر\" ، وقالوا : \" قول كاهن \" وقالوا: هذيان مجنون\n(حاشاه ) ... وهذا تحميق لهم بأنهم طاشت عقولهم فلم يتقنوا التكذيب ولم\nيرسوا على وصف الكلام الذي كذبوا به ) .\nوذلك كقوله سبحانه : ( بَلْ قَالُوا أَضْغَاثُ أَحْلَامٍ بَلِ افْتَرَاهُ بَلْ هُوَ شَاعِرُ فَلْيَأْتِنَا\nبِآيَةٍ كَمَا أُرْسِلَ الْأَوَّلُونَ) [الأنبياء: 5]",
    "commentary_en": "Ibn ‘Ashur said: \"Al-marij\" means disturbed and mixed—meaning there is no stability within them in this denial; they do not settle upon a specific statement. Their conditions became chaotic in what they said about describing the Qur’an. They rushed to deny its truthfulness, but did not determine which kinds of false speech to attach to it. So they said: \"clear magic,\" and they said: \"tales of the former peoples,\" and they said: \"the words of a poet,\" and they said: \"the words of a soothsayer,\" and they said: the rambling of a madman (far above him). This is a rebuke to them: their minds were scattered, so they did not even perfect their denial nor settle on a description for the speech they denied.\nAnd that is like His statement: ( بَلْ قَالُوا أَضْغَاثُ أَحْلَامٍ بَلِ افْتَرَاهُ بَلْ هُوَ شَاعِرُ فَلْيَأْتِنَا بِآيَةٍ كَمَا أُرْسِلَ الْأَوَّلُونَ) [Al-Anbiya’: 5]"
  }
},
{
"qNum": 15,
"question_ar": "الكافريستكبر عن اتباع الحق ، فيجازى بالمذلة في عذاب جهنم. اذكر كلمة في\nآية تدل على ذلك.",
"question_en": "The disbeliever arrogantly refuses to follow the truth, and is repaid with humiliation in the punishment of Hell. Mention a word in a verse that indicates this.",
"answer": {
"surah": 46,
"ayahs": [20],
"ayah_ar": "وَيَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى النَّارِ أَذْهَبْتُمْ طَيِّبَاتِكُمْ فِي حَيَاتِكُمُ الدُّنْيَا\nوَاسْتَمْتَعْتُم بِهَا فَالْيَوْمَ تُجْزَوْنَ عَذَابَ الْهُونِ بِمَا كُنتُمْ تَسْتَكْبِرُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ\nوَبِمَا كُنتُمْ تَفْسُقُونَ)",
"ayah_en": "And the Day those who disbelieved are presented to the Fire: “You exhausted your good things in your worldly life and enjoyed them; so today you will be recompensed with the punishment of humiliation for what you used to be arrogant upon the earth without right and for what you used to commit of defiantly disobedient acts.”",
"commentary_ar": "وعذاب الهون هو العذاب الشديد الذي يذل الكافرين ويهينهم.\nوقال تعالى أيضاً:\n(وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَى عَلَى اللَّهِ كَذِبًا أَوْ قَالَ أُوحِيَ إِلَيَّ وَلَمْ يُوحَ إِلَيْهِ شَيْءٌ وَمَن قَالَ\nسَأُنزِلُ مِثْلَ مَا أَنزَلَ اللَّهُ وَلَوْ تَرَى إِذِ الظَّالِمُونَ فِي غَمَرَاتِ الْمَوْتِ وَالْمَلَائِكَةُ بَاسِطُو\nأَيْدِيهِمْ أَخْرِجُوا أَنفُسَكُمُ الْيَوْمَ تُجْزَوْنَ عَذَابَ الْهُونِ بِمَا كُنتُمْ تَقُولُونَ عَلَى اللَّهِ غَيْرَ\nالْحَقِّ وَكُنتُمْ عَنْ آيَاتِهِ تَسْتَكْبِرُونَ) [الأنعام: 93].",
"commentary_en": "“The punishment of humiliation” is the severe punishment that humiliates and disgraces the disbelievers.\nAllah also said:\n“And who is more unjust than one who invents a lie about Allah or says, ‘It has been revealed to me,’ while nothing was revealed to him; and who says, ‘I will reveal the like of what Allah revealed’? And if you could but see when the wrongdoers are in the agonies of death and the angels extend their hands, [saying], ‘Release your souls. Today you will be recompensed with the punishment of humiliation for what you used to say about Allah other than the truth and for your arrogance toward His verses.’” [Al-An‘am: 93]"
}
}
]
}