{
  "juz": 5,
  "items": [
    {
      "qNum": 1,
      "question_ar": "ترى من يُفضّل بعض المشركين أو الملحدين على المسلمين بدعوى أنهم أكثر إنسانية أو أفضل أخلاقًا. اذكر آية تستدل بها لتبين أن الله شنع على من يفضل كافرًا على مؤمن.",
      "question_en": "Some people prefer polytheists/atheists over Muslims, claiming they are more humane or better in character. Cite an ayah showing that Allah condemned preferring a disbeliever over a believer.",
      "answer": {
        "surah": 4,
        "ayahs": [
          51,
          52
        ],
        "ayah_ar": "أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِّنَ الْكِتَابِ يُؤْمِنُونَ بِالْجِبْتِ وَالطَّاغُوتِ وَيَقُولُونَ لِلَّذِينَ كَفَرُوا هَؤُلَاءِ أَهْدَى مِنَ الَّذِينَ آمَنُوا سَبِيلًا ۝ أُولَٰئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ ۖ وَمَن يَلْعَنِ اللَّهُ فَلَن تَجِدَ لَهُ نَصِيرًا",
        "commentary_ar": "الآية ذمّت من يُفضّل الكافر على المؤمن، وبيّنت أن هذا من أسباب اللعن والخذلان.",
        "commentary_en": "The ayah criticizes preferring disbelievers over believers and warns that such a stance leads to Allah’s curse and abandonment."
      }
    },
    {
      "qNum": 2,
      "question_ar": "بعض الشباب والفتيات لا يلتزم بحدود الله في التعامل مع الجنس الآخر ويحتج بأن الفتنة شديدة وأنه بشر ضعيف. اذكر آية تبين أن الله شرع الحدود وهو يعلم ضعف الإنسان رحمةً به.",
      "question_en": "Some youths ignore Allah’s limits in interacting with the opposite sex and excuse it by saying temptation is strong and humans are weak. Cite an ayah showing Allah set these limits while knowing human weakness—out of mercy.",
      "answer": {
        "surah": 4,
        "ayahs": [
          26,
          27,
          28
        ],
        "ayah_ar": "يُرِيدُ اللَّهُ لِيُبَيِّنَ لَكُمْ وَيَهْدِيَكُمْ سُنَنَ الَّذِينَ مِن قَبْلِكُمْ وَيَتُوبَ عَلَيْكُمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ ۝ وَاللَّهُ يُرِيدُ أَن يَتُوبَ عَلَيْكُمْ وَيُرِيدُ الَّذِينَ يَتَّبِعُونَ الشَّهَوَاتِ أَن تَمِيلُوا مَيْلًا عَظِيمًا ۝ يُرِيدُ اللَّهُ أَن يُخَفِّفَ عَنكُمْ ۚ وَخُلِقَ الْإِنسَانُ ضَعِيفًا",
        "commentary_ar": "الآيات تقرر أن تشريعات الله جاءت بيانًا وهدايةً وتخفيفًا، لأن الإنسان ضعيف وتميل به الشهوات؛ فحدود العلاقة رحمة وحماية.",
        "commentary_en": "These ayat explain that Allah legislated guidance and “lightening” because humans are weak and pulled by desire—so boundaries are mercy and protection."
      }
    },
    {
      "qNum": 3,
      "question_ar": "اذكر آية تبين أن بعض الناس يرتكبون المحرمات أكثر مما لو أنهم أُمِروا بها أمرًا شرعيًا.",
      "question_en": "Cite an ayah showing that some people would commit forbidden acts more readily than they would obey if those same acts were commanded.",
      "answer": {
        "surah": 4,
        "ayahs": [
          66
        ],
        "ayah_ar": "وَلَوْ أَنَّا كَتَبْنَا عَلَيْهِمْ أَنِ اقْتُلُوا أَنفُسَكُمْ أَوِ اخْرُجُوا مِن دِيَارِكُم مَّا فَعَلُوهُ إِلَّا قَلِيلٌ مِّنْهُمْ",
        "commentary_ar": "المعنى: أن كثيرًا من الناس لو أُمِروا شرعًا بما يشبه ما يقعون فيه من المحرمات لما أطاعوا؛ لطبعهم على مخالفة الأمر.",
        "commentary_en": "It indicates that many people would refuse difficult divine commands—yet they may still plunge into prohibitions, revealing a stubborn tendency to disobey."
      }
    },
    {
      "qNum": 4,
      "question_ar": "ليس بالله حاجة في عذاب الناس؛ إنما العذاب جزاء السوء. اذكر آية تدل أن الله لا يعذب الشاكر المؤمن.",
      "question_en": "Allah has no need to punish people; punishment is a consequence of wrongdoing. Cite an ayah showing He does not need to punish the grateful believer.",
      "answer": {
        "surah": 4,
        "ayahs": [
          147
        ],
        "ayah_ar": "مَّا يَفْعَلُ اللَّهُ بِعَذَابِكُمْ إِن شَكَرْتُمْ وَآمَنتُمْ ۚ وَكَانَ اللَّهُ شَاكِرًا عَلِيمًا",
        "commentary_ar": "الآية تقرر أن شكر العبد وإيمانه سبب لانتفاء العذاب؛ فالله غنيّ عن تعذيب عباده.",
        "commentary_en": "It states that gratitude and faith remove the need for punishment—Allah gains nothing from punishing and is fully independent."
      }
    },
    {
      "qNum": 5,
      "question_ar": "اذكر آية يتضح فيها أن القرآن ينسب الفضل إلى الله فيما يحصل للنبي من خير، وينسب سبب المكروه إلى النفس.",
      "question_en": "Cite an ayah showing that good is attributed to Allah, while the cause of harm is attributed to one’s own self.",
      "answer": {
        "surah": 4,
        "ayahs": [
          79
        ],
        "ayah_ar": "مَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ ۖ وَمَا أَصَابَكَ مِن سَيِّئَةٍ فَمِن نَّفْسِكَ",
        "commentary_ar": "تبين الآية أدبَ نسبة النعم إلى الله، وأن ما يقع من سيئات فسببه تقصير العبد وذنبه.",
        "commentary_en": "The ayah teaches attributing blessings to Allah, while personal faults and sins are a cause for the harms that befall a person."
      }
    },
    {
      "qNum": 6,
      "question_ar": "يبرر بعض الناس الإعراض عن حكم الله بحجة السلم المجتمعي والتعايش. اذكر آيات تحكي هذا العذر والرد عليه.",
      "question_en": "Some people justify turning away from Allah’s law under the banner of ‘social peace’ and coexistence. Cite ayat that describe this excuse and refute it.",
      "answer": {
        "surah": 4,
        "ayahs": [
          60,
          61,
          62
        ],
        "ayah_ar": "أَلَمْ تَرَ إِلَى الَّذِينَ يَزْعُمُونَ أَنَّهُمْ آمَنُوا بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ يُرِيدُونَ أَن يَتَحَاكَمُوا إِلَى الطَّاغُوتِ وَقَدْ أُمِرُوا أَن يَكْفُرُوا بِهِ وَيُرِيدُ الشَّيْطَانُ أَن يُضِلَّهُمْ ضَلَالًا بَعِيدًا ۝ وَإِذَا قِيلَ لَهُمْ تَعَالَوْا إِلَى مَا أَنزَلَ اللَّهُ وَإِلَى الرَّسُولِ رَأَيْتَ الْمُنَافِقِينَ يَصُدُّونَ عَنكَ صُدُودًا ۝ فَكَيْفَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ ثُمَّ جَاءُوكَ يَحْلِفُونَ بِاللَّهِ إِنْ أَرَدْنَا إِلَّا إِحْسَانًا وَتَوْفِيقًا",
        "commentary_ar": "الآيات تفضح من يدّعي الإيمان ثم يتحاكم لغير شرع الله، ثم يعتذر بعبارات مثل «إحسانًا وتوفيقًا».",
        "commentary_en": "These ayat expose those who claim faith yet seek judgment outside Allah’s revelation, then dress it up as ‘good intentions’ and ‘reconciliation’."
      }
    },
    {
      "qNum": 7,
      "question_ar": "يفتح الله أبواب التوبة، والمفسدون يحرّفون الداخلين عنها. اذكر آية تدل على ذلك.",
      "question_en": "Allah opens the doors of repentance, but corrupters try to divert people away from it. Cite an ayah indicating this.",
      "answer": {
        "surah": 4,
        "ayahs": [
          27
        ],
        "ayah_ar": "وَاللَّهُ يُرِيدُ أَن يَتُوبَ عَلَيْكُمْ وَيُرِيدُ الَّذِينَ يَتَّبِعُونَ الشَّهَوَاتِ أَن تَمِيلُوا مَيْلًا عَظِيمًا",
        "commentary_ar": "فيها مقابلة واضحة: إرادة الله للتوبة والهداية، وإرادة أهل الشهوات لإمالة الناس وإفسادهم.",
        "commentary_en": "It contrasts Allah’s will to guide and forgive with the agenda of desire-driven people to pull others into moral collapse."
      }
    },
    {
      "qNum": 8,
      "question_ar": "اذكر أربع كلمات من آية يؤدي عدم معرفة أن اللام فيها لام علة إلى سوء فهم كأن الله ينهى نبيه أن يقف موقفًا قويًا من قوم سوء.",
      "question_en": "Quote four words from an ayah where misunderstanding the ‘lam’ )as strengthening vs. purpose( could lead to the wrong meaning—such as thinking the Prophet is told not to take a firm stance against wrongdoers.",
      "answer": {
        "surah": 4,
        "ayahs": [
          105
        ],
        "ayah_ar": "إِنَّا أَنزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ لِتَحْكُمَ بَيْنَ النَّاسِ بِمَا أَرَاكَ اللَّهُ ۚ وَلَا تَكُن لِّلْخَائِنِينَ خَصِيمًا",
        "commentary_ar": "الأربع كلمات: «وَلَا تَكُنْ لِلْخَائِنِينَ خَصِيمًا»؛ أي لا تكن خصيمًا لأجلهم (مدافعًا عنهم)، لا أنه نهيٌ عن مخاصمتهم.",
        "commentary_en": "The four words are: “وَلَا تَكُنْ لِلْخَائِنِينَ خَصِيمًا” meaning: do not argue on behalf of the betrayers—not ‘do not argue against them’."
      }
    },
    {
      "qNum": 9,
      "question_ar": "لا يكفي الامتثال الظاهر لحكم الله؛ بل لا بد من الانقياد القلبي بلا حرج. اذكر آية فيها هذا المعنى.",
      "question_en": "Outward compliance isn’t enough; one must submit inwardly without resentment. Cite an ayah expressing this meaning.",
      "answer": {
        "surah": 4,
        "ayahs": [
          65
        ],
        "ayah_ar": "فَلَا وَرَبِّكَ لَا يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ثُمَّ لَا يَجِدُوا فِي أَنفُسِهِمْ حَرَجًا مِّمَّا قَضَيْتَ وَيُسَلِّمُوا تَسْلِيمًا",
        "commentary_ar": "الآية جمعت التحاكم للشريعة، ورفع الحرج، والتسليم الظاهر والباطن.",
        "commentary_en": "It ties true faith to accepting prophetic judgment, removing inner resistance, and complete submission in heart and action."
      }
    },
    {
      "qNum": 10,
      "question_ar": "القرآن يكني عن بعض الأمور التي يُستحيا من ذكرها. اذكر كلمة وردت في جزء اليوم مثالًا على ذلك.",
      "question_en": "The Qur’an uses refined euphemisms for matters people may feel shy to mention. Provide one word from today’s juz as an example.",
      "answer": {
        "surah": 4,
        "ayahs": [
          43
        ],
        "ayah_ar": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَقْرَبُوا الصَّلَاةَ وَأَنتُمْ سُكَارَى حَتَّى تَعْلَمُوا مَا تَقُولُونَ وَلَا جُنُبًا إِلَّا عَابِرِي سَبِيلٍ حَتَّى تَغْتَسِلُوا ۚ وَإِن كُنتُم مَّرْضَىٰ أَوْ عَلَىٰ سَفَرٍ أَوْ جَاءَ أَحَدٌ مِّنكُم مِّنَ الْغَائِطِ أَوْ لَامَسْتُمُ النِّسَاءَ فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا فَامْسَحُوا بِوُجُوهِكُمْ وَأَيْدِيكُمْ ۗ إِنَّ اللَّهَ كَانَ عَفُوًّا غَفُورًا",
        "commentary_ar": "الكلمة مثال الكناية: «الْغَائِط»؛ وهو في الأصل المكان المنخفض من الأرض، واستُعمل كنايةً عن قضاء الحاجة.",
        "commentary_en": "The example euphemism is “الْغَائِط” (literally: a low place in the land), used as a refined way to refer to relieving oneself."
      }
    },
    {
      "qNum": 11,
      "question_ar": "الفطرة السليمة تفرح بمن هو خير في الدين، أما النفس الدنيئة فتود أن ينزل الآخرون لمستواها. اذكر آية تدل على ذلك.",
      "question_en": "A sound heart is pleased to see someone better in faith, while a low soul wants others to fall to its level. Cite an ayah indicating this.",
      "answer": {
        "surah": 4,
        "ayahs": [
          89
        ],
        "ayah_ar": "وَدُّوا لَوْ تَكْفُرُونَ كَمَا كَفَرُوا فَتَكُونُونَ سَوَاءً ۖ فَلَا تَتَّخِذُوا مِنْهُمْ أَوْلِيَاءَ حَتَّىٰ يُهَاجِرُوا فِي سَبِيلِ اللَّهِ",
        "commentary_ar": "صرّحت الآية بأن أهل النفاق/الكفر يتمنون أن يكفر المؤمنون «فتكونوا سواءً»؛ وهذا عين حبّهم لإنزال غيرهم إلى مستواهم.",
        "commentary_en": "It states explicitly that they want believers to disbelieve “so you become equal,” which matches the idea of wanting others dragged down to their level."
      }
    },
    {
      "qNum": 12,
      "question_ar": "بعض الناس يعمل أعمالًا من الخير بلا نية صالحة أو بلا إيمان. اذكر آية فيها صيغة تعجب من تفويتهم أجر أعمالهم.",
      "question_en": "Some people do good deeds without sincere intention or even without faith. Cite an ayah with a tone of ‘wonder’ at how they forfeit reward.",
      "answer": {
        "surah": 4,
        "ayahs": [
          39
        ],
        "ayah_ar": "وَمَاذَا عَلَيْهِمْ لَوْ آمَنُوا بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَأَنفَقُوا مِمَّا رَزَقَهُمُ اللَّهُ ۚ وَكَانَ اللَّهُ بِهِمْ عَلِيمًا",
        "commentary_ar": "الاستفهام هنا للتعجب والتوبيخ: ما الذي يضرهم لو جمعوا العمل الصالح إلى الإيمان والنية ليحصلوا الأجر؟",
        "commentary_en": "It’s a rhetorical question expressing reproach: what would have harmed them if they had paired their spending with true faith—so their deeds earn real reward?"
      }
    },
    {
      "qNum": 13,
      "question_ar": "الأصل إحسان الظن بالمسلمين، لكن إذا ظهرت دلائل النفاق فلا يصح التهاون. اذكر الآية التي عاتب الله فيها من لان في شأنهم.",
      "question_en": "The default is to think well of Muslims, but when signs of hypocrisy are clear, softness is misplaced. Cite the ayah where Allah reproaches hesitation about them.",
      "answer": {
        "surah": 4,
        "ayahs": [
          88
        ],
        "ayah_ar": "فَمَا لَكُمْ فِي الْمُنَافِقِينَ فِئَتَيْنِ وَاللَّهُ أَرْكَسَهُم بِمَا كَسَبُوا ۚ أَتُرِيدُونَ أَن تَهْدُوا مَنْ أَضَلَّ اللَّهُ ۖ وَمَن يُضْلِلِ اللَّهُ فَلَن تَجِدَ لَهُ سَبِيلًا",
        "commentary_ar": "الآية عتاب لمن تردد في شأن المنافقين بعد وضوح أماراتهم، وأن التردد لا محل له بعد ظهور الحقائق.",
        "commentary_en": "It reproaches being split and hesitant about hypocrites after evidence is clear, reminding that deliberate misguidance has consequences."
      }
    },
    {
      "qNum": 14,
      "question_ar": "فعلُ أمرٍ استدل به المفسرون على أن الإيمان درجات ويزيد وينقص. اذكر هذا الفعل.",
      "question_en": "Mufassirun inferred from an imperative verb that faith has levels and can increase or decrease. Mention that verb.",
      "answer": {
        "surah": 4,
        "ayahs": [
          136
        ],
        "ayah_ar": "يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا بِاللَّهِ وَرَسُولِهِ وَالْكِتَابِ الَّذِي نَزَّلَ عَلَىٰ رَسُولِهِ وَالْكِتَابِ الَّذِي أَنزَلَ مِن قَبْلُ ۚ وَمَن يَكْفُرْ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ فَقَدْ ضَلَّ ضَلَالًا بَعِيدًا",
        "commentary_ar": "فعل الأمر هو: «آمِنُوا» الموجَّه للمؤمنين؛ أي ثبّتوا إيمانكم وزيدوه بتحقيقه علمًا وعملاً.",
        "commentary_en": "The imperative is “آمِنُوا” addressed to believers—meaning: strengthen, complete, and increase your faith through sound belief and deeds."
      }
    },
    {
      "qNum": 15,
      "question_ar": "آية تذكّر أصحاب النزعة النسوية بأن الله قسم الأدوار والحقوق بحكمة، وأن لكلٍ نصيبه. اذكر الآية.",
      "question_en": "An ayah reminding those with a radical gender-ideology that Allah apportioned roles and rights with wisdom, and each has their share. Cite it.",
      "answer": {
        "surah": 4,
        "ayahs": [
          32
        ],
        "ayah_ar": "وَلَا تَتَمَنَّوْا مَا فَضَّلَ اللَّهُ بِهِ بَعْضَكُمْ عَلَىٰ بَعْضٍ ۚ لِّلرِّجَالِ نَصِيبٌ مِّمَّا اكْتَسَبُوا وَلِلنِّسَاءِ نَصِيبٌ مِّمَّا اكْتَسَبْنَ ۚ وَاسْأَلُوا اللَّهَ مِن فَضْلِهِ ۗ إِنَّ اللَّهَ كَانَ بِكُلِّ شَيْءٍ عَلِيمًا",
        "commentary_ar": "تنهى الآية عن التمني الحاسد، وتقرر أن لكلٍ نصيبًا مما اكتسب، مع الأمر بسؤال الله الفضل بدل الاعتراض على قسمته.",
        "commentary_en": "It forbids jealous wishing, affirms each has a share of what they earn, and directs people to seek Allah’s bounty rather than resent His wise apportioning."
      }
    },
    {
      "qNum": 16,
      "question_ar": "قد يعصي أحدنا ثم لا يرى أثر معصيته سريعًا فيظن أن لا عقوبة. اذكر آية فيها خمس كلمات تبين أن كل صاحب ذنب سيُجازى.",
      "question_en": "Someone may sin and not see immediate consequences, thinking there is no punishment. Cite an ayah whose wording shows every wrongdoer will be repaid sooner or later.",
      "answer": {
        "surah": 4,
        "ayahs": [
          123
        ],
        "ayah_ar": "لَيْسَ بِأَمَانِيِّكُمْ وَلَا أَمَانِيِّ أَهْلِ الْكِتَابِ ۗ مَن يَعْمَلْ سُوءًا يُجْزَ بِهِ وَلَا يَجِدْ لَهُ مِن دُونِ اللَّهِ وَلِيًّا وَلَا نَصِيرًا",
        "commentary_ar": "الخمس الكلمات: «مَن يَعْمَلْ سُوءًا يُجْزَ بِهِ»؛ وهي قاعدة عامة في الجزاء دنيويًا أو أخرويًا إلا أن يتوب الله عليه.",
        "commentary_en": "The five-word core is “مَن يَعْمَلْ سُوءًا يُجْزَ بِهِ”: whoever commits evil will be repaid for it—whether in this life or the next—unless Allah grants repentance."
      }
    },
    {
      "qNum": 17,
      "question_ar": "بعض الناس يفرح لسلامته إذا أصاب المؤمنين أذى، بدل أن ينصرهم. اذكر آية توقظ من هذا حاله.",
      "question_en": "Some people feel relieved when believers are harmed—as long as they are safe—instead of supporting them. Cite an ayah that should awaken such a person.",
      "answer": {
        "surah": 4,
        "ayahs": [
          72
        ],
        "ayah_ar": "وَإِنَّ مِنكُمْ لَمَن لَّيُبَطِّئَنَّ ۖ فَإِنْ أَصَابَتْكُم مُّصِيبَةٌ قَالَ قَدْ أَنْعَمَ اللَّهُ عَلَيَّ إِذْ لَمْ أَكُن مَّعَهُمْ شَهِيدًا",
        "commentary_ar": "تصوّر الآية نفسية المُثبِّط الشامت الذي يرى سلامته «نعمة» عند مصيبة إخوانه، لأنه لا يحمل همّ النصرة ولا يخاف التقصير.",
        "commentary_en": "It depicts the cowardly demoralizer who treats being absent during others’ suffering as a ‘favor,’ revealing a heart lacking solidarity and sacrifice."
      }
    },
    {
      "qNum": 18,
      "question_ar": "اذكر آية من جزء اليوم وضحت من هم «الذين أنعمت عليهم» المذكورون في الفاتحة.",
      "question_en": "Cite an ayah from today’s juz that clarifies who “those You have favored” in al-Fatiha are.",
      "answer": {
        "surah": 4,
        "ayahs": [
          69
        ],
        "ayah_ar": "وَمَن يُطِعِ اللَّهَ وَالرَّسُولَ فَأُولَٰئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِم مِّنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ ۚ وَحَسُنَ أُولَٰئِكَ رَفِيقًا",
        "commentary_ar": "هذه الآية تفسر «الذين أنعمت عليهم» بذكر أصنافهم: النبيين والصديقين والشهداء والصالحين.",
        "commentary_en": "It explains “those You have favored” by naming them: prophets, the truthful, the martyrs, and the righteous."
      }
    },
    {
      "qNum": 19,
      "question_ar": "اذكر جزءًا من آية يبين أن طلب العزة عند الكافرين سينتهي بعكسه تمامًا في الآخرة.",
      "question_en": "Provide part of an ayah showing that seeking honor with disbelievers ends with the opposite outcome in the Hereafter.",
      "answer": {
        "surah": 4,
        "ayahs": [
          145
        ],
        "ayah_ar": "إِنَّ الْمُنَافِقِينَ فِي الدَّرْكِ الْأَسْفَلِ مِنَ النَّارِ وَلَن تَجِدَ لَهُمْ نَصِيرًا",
        "commentary_ar": "من طلب العزة عند الكافرين يُنكس في الآخرة إلى «الدرك الأسفل»؛ نقيض العلو الذي طلبه.",
        "commentary_en": "Those who chase status through alliance with disbelief may end up in the ‘lowest depths’—the reverse of the elevation they sought."
      }
    },
    {
      "qNum": 20,
      "question_ar": "قد يتستر البعض على خيانة موظف أو اختلاسه بحجة الرحمة. اذكر آية تُسمي ذلك باسمه وتنهى عنه.",
      "question_en": "Some people conceal an employee’s betrayal or theft, calling it ‘mercy.’ Cite an ayah that names the matter properly and forbids it.",
      "answer": {
        "surah": 4,
        "ayahs": [
          135
        ],
        "ayah_ar": "يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ بِالْقِسْطِ شُهَدَاءَ لِلَّهِ وَلَوْ عَلَىٰ أَنفُسِكُمْ أَوِ الْوَالِدَيْنِ وَالْأَقْرَبِينَ ۚ إِن يَكُنْ غَنِيًّا أَوْ فَقِيرًا فَاللَّهُ أَوْلَىٰ بِهِمَا ۖ فَلَا تَتَّبِعُوا الْهَوَىٰ أَن تَعْدِلُوا ۚ وَإِن تَلْوُوا أَوْ تُعْرِضُوا فَإِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا",
        "commentary_ar": "تنهى الآية عن اتباع الهوى في الشهادة والستر؛ فلا يُسمّى كتمان الحق «رحمة»، بل هو ميلٌ عن العدل.",
        "commentary_en": "It commands justice in testimony and warns against desire-driven distortion or concealment—covering betrayal isn’t ‘mercy’ if it undermines justice."
      }
    },
    {
      "qNum": 21,
      "question_ar": "آية من سورة الحديد فسرت آية من الجزء الخامس (عن المنافقين). ما آية الجزء الخامس المقصودة؟",
      "question_en": "A verse in Surah al-Hadid explains a verse from Juz 5 about hypocrites. Which Juz 5 verse is it?",
      "answer": {
        "surah": 4,
        "ayahs": [
          142
        ],
        "ayah_ar": "إِنَّ الْمُنَافِقِينَ يُخَادِعُونَ اللَّهَ وَهُوَ خَادِعُهُمْ وَإِذَا قَامُوا إِلَى الصَّلَاةِ قَامُوا كُسَالَىٰ يُرَاءُونَ النَّاسَ وَلَا يَذْكُرُونَ اللَّهَ إِلَّا قَلِيلًا",
        "commentary_ar": "ذكر ابن كثير أن حالهم يوم القيامة وطلبهم النور كما في الحديد يشرح معنى «وهو خادعهم» واستدراجهم وخذلانهم.",
        "commentary_en": "Ibn Kathir notes that their Hereafter scene—seeking light in al-Hadid—clarifies what it means that Allah ‘outwits them’: He leaves them to their deception, then abandons them at the moment they need light."
      }
    }
  ]
}